{
 "1.1": [
  "如是我聞：一時",
  "如是我聞：一時，",
  "如是我聞：一時，",
  "如是我聞：一時，",
  " evaṃ mayā śrutam ekasmin samaye |",
  " འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།"
 ],
 "1.2": [
  "世尊聞者遊行勝林中，無親搏施與園中，大比丘眾共，半三十比丘百。",
  "佛在舍衛國祇樹給孤獨園，與大比丘眾千二百五十人俱。",
  "薄伽梵在室羅筏，住誓多林給孤獨園，與大苾芻眾千二百五十人俱。",
  "薄伽梵在名稱大城戰勝林施孤獨園，與大苾芻眾千二百五十人俱，及大菩薩眾。",
  "Bhagavāñ Śrāvastyāṃ viharati sma Jetavane 'nāthapiṇḍadasya-ārāmemahatā bhikṣu-saṁghena sārdham ardhatrayodaśabhir bhikṣu-śataiḥsambahulaiś ca bodhisattvair mahāsattvaiḥ |",
  "བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང༌། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་དང་ཐབས་གཅིག་ཏུ་བཞུགས་སོ། །"
 ],
 "1.3": [
  "爾時，世尊前分時，上裙著已，器上絡衣持，聞者大城搏為入。",
  "爾時，世尊食時，著衣持缽，入舍衛大城乞食。",
  "爾時，世尊於日初分，整理裳服，執持衣缽，入室羅筏大城乞食。",
  "爾時，世尊於日初分時，著衣持缽，入城乞食。",
  " atha khalu Bhagavān pūrvāhṇa-kāla-samaye nivāsya pātracīvaram ādāyaŚrāvastīṃ mahā-nagarīṃ piṇḍāya prāvikṣat |",
  " དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོའ ི་དུས་ཀྱི་ཚĲ། ཤམ་ཐབས་དང་ཆོས་གོས་སྐུ་ལ་གསོལ་ཏེ། ལྷུང་བཟེད་བསྣམས་ནས་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་ཞུགས་སོ། །"
 ],
 "1.4": [
  "爾時，世尊聞者大城搏為行已，作已食作已，後食搏墮過，器上絡衣收攝，兩足洗，坐具世尊施設，如是座中跏趺結，直身作，現前念近住。",
  "於其城中，次第乞已，還至本處。飯食訖，收衣缽，洗足已，敷座而坐。",
  "時薄伽梵，於其城中，行乞食已，出還本處。飯食訖，收衣缽，洗足已，於食後時，敷如常座，結跏趺坐，端身正願，住對面念。",
  "次第乞已，還至本處。飯食訖，收衣缽，洗足已，於先設座，跏趺端坐，正念而住。",
  "atha khalu Bhagavāñ Śrāvastīṃ mahā-nagarīṃ piṇḍāya caritvākṛta-bhakta-kṛtyaḥ paścādbhakta-piṇḍapāta-pratikrāntaḥ pātra-cīvaraṃpratiśāmya pādau prakṣalya nyaṣīdat prajñapta eva-āsane paryaṅkamābhujya ṛjuṃ kāyaṃ praṇidhāya pratimukhīṃ smṛtim upasthāpya |",
  " དེ་ནས་བཅོམ་ལྡན་འདས་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་གཤེགས་ནས་བསོད་སྙོམས་ཀྱི་ཞལ་ཟས་མཇུག་ཏུ་གསོལ་ཏེ། ཟས་ཀྱི་བྱ་བ་མཛད་ནས། ཟས་ཕྱི་མའི་བསོད་སྙོམས་སྤངས་པས།ལྷུང་བཟེད་དང་ཆོས་གོས་བཞག་ནས།"
 ],
 "1.5": [
  "爾時，多比丘，若世尊彼詣到已，世尊兩足頂禮，世尊邊三右繞作已，一邊坐。",
  "（缺譯）",
  "時，諸苾芻來詣佛所。到已，頂禮世尊雙足，右遶三匝，退坐一面。",
  "時，諸苾芻來詣佛所，頂禮雙足，右繞三匝，退坐一面。",
  "atha khalu sambahulā bhikṣavo yena Bhagavāṃs tenopasaṃkraman upasaṃkramya Bhagavataḥ pādau śirobhir abhivandya Bhagavantaṃ triṣpradakṣiṇīkṛtya ekānte nyaṣīdan||1||",
  "དེ་ནས་དགེ་སློང་མང་པོས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །"
 ],
 "2.1": [
  "彼復時，命者善實，彼所如是眾聚集會坐。",
  "（缺譯）",
  "具壽善現亦於如是眾會中坐。",
  "（缺譯）",
  " tena khalu punaḥ samayena āyuṣmān subhūtis tasyām eva parṣadisaṃnipatito 'bhūt saṃniṣaṇṇaḥ |",
  " ཡང་དེའི་ཚĲ་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ།།"
 ],
 "2.2": [
  "爾時，命者善實起坐。一肩上著作已，右膝輪地著已，若世尊，彼合掌，向世尊邊如是言。",
  "時長老須菩提，在大眾中，即從座起，偏袒右肩，右膝著地，合掌恭敬，而白佛言：",
  "爾時眾中，具壽善現，從座而起，偏袒一肩，右膝著地，合掌恭敬，而白佛言：",
  "爾時，具壽妙生在大眾中，承佛神力，即從座起，偏袒右肩，右膝著地，合掌恭敬，白佛言：",
  " atha khalv āyuṣmān subhūtir utthāya-āsanād ekāṃsam uttarāsaṅgaṃ kṛtvādakṣiṇaṃ jānu-maṇḍalaṃ pṛthivyāṃ pratiṣṭhāpya yena bhagavāṃs tenaañjaliṃ praṇamya bhagavantam etad avocat |",
  "དེ་ནས་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །"
 ],
 "2.3": [
  "希有，世尊！乃至所有如來、應、正遍知，菩薩摩訶薩順攝，最勝順攝；乃至所有如來、應、正遍知，菩薩摩訶薩付囑，最勝付囑。",
  "希有，世尊！如來善護念諸菩薩，善付囑諸菩薩。",
  "希有，世尊，乃至如來、應、正等覺，能以最勝攝受，攝受諸菩薩摩訶薩；乃至如來、應、正等覺，能以最勝付囑，付囑諸菩薩摩訶薩。",
  "希有，世尊！希有，善逝！如來、應、正等覺，能以最勝利益，益諸菩薩；能以最勝付囑，囑諸菩薩。",
  " āścaryaṃ bhagavan parama-āścaryaṃ sugata yāvad eva tathāgatena-arhatāsamyaksaṃbuddhena bodhisattvā mahāsattvā anuparigṛhītāḥ parameṇaanugraheṇa | āścaryaṃ bhagavan yāvad eva tathāgatenārhatāsamyaksaṃbuddhena bodhisattvā mahāsattvāḥ parīnditāḥ paramayāparīndanayā |",
  "བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཕན་གདགས་པའི་དམ་པ་ཇི་སྙེད་པས་ཕན་གཏགས་པ་དང༌།དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཡོངས་སུ་གཏད་པའི་དམ་པ་ཇི་སྙེད་པས་ཡོངས་སུ་གཏད་པ་ནི། བཅོམ་ལྡན་འདས་ངོ་མཚར་ལགས་སོ། ། བདེ་བར་གཤེགས་པ་ངོ་མཚར་ལགས་སོ། ། 14"
 ],
 "2.4": [
  "彼云何，世尊！菩薩乘發行，住應？云何修行應？云何心降伏應？",
  "世尊！善男子、善女人發阿耨多羅三藐三菩提心，應云何住？云何降伏其心?",
  "世尊！諸有發趣菩薩乘者，應云何住？云何修行？云何攝伏其心?",
  "世尊！若有發趣菩薩乘者，云何應住？云何修行？云何攝伏其心?",
  " tat kathaṃ bhagavan bodhisattvayāna saṃprasthitena kulaputreṇa vākuladuhitrā vā sthātavyaṃ | kathaṃ pratipattavyaṃ | kathaṃ cittaṃpragrahītavyam |",
  "བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་བར་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི། ཇི་ལྟར་བསྒྲུབ་པར་བགྱི། ཇི་ལྟར་སེམས་རབ་ཏུ་བཟུང་བར་བགྱི།"
 ],
 "2.5": [
  "如是語已。世尊，命者善實邊如是言：善，善！善實！如是，如是！善實！如是，如是。",
  "佛言：善哉、善哉！須菩提，如汝所說，",
  "作是語已，爾時，世尊告具壽善現曰：善哉、善哉！善現，如是、如是，如汝所說，",
  "佛告妙生：善哉、善哉！如是、如是！如汝所說，",
  " evam ukte bhagavān āyuṣmantaṃ subhūtim etad avocat | sādhu sādhusubhūte evam etad yathā vadasi |",
  "དེ་སྐད་ཅེས་གསོལ་བ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། ། རབ་འབྱོར་ལེགས་སོ་ལེགས་སོ། ། རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། ། དེ་དེ་བཞིན་ཏེ།"
 ],
 "2.6": [
  "順攝，如來，菩薩摩訶薩最勝順攝；付囑，如來，菩薩摩訶薩最勝付囑。",
  "如來善護念諸菩薩，善付囑諸菩薩。",
  "乃至如來、應、正等覺，能以最勝攝受，攝受諸菩薩摩訶薩；乃至如來、應、正等覺，能以最勝付囑，付囑諸菩薩摩訶薩。",
  "如來以勝利益，益諸菩薩；以勝付囑，囑諸菩薩。",
  " anuparigṛhītās tathāgatena bodhisattvā mahāsattvāḥ parameṇa anugraheṇa| parīnditās tathāgatena bodhisattvā mahasattvāḥ paramayā parīndanayā |",
  "དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཕན་གདགས་པའི་དམ་པས་ཕན་གཏགས་སོ། ། དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཡོངས་སུ་གཏད་བའི་དམ་པས་ཡོངས་སུ་གཏད་དོ། །"
 ],
 "2.7": [
  "彼，善實！聽善，善意念作，說當。如菩薩乘發行住應，如修行應，如心降伏應。",
  "汝今諦聽，當為汝說！善男子、善女人發阿耨多羅三藐三菩提心，應如是住、如是降伏其心。」 ",
  "是故，善現，汝應諦聽，極善作意，吾當為汝分別解說！諸有發趣菩薩乘者，應如是住、如是修行、如是攝伏其心。」",
  "妙生，汝應諦聽，極善作意，吾當為汝分別解說！若有發趣菩薩乘者，應如是住、如是修行、如是攝伏其心。」",
  " tena hi subhūte śṛṇu sādhu ca suṣṭhu ca manasikuru | bhāṣiṣye 'haṃ te |yathā bodhisattva-yāna-saṃprasthitena sthātavyaṃ | yathā pratipattavyaṃ |yathā cittaṃ pragrahītavyam |",
  "རབ་འབྱོར་དེའི་ཕྱིར་ཉོན་ལ་ལེགས་པར་རབ་ཏུ་ཡིད་ལ་ཟུངས་ཤིག་དང༌། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་བཞུགས་པས་ཇི་ལྟར་གནས་པར་བྱ་བ་དང༌། ཇི་ལྟར་བསྒྲུབ་པར་བྱ་བ་དང༌། ཇི་ལྟར་སེམས་རབ་ཏུ་བཟུང་བར་བྱ་བ་ངས་ཁྱོད་ལ་བཤད་དོ། །"
 ],
 "2.8": [
  "‘如是，世尊！’命者善實，世尊邊願欲聞。",
  "「唯然，世尊！」願樂欲聞。",
  "具壽善現白佛言：「如是 ，世尊！」願樂欲聞。 ",
  "妙生言：「唯然，世尊！」願樂欲聞。",
  " evaṃ bhagavan ity āyuṣmān subhūtir bhagavataḥ pratyaśrauṣīt ||2||",
  "བཅོམ་ལྡན་འདས་དེ་དེ་བཞིན་ནོ་ཞེས་གསོལ་ནས། ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་པ་དང༌།"
 ],
 "3.1": [
  "世尊於此言：「此，善實！菩薩乘發行，如是心發生應。",
  "佛告須菩提∶諸菩薩摩訶薩，應如是降伏其心，",
  "佛言∶善現，諸有發趣菩薩乘者，應當發趣如是之心，",
  "佛告妙生∶若有發趣菩薩乘者，當生如是心，",
  " bhagavān etad avocat | iha subhūte bodhisattva-yāna-saṃprasthitena evaṃcittam utpādayitavyaṃ |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པས།"
 ],
 "3.2": [
  "所有，善實！眾生，眾生攝攝已，卵生、若胎生、若濕生、若化生，若色、若無色，若想、若無想、若非想非無想，所有眾生界施設已，彼我一切無受餘涅槃界滅度應。",
  "所有一切眾生之類，若卵生、若胎生、若濕生、若化生、若有色、若無色、若有想、若無想、若非有想非無想，我皆令入無餘涅槃而滅度之；",
  "所有諸有情，有情攝所攝，若卵生、若胎生、若濕生、若化生、若有色、若無色、若有想、若無想、若非有想非無想，乃至有情界施設所施設，如是一切，我當皆令於無餘依妙涅槃界而般涅槃；",
  "所有一切眾生之類，若卵生、胎生、濕生、化生、若有色、無色、有想、無想、非有想非無想，盡諸世界所有眾生，如是一切，我皆令入無餘涅槃而滅度之；",
  " yāvantaḥ subhūte sattvāḥ sattvadhātau sattva-saṃgraheṇa saṃgṛhītāaṇḍajā vā jarāyujā vā saṃsvedajā vā aupapādukā vā rūpiṇo vā arūpiṇo vāsaṃjñino vā asaṃjñino vā naiva aṃjñino nāsaṃjñino vā yāvān kaścitsattvadhātuḥ prajñapya-mānaḥ prajñapyate te ca mayā sarve 'nupadhiśeṣenirvāṇadhātau parinirvāpayitavyāḥ |",
  "འདི་སྙམ་དུ་བདག་གིས་སེམས་ཅན་ཇི་ཙམ་སེམས་ཅན་དུ་བསྡུ་བས་བསྡུས་པ། སྒོ་ང་ལས་སྐྱེས་པའམ།མངལ་ལས་སྐྱེས་པའམ། དྲོད་གཤེར་ལས་སྐྱེས་པའམ། རྫུས་ཏེ་སྐྱེས་པའམ། གཟུགས་ཅན་ནམ། གཟུགས་ཅན་མ་ཡིན་པའམ། འདུ་ཤེས་ཅན་ནམ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་ནམ། སེམས་ཅན་གྱི་ཁམས་ཇི་ཙམ་སེམས་ཅན་དུ་གདགས་བས་བརྟགས་པ་དེ་དག་ཐམས་ཅད་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ། །"
 ],
 "3.3": [
  "如是無量雖眾生滅度，無有一眾生滅度有。",
  "如是滅度無量無數無邊眾生，實無眾生得滅度者。",
  "雖度如是無量有情，令滅度已，而無有情得滅度者。",
  "雖令如是無量眾生證圓寂已，而無有一眾生入圓寂者。",
  " evam aparimāṇān api sattvān parinirvāpya na kaścit sattvaḥ parinirvāpitobhavati |",
  "དེ་ལྟར་སེམས་ཅན་ཚད་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང༌། སེམས་ཅན་གང་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་བ་མེད་དོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ། །"
 ],
 "3.4": [
  "彼何所因？若，善實！菩薩摩訶薩眾生想轉，不彼菩薩摩訶薩名說應。",
  "（缺譯）",
  "何以故？善現，若諸菩薩摩訶薩有情想轉，不應說名菩薩摩訶薩。",
  "何以故？妙生，若菩薩有眾生想者，則不名菩薩。",
  " tat kasya hetoḥ | sacet subhūte bodhisattvasya sattva-saṃjñā pravarteta na sa bodhisattva iti vaktavyaḥ | ",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་དུ་འདུ་ཤེས་འཇུག་ན། དེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱ་བའི་ཕྱིར་རོ། །"
 ],
 "3.5": [
  "彼何所因？不彼，善實！菩薩名說應，若眾生想轉，壽想若、人想若轉。",
  "何以故？須菩提，若菩薩有我相、人相、眾生相、壽者相，即非菩薩。",
  "所以者何？善現，若諸菩薩摩訶薩，不應說言有情想轉，如是命者想、士夫想、補特伽羅想、意生想、摩納婆想、作者想、受者想轉，當知亦爾。何以故？ 善現，無有少法，名為發趣菩薩乘者 。",
  "所以者何？由有我想、眾生想、壽者想，更求趣想故。",
  " tat kasya hetoḥ | na sa subhūte bodhisattvo vaktavyo yasya ātma-saṃjñāpravarteta sattva-saṃjñā vā jīva-saṃjñā vā pudgala-saṃjñā vā pravarteta||3||",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གང་སེམས་ཅན་དུ་འདུ་ཤེས་འཇུག་གམ། སྲོག་ཏུ་འདུ་ཤེས་འཇུག་གམ། གང་ཟག་ཏུ་འདུ་ཤེས་འཇུག་ན། དེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱ་བའི་ཕྱིར་རོ། །"
 ],
 "4.1": [
  "雖然復次時，善實！不菩薩摩訶薩事住施與應，無所住施與應。",
  "復次，須菩提，菩薩於法，應無所住行於布施。",
  "復次，善現，若菩薩摩訶薩，不住於事應行布施，都無所住應行布施；",
  "復次，妙生，菩薩不住於事應行布施，不住隨處應行布施；",
  " api tu khalu punaḥ subhūte na bodhisattvena vastupratiṣṭhitena dānaṃdātavyaṃ | na kvacit pratiṣṭhitena dānaṃ dātavyaṃ |",
  "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་དངོས་པོ་ལ་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། ། ཅི་ལ་ཡང་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །"
 ],
 "4.2": [
  "不色住施與應，不聲、香、味、觸、法中住施與應。",
  "所謂不住色布施，不住聲、香、味、觸、法布施。",
  "不住於色應行布施，不住聲、香、味、觸、法應行布施。",
  "不住色、聲、香、味、觸、法，應行布施。",
  " na rūpa-pratiṣṭhitena dānaṃ dātavyaṃ | naśabda-gandha-rasa-spraṣṭavya-dharmeṣu pratiṣṭhitena dānaṃ dātavyam |",
  "གཟུགས་ལ་ཡང་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། ། དེ་བཞིན་དུ་སྒྲ་དང༌། དྲི་དང་། རོ་དང༌། རེག་བྱ་དང༌།ཆོས་ལ་ཡང་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །"
 ],
 "4.3": [
  "如是，此，善實！菩薩摩訶薩施與應，如不相想亦住。",
  "須菩提，菩薩應如是布施，不住於相。",
  "善現，如是菩薩摩訶薩，如不住相想應行布施。",
  "妙生，菩薩如是布施，乃至相想亦不應住。",
  " evaṃ hi subhūte bodhisattvena mahāsattvena dānaṃ dātavyaṃ | yathā nanimitta-saṃjñāyām api pratitiṣṭhet |",
  "རབ་འབྱོར་ཅི་ནས་ཀྱང་མཚན་མར་འདུ་ཤེས་པ་ལ་ཡང་མི་གནས་པར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་སྦྱིན་ནོ། །"
 ],
 "4.4": [
  "彼何所因？若，善實！菩薩摩訶薩不住與施，彼所，善實！福聚不可量受取。",
  "何以故？若菩薩不住相布施，其福德不可思量。",
  "何以故？善現，若菩薩摩訶薩都無所住而行布施，其福德聚不可取量。",
  "何以故？由不住施，福聚難量。",
  " tat kasya hetoḥ | yaḥ subhūte bodhisattvo 'pratiṣṭhito dānaṃ dadāti tasyasubhūte puṇya-skandhasya na sukaraṃ pramāṇam udgrahītum |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་གང་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པ་དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི། རབ་འབྱོར་ཚད་གཟུང་བར་སླ་བ་མ་ཡིན་པའི་ཕྱིར་རོ། །"
 ],
 "4.5": [
  "彼何意念？善實！可前方虛空，量受取？",
  "須菩提！於意云何，東方虛空，可思量不？",
  "佛告善現：「於汝意云何，東方虛空，可取量不？",
  "妙生！於汝意云何，東方虛空，可知量不？",
  " tat kiṃ manyase subhūte sukaraṃ pūrvasyāṃ diśy ākāśasyapramāṇamudgrahītum |",
  "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། ཤར་ཕྱོགས་ཀྱི་ནམ་མཁའི་ཚད་གཟུང་བར་སླ་སྙམ་མམ།"
 ],
 "4.6": [
  "善實言：‘不如此，世尊！’",
  "不也，世尊！",
  "善現答言：不也，世尊！",
  "妙生言：不爾，世尊！ ",
  " subhūtir āha | no hīdaṃ bhagavan |",
  "རབ་འབྱོར་གྱིས་གསོལ་བ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །"
 ],
 "4.7": [
  "世尊言：‘如是右、後、高、下、上方，順不正方，普十方，可虛空量受取？’",
  "須菩提！南西北方、四維上下虛空，可思量不？",
  "善現！如是南西北方、四維上下、周遍十方一切世界虛空，可取量不？",
  "南西北方、四維上下、十方虛空，可知量不？",
  " bhagavān āha |evaṃ dakṣiṇa-paścima-uttarāsvadha-ūrdhvaṃ digvidikṣusamantād daśasu dikṣu sukaram ākāśasya pramāṇam udgrahītum |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་ལྷོ་དང༌། ནུབ་དང༌། བྱང་དང༌། སྟེང་དང༌།འོག་གི་ཕྱོགས་དང༌། ཕྱོགས་མཚམས་དང༌། ཕྱོགས་བཅུའི་ནམ་མཁའི་ཚད་བཟུང་བར་སླ་སྙམ་མམ།"
 ],
 "4.8": [
  "善實言：‘不如此，世尊！’",
  "不也，世尊！",
  "善現答言：不也，世尊！",
  "妙生言：不爾，世尊！",
  " subhūtir āha | no hīdaṃ bhagavan |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །"
 ],
 "4.9": [
  "世尊言：‘如是，如是！善實！如是，如是！若菩薩摩訶薩不住施與，彼所，善實！福聚不可量受取。’",
  "須菩提！菩薩無住相布施，福德亦復如是不可思量。",
  "佛言：善現，如是、如是！若菩薩摩訶薩都無所住而行布施，其福德聚不可取量，亦復如是。",
  "妙生！菩薩行不住施所得福聚，不可知量，亦復如是。",
  " bhagavān āha | evam eva subhūte yo bodhisattvo 'pratiṣṭhito dānaṃ dadātitasya subhūte puṇyaskandhasya na sukaraṃ pramāṇam udgrahītum |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ཡང་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པ་དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི། རབ་འབྱོར་ཚད་བཟུང་བར་སླ་བ་མ་ཡིན་པའི་ཕྱིར་རོ། །"
 ],
 "4.10": [
  "雖然復次時，善實！如是菩薩乘發行施與應，如不相想亦住。",
  "須菩提，菩薩但應如所教住。",
  "善現，菩薩如是如不住相想應行布施。",
  "（缺譯）",
  " evaṃ hi subhūte bodhisattva-yāna-saṃprasthitena dānaṃ dātavyaṃ yathāna nimitta-saṃjñāyām api pratitiṣṭhet ||4||",
  " （缺譯）"
 ],
 "5.1": [
  "彼何意念？善實！相具足如來見應？",
  "須菩提！於意云何，可以身相見如來不？",
  "佛告善現：於汝意云何，可以諸相具足觀如來不？",
  "妙生！於汝意云何，可以具足勝相觀如來不？",
  " tat kiṃ manyase subhūte lakṣaṇa-sampadā tathāgato draṣṭavyaḥ |",
  "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། མཚན་ཕུན་སུམ་ཚŀགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་བྱ་སྙམ་མམ།"
 ],
 "5.2": [
  "善實言：‘不，世尊！相具足如來見應。’",
  "不也，世尊，不可以身相得見如來！",
  "善現答言：不也，世尊，不應以諸相具足觀於如來！",
  "妙生言：不爾，世尊，不應以勝相觀於如來！",
  " subhūtir āha | no hīdaṃ bhagavan na lakṣaṇa-saṃpadā tathāgatodraṣṭavyaḥ |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། ། མཚན་ཕུན་སུམ་ཚŀགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བགྱི་ལགས་སོ། །"
 ],
 "5.3": [
  "彼何所因？若彼，如來相具足說；彼如是非相具足。",
  "何以故？如來所說身相，即非身相。",
  "何以故？如來說諸相具足，即非諸相具足。",
  "何以故？如來說勝相，即非勝相。",
  " tat kasya hetoḥ | yā sā bhagavan lakṣaṇa-saṃpat tathāgatena bhāṣitā saivaalakṣaṇa-saṃpat |",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་མཚན་ཕུན་སུམ་ཚŀགས་པ་ཞེས་གང་གསུངས་པ་དེ་ཉིད། མཚན་ཕུན་སུམ་ཚŀགས་པ་མ་མཆིས་པའི་སླད་དུའོ། །"
 ],
 "5.4": [
  "如是語已。世尊，命者善實邊如是言：",
  "佛告須菩提：",
  "說是語已，佛復告具壽善現言：",
  "（缺譯）",
  " evam ukte bhagavān āyuṣmantaṃ subhūtim etad avocat |",
  "དེ་སྐད་ཅེས་གསོལ་པ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །"
 ],
 "5.5": [
  "所有，善實！相具足，所有妄，所有不相具足，所有不妄，名此相不相如來見應。",
  "凡所有相，皆是虛妄！若見諸相、非相，則見如來！",
  "善現！乃至諸相具足，皆是虛妄！乃至非相具足，皆非虛妄！如是以相、非相應觀如來！",
  "妙生！所有勝相，皆是虛妄！若無勝相，即非虛妄！是故應以勝相、無相觀於如來！",
  " yāvat subhūte lakṣaṇa-saṃpat tāvan mṛṣā | yāvad alakṣaṇa-saṃpat tāvan namṛṣeti | hi lakṣaṇa-alakṣaṇatas tathāgato draṣṭavyaḥ ||5||",
  "རབ་འབྱོར་ཇི་སྙམ་དུ་མཚན་ཕུན་སུམ་ཚŀགས་པ་དེ་ཙམ་དུ་བརྫུན་ནོ། ། ཇི་ཙམ་དུ་མཚན་ཕུན་སུམ་ཚŀགས་པ་མེད་པ་དེ་ཙམ་དུ་མི་བརྫུན་ཏེ། དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་ལ་མཚན་དང་མཚན་མ་མེད་པར་བལྟའོ། །"
 ],
 "6.1": [
  "如是語已。命者善實，世尊邊如是言：",
  "須菩提白佛言：",
  "說是語已，具壽善現復白佛言：",
  "妙生言：",
  " evam ukta āyuṣmān subhūtir bhagavantam etad avocat |",
  "དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང༌། བཅོམ་ལྡན་འདས་ལ་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །"
 ],
 "6.2": [
  "雖然，世尊！頗有眾生當有，未來世，後時、後長時、後分五百，正法破壞時中，轉時中，若此中，如是色類經中說中，實想發生當有？",
  "世尊！頗有眾生，得聞如是言說章句，生實信不 ？",
  "世尊！頗有有情於當來世，後時、後分、後五百歲，正法將滅時分轉時，聞說如是色經典句，生實想不？",
  "世尊！頗有眾生，於當來世，後五百歲，正法滅時，聞說是經，生實信不？",
  " asti bhagavan kecit sattvā bhaviṣyanty anāgate 'dhvani paścime kālepaścime samaye paścimāyāṃ pañca-śatyāṃ saddharma-vipralopa-kālevartamāne ya imeṣv evaṃrūpeṣu sūtrānta-padeṣu bhāṣyamāṇeṣubhūta-saṃjñām utpādayiṣyanti |",
  "བཅོམ་ལྡན་འདས་མ་འོངས་པའི་དུས་ལྔ་བརྒྱའི་ཐ་མ་ལ། དམ་པའི་ཆོས་རབ་ཏུ་རྣམ་པར་འཇིག་པར་འགྱུར་བ་ན། སེམས་ཅན་གང་ལ་ལ་དག་འདི་ལྟ་བུའི་མདོ་སྡེའི་ཚིག་བཤད་པ་དག་ལ་ཡང་དག་པར་འདུ་ཤེས་བསྐྱེད་པར་འགྱུར་བ་འབྱུང་པ་ལྟ་མཆིས་ལགས་སམ།"
 ],
 "6.3": [
  "世尊言：莫，善實！汝如是語：‘雖然，世尊！頗有眾生，當有未來世，後時、後長時、後分五百，正法破壞時中，轉時中，若此中，如是色類經中說中，實想發生當有？’",
  "佛告須菩提：莫作是說。",
  "佛告善現：勿作是說：『頗有有情於當來世，後時、後分、後五百歲，正法將滅時分轉時，聞說如是色經典句，生實想不？』",
  "佛告妙生：莫作是說：『頗有眾生，於當來世，後五百歲，正法滅時，聞說是經，生實信不？』",
  "bhagavān āha | mā subhūte tvam evaṃ vocaḥ | asti kecit sattvā bhaviṣyantyanāgate 'dhvani paścime kāle paścime samaye paścimāyāṃ pañcaśatyāṃsaddharma-vipralope vartamāne ya imeṣv evaṃrūpeṣu sūtrāntapadeṣubhāṣyamāṇeṣu bhūta-saṃjñām utpādayiṣyanti |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གང་ཁྱོད་འདི་སྐད་དུ་མ་འོངས་པའི་དུས་ལྔ་བརྒྱའི་ཐ་མ་ལ།དམ་པའི་ཆོས་རབ་ཏུ་རྣམ་པར་འཇིག་པར་འགྱུར་བ་ན། སེམས་ཅན་གང་ལ་ལ་དག་འདི་ལྟ་བུའི་མདོ་སྡེའི་ཚིག་བཤད་པ་དག་ལ་ཡང་དག་པར་འདུ་ཤེས་བསྐྱེད་པར་འགྱུར་བ་འབྱུང་བ་ལྟ་མཆིས་ལགས་སམ་ཞེས་ཁྱོད་དེ་སྐད་མ་ཟེར་ཅིག །"
 ],
 "6.4": [
  "雖然復次時，善實！當有未來世，菩薩摩訶薩，後分五百，正法破壞時中，轉時中，戒究竟、功德究竟、智慧究竟。",
  "如來滅後，後五百歲，有持戒修福者，",
  "然復，善現，有菩薩摩訶薩於當來世，後時、後分、後五百歲，正法將滅時分轉時，具足尸羅、具德、具慧；",
  "妙生！當來之世有諸菩薩具戒、具德、具慧；",
  "api tu khalu punaḥ subhūte bhaviṣyanty anāgate 'dhvani bodhisattvāmahāsattvāḥ paścime kāle paścime samaye paścimāyāṃ pañca-śatyāṃsaddharma-vipralope vartamāne guṇavantaḥ śīlavantaḥ prajñāvantaś cabhaviṣyanti",
  "རབ་འབྱོར་མ་འོངས་པའི་དུས་ལྔ་བརྒྱའི་ཐ་མ་ལ། དམ་པའི་ཆོས་རབ་ཏུ་རྣམ་པར་འཇིག་པར་འགྱུར་བ་ན།བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་དང་ལྡན་པ། ཡོན་ཏན་དང་ལྡན་པ། ཤེས་རབ་དང་ལྡན་པ་དག་འབྱུང་སྟེ།"
 ],
 "6.6": [
  "不，復次時，彼，善實！菩薩摩訶薩一佛親近供養當有，不一佛種植善根。",
  "當知是人，不於一佛、二佛、三四五佛而種善根，",
  "復次，善現，彼菩薩摩訶薩非於一佛所承事供養、非於一佛所種諸善根，",
  "而彼菩薩，非於一佛承事供養、植諸善根，",
  " na khalu punas te subhūte bodhisattvā mahāsattvā eka-buddha-paryupāsitābhaviṣyanti | na eka-buddha-avaropita-kuśala-mūlā bhaviṣyanti |",
  "རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་། སངས་རྒྱས་གཅིག་ལ་བསྙེན་བཀུར་བྱས་པ་མ་ཡིན། སངས་རྒྱས་གཅིག་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མ་ཡིན་གྱི།"
 ],
 "6.7": [
  "雖然復次時，善實！不一佛百千親近供養，不一佛百千種植善根，彼菩薩摩訶薩當有，",
  "已於無量千萬佛所種諸善根，",
  "然復，善現，彼菩薩摩訶薩於其非一百千佛所承事供養、於其非一百千佛所種諸善根。",
  "已於無量百千佛所而行奉事，植諸善根。",
  " api tu khalu punaḥ subhūte aneka-buddha-śatasahasra-paryupāsitāaneka-buddha-śatasahasra-avaropita-kuśala-mūlās te bodhisattvāmahāsattvā bhaviṣyanti |",
  "རབ་འབྱོར་སངས་རྒྱས་འབུམ་ཕྲག་དུ་མ་ལ་བསྙེན་བཀུར་བྱས་ཤིང་སངས་རྒྱས་འབུམ་ཕྲག་དུ་མ་ལ་དགེ་བའི་རྩ་བ་དག་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་འབྱུང་ངོ། །"
 ],
 "6.8": [
  "若此中，如是色類中，經句中說中，一心淨信亦得當。",
  "聞是章句，乃至一念，生淨信者，",
  "乃能聞說如是色經典句，當得一淨信心。",
  "是人乃能於此經典，生一信心。",
  " ya imeṣv evaṃrūpeṣu sūtrānta-padeṣu bhāṣyamāṇeṣv ekacitta-prasādam apipratilapsyante |",
  "རབ་འབྱོར་གང་དག་འདི་ལྟ་བུའི་མདོ་སྡེའི་བཤད་པ་དགེ་ལ་སེམས་དད་པ་གཅིག་ཙམ་རྙེད་པར་འགྱུར་བ་དེ་དག་ནི།"
 ],
 "6.9": [
  "知彼，善實！如來佛智；見彼，善實！如來佛眼。一切彼，善實！無量福聚生當取當。",
  "須菩提，如來悉知、悉見，是諸眾生得如是無量福德。",
  "善現！如來以其佛智，悉已知彼；如來以其佛眼，悉已見彼。善現！如來悉已覺彼一切有情當生無量無數福聚、當攝無量無數福聚。",
  "妙生！如來悉知是人、悉見是人。彼諸菩薩當生、當攝無量福聚。",
  " jñātās te subhūte tathāgatena buddha-jñānena dṛṣṭās te subhūte tathāgatenabuddha-cakṣuṣā buddhās te subhūte tathāgatena | sarve te subhūte'prameyam asaṃkhyeyaṃ puṇyaskandhaṃ prasaviṣyanti pratigrahīṣyanti |",
  "དེ་བཞིན་གཤེགས་པས་མཁྱེན་ཏོ། རབ་འབྱོར་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་གཟིགས་ཏེ། རབ་འབྱོར་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི། བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་བསྐྱེད་ཅིང་ཡོངས་སུ་སྡུད་པར་འགྱུར་རོ། །"
 ],
 "6.10": [
  "彼何所因？不，善實！彼等菩薩摩訶薩我想轉，不眾生想、不壽想、不人想轉。",
  "何以故？是諸眾生無復我相、人相、眾生相、壽者相，",
  "何以故？善現！彼菩薩摩訶薩無我想轉、無有情想、無命者想、無士夫想、無補特伽羅想、無意生想、無摩納婆想、無作者想、無受者想轉；",
  "何以故？由彼菩薩無我想、眾生想、壽者想、更求趣想；",
  " tat kasya hetoḥ | na hi subhūte teṣāṃ bodhisattvānāṃ mahāsattvānāmātmasaṃjñā pravartate na sattvasaṃjñā na jīvasaṃjñā na pudgalasaṃjñāpravartate |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི། བདག་ཏུ་འདུ་ཤེས་འཇུག་པར་མི་འགྱུར་ཞིང༌། སེམས་ཅན་དུ་འདུ་ཤེས་པ་མ་ཡིན། སྲོག་ཏུ་འདུ་ཤེས་པ་མ་ཡིན། གང་ཟག་ཏུ་འདུ་ཤེས་འཇུག་པར་མི་འགྱུར་བའི་ཕྱིར་རོ། །"
 ],
 "6.11": [
  "不亦彼等，善實！菩薩摩訶薩，法想轉，無法想轉；不亦彼等，想、無想轉不。",
  "無法相，亦無非法相。",
  "善現！彼菩薩摩訶薩無法想轉、無非法想轉、無想轉亦無非想轉。",
  "彼諸菩薩非法想、非非法想、非想非無想。",
  " nāpi teṣāṃ subhūte bodhisattvānāṃ mahāsattvānāṃ dharmasaṃjñāpravartate | evaṃ nādharmasaṃjñā | nāpi teṣāṃ subhūte saṃjñā nāsaṃjñāpravartate |",
  "རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་ཆོས་སུ་འདུ་ཤེས་པ་དང༌། ཆོས་མེད་པར་ཡང་འདུ་ཤེས་མི་འཇུག་སྟེ། དེ་དག་ནི་འདུ་ཤེས་མེད་པར་ཡང་འདུ་ཤེས་འཇུག་པར་མི་འགྱུར་རོ། །"
 ],
 "6.12": [
  "彼何所因？若，善實！彼等菩薩摩訶薩法想轉，彼如是，彼等我取有，眾生取、壽取、人取有。",
  "何以故？是諸眾生若心取相，則為著我、人、眾生、壽者。若取法相，即著我、人、眾生、壽者；",
  "所以者何？善現！若菩薩摩訶薩有法想轉，彼即應有我執、有情執、命者執、補特伽羅等執；དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི། ཆོས་སུ་འདུ་ཤེས་འཇུག་ན་ཡང་དེ་ཉིད་དེ་དག་གིས་བདག་ཏུ་འཛིན་པར་འགྱུར་ཞིང༌། སེམས་ཅན་དུ་འཛིན་པ་དང༌། སྲོག་ཏུ་འཛིན་པ་དང༌། གང་ཟག་ཏུ་འཛིན་པར་འགྱུར་བའི་ཕྱིར་རོ། །【注】",
  " tatkasya hetoḥ | sacet subhūte teṣāṃ bodhisattvānāṃ mahāsattvānāṃdharmasaṃjñā pravarteta sa eva teṣām ātmagrāho bhavet sattvagrāhojīvagrāhaḥ pudgalagrāho bhavet |"
 ],
 "6.13": [
  "若無法想轉，彼如是，彼等我取有，眾生取、壽取、人取有。",
  "若有非法想，彼亦有我執、有情執、壽者執、更求趣執。",
  " saced adharmasaṃjñā pravarteta sa eva teṣām ātmagrāho bhavetsattvagrāho jīvagrāhaḥ pudgalagrāha iti |",
  "གལ་ཏེ་ཆོས་བདག་མེད་པར་འདུ་ཤེས་འཇུག་ན་ཡང་དེ་ཉིད་དེ་དག་གིས་བདག་ཏུ་འཛིན་པར་འགྱུར་ཞིང༌།སེམས་ཅན་དུ་འཛིན་པ་དང༌། སྲོག་ཏུ་འཛིན་པ་དང༌། གང་ཟག་ཏུ་འཛིན་པར་འགྱུར་བའི་ཕྱིར་རོ། །"
 ],
 "6.14": [
  "彼何所因？不，復次時，善實！菩薩摩訶薩法取應，不非法取應。",
  "是故，不應取法、不應取非法！",
  "何以故？善現！不應取法、不應取非法！",
  "妙生！是故，菩薩不應取法、不應取非法！",
  " tatkasya hetoḥ | na khalu punaḥ subhūte bodhisattvena mahāsattvenadharma udgrahītavyo nādharmaḥ |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱང་ལོག་པར་བཟུང་བར་མི་བྱ་སྟེ། ཆོས་མ་ཡིན་པ་ཡང་མི་བཟུང་བའི་ཕྱིར་རོ། །"
 ],
 "6.15": [
  "彼故，此義意，如來說，筏喻法本，解法如是捨應，何況非法。",
  "以是義故，如來常說，汝等比丘知我說法如筏喻者。法尚應捨，何況非法！",
  "是故，如來密意而說筏喻法門。諸有智者，法尚應斷，何況非法！",
  "以是義故，如來密意宣說筏喻法門。諸有智者，法尚應捨，何況非法！",
  " tasmād iyaṃ tathāgatena saṃdhāya vāg bhāṣitā | kolopamaṃdharma-paryāyam ājānadbhir dharmā eva prahātavyāḥ prāg evādharmāiti ||6||",
  "དེ་བས་ན་དེ་ལས་དགོངས་ཏེ་དེ་བཞིན་གཤེགས་བས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟིངས་ལྟ་བུར་ཤེས་པ་རྣམས་ཀྱིས་ཆོས་རྣམས་ཀྱང་སྤང་བར་བྱ་ན། ཆོས་མ་ཡིན་པ་རྣམས་ལྟ་ཅི་སྨོས་ཞེས་གསུངས་སོ། །"
 ],
 "7.1": [
  "復次，世尊，命者善實邊如是言：",
  "（缺譯）",
  "佛復告具壽善現言：",
  "（缺譯）",
  " punar aparaṃ bhagavān āyuṣmantaṃ subhūtim etad avocat |",
  "གཞན་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །"
 ],
 "7.2": [
  "彼何意念？善實！有如來、應、正遍知，無上正遍知證覺？有復法如來說？",
  "須菩提，於意云何，如來得阿耨多羅三藐三菩提耶，如來有所說法耶？",
  "善現，於汝意云何，頗有少法，如來、應、正等覺證得阿耨多羅三藐三菩提耶，頗有少法，如來、應、正等覺是所說耶？",
  "妙生，於汝意云何，如來於無上菩提有所證不，復有少法是所說不？",
  " tat kiṃ manyase subhūte asti sa kaścid dharmo yas tathāgatena anuttarāsamyaksaṃbodhir ity abhisaṃbuddhaḥ kaścid vā dharmas tathāgatenadeśitaḥ |",
  "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པའི་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ། དེ་བཞིན་གཤེགས་པས་ཆོས་དེ་གང་ཡང་བསྟན་སྙམ་མམ།"
 ],
 "7.3": [
  "善實言：‘如我，世尊！世尊說義解我，無有一法若如來無上正遍知證覺；無有一法若如來說。’",
  "須菩提言：如我解佛所說義，無有定法名阿耨多羅三藐三菩提，亦無有定法如來可說。",
  "善現答言：世尊，如我解佛所說義者，無有少法，如來、應、正等覺證得阿耨多羅三藐三菩提，亦無有少法，是如來應正等覺所說。",
  "妙生言：如我解佛所說義，如來於無上菩提實無所證，亦無所說。",
  " evam ukta āyuṣmān subhūtir bhagavantam etad avocat | yathā ahaṃbhagavan bhagavato bhāṣitasya artham ājānāmi nāsti sa kaścid dharmo yastathāgatena anuttarā samyaksaṃbodhir ity abhisaṃbuddhaḥ nāsti dharmoyas tathāgatena deśitaḥ |",
  "དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང༌། བཅོམ་ལྡན་འདས་ལ་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་བ་ལྟར་ན། དེ་བཞིན་གཤེགས་པས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་ལགས་སོ། ། དེ་བཞིན་གཤེགས་པས་བསྟན་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་ལགས་སོ། །"
 ],
 "7.4": [
  "彼何所因？若彼，如來法說，不可取，彼不可說，不彼法，非不法。",
  "何以故？如來所說法皆不可取、不可說，非法、非非法。",
  "何以故？世尊，如來、應、正等覺所證、所說、所思惟法，皆不可取、不可宣說，非法、非非法。",
  "何以故？佛所說法不可取、不可說，彼非法、非非法。",
  " tat kasya hetoḥ | yo 'sau tathāgatena dharmo 'bhisaṃbuddho deśito vāagrāhyaḥ so 'nabhilapyaḥ | na sa dharmo nādharmaḥ |",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་ཆོས་དེ་གང་ཡང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའམ།བསྟན་པ་དེ་ནི་གཟུང་དུ་མ་མཆིས། བརྗོད་དུ་མ་མཆིས་ཏེ། དེ་ནི་ཆོས་ཀྱང་མ་ལགས། ཆོས་མ་མཆིས་པ་ཡང་མ་ལགས་པའི་སླད་དུའོ། །"
 ],
 "7.5": [
  "彼何因？無為法顯明聖人。",
  "所以者何？一切賢聖皆以無為法而有差別。",
  "何以故？以諸賢聖補特伽羅皆是無為之所顯故。",
  "何以故？以諸聖者皆是無為所顯現故。",
  "tatkasya hetoḥ |asaṃskṛta-prabhāvitā hy āryapudgalāḥ ||7||",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། འཕགས་པའི་གང་ཟག་རྣམས་ནི་འདུས་མ་བྱས་ཀྱིས་རབ་ཏུ་ཕྱི་བའི་སླད་དུའོ། །"
 ],
 "8.1": [
  "世尊言：‘彼何意念？善實！若有善家子，若善家女，若此三千大千世界七寶滿作已，如來等，應等，正遍知等施與。彼何意念？善實！雖然，彼善家子，若善家女，若彼緣，多福聚生？",
  "須菩提，於意云何，若人滿三千大千世界七寶以用布施 ，是人所得福德寧為多不？",
  "佛告善現：於汝意云何，若善男子或善女人，以此三千大千世界盛滿七寶，持用布施，是善男子或善女人，由此因緣所生福聚寧為多不？",
  "妙生，於汝意云何，若善男子善女人，以滿三千大千世界七寶持用布施，得福多不？",
  " bhagavān āha | tat kiṃ manyase subhūte yaḥ kaścit kulaputro vā kuladuhitāvemaṃ trisāhasramahāsāhasraṃ lokadhātuṃ sapta-ratnaparipūrṇaṃ kṛtvātathāgatebhyo 'rhadbhyaḥ samyaksaṃbuddhebhyo dānaṃ dadyāt api nu sakulaputro vā kuladuhitā vā tato nidānaṃ bahutaraṃ puṇya-skandhaṃprasunuyāt |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའ ི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ་སྦྱིན་པ་བྱིན་ན། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་གཞི་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་དུ་བསྐྱེད་སྙམ་མམ།"
 ],
 "8.2": [
  "善實言：‘多，世尊！多，善逝！彼善家子，若善家女，若彼緣，多福聚生！’",
  "須菩提言：甚多，世尊！",
  "善現答言：甚多，世尊！甚多，善逝！是善男子或善女人，由此因緣所生福聚其量甚多！",
  "妙生言：甚多，世尊！",
  " subhūtir āha | bahu bhagavan bahu sugata sa kulaputro vā kuladuhitā vātato nidānaṃ puṇya-skandhaṃ prasunuyāt |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ལགས་སོ། ། བདེ་བར་གཤེགས་པ་མང་ལགས་སོ། ། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་གཞི་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་དུ་བསྐྱེད་དོ། །"
 ],
 "8.3": [
  "彼何所因？若彼，世尊！福聚如來說，非聚彼。世尊！如來說福聚、福聚者。",
  "何以故？是福德即非福德性，是故如來說福德多。",
  "何以故？世尊！福德聚福德聚者，如來說為非福德聚，是故如來說名福德聚福德聚。",
  "何以故？此福聚者則非是聚，是故如來說為福聚福聚。",
  " tat kasya hetoḥ | yo 'sau bhagavan puṇya-skandhas tathāgatena bhāṣito'skandhaḥ sa tathāgatena bhāṣitaḥ | tasmāt tathāgato bhāṣatepuṇya-skandhaḥ puṇya-skandha iti |",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཉིད་ཕུང་པོ་མ་མཆིས་པའི་སླད་དུ་སྟེ། དེ་བས་ན་དེ་བཞིན་གཤེགས་པས་བསོད་ནམས་ཀྱི་ཕུང་པོ་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཞེས་གསུངས་སོ། །"
 ],
 "8.4": [
  "世尊言：若復，善實！善家子，若善家女，若此三千大千世界七寶滿作已，如來等、應等、正遍知等施與。",
  "（缺譯）",
  "佛復告善現言：善現，若善男子或善女人以此三千大千世界盛滿七寶持用布施；",
  "妙生，若有善男子善女人以滿三千大千世界七寶持用布施；",
  " bhagavān āha | yaś ca khalu punaḥ subhūte kulaputro vā kuladuhitā vemaṃtrisāhasramahāsāhasraṃ lokadhātuṃ sapta-ratna-paripūrṇaṃ kṛtvātathāgatebhyo 'rhadbhyaḥ samyaksaṃbuddhebhyo dānaṃ dadyāt |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའ ི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ་སྦྱིན་པ་བྱིན་པ་བས།"
 ],
 "8.5": [
  "若此法本，乃至四句等偈，受已，為他等分別廣說，此，彼緣，多過福聚生，無量、不可數。",
  "若復有人，於此經中受持乃至四句偈等，為他人說，其福勝彼。",
  "若善男子或善女人，於此法門乃至四句伽陀，受持、讀誦、究竟通利，及廣為他宣說開示、如理作意，由是因緣所生福聚甚多於前，無量無數。 ",
  "若復有人，能於此經乃至一四句頌，若自受持、為他演說，以是因緣所生福聚極多於彼無量無數。",
  " yaśceto dharm-aparyāyād antaśaś catuṣpādikām api gāthām udgṛhyaparebhyo vistareṇa deśayet saṃprakāśayed ayam eva tato nidānaṃbahutaraṃ puṇya-skandhaṃ prasunuyād aprameyam asaṃkhyeyam |",
  "གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་བཟུང་ནས་གཞན་དག་ལ་འཆད་ཅིང་ཡང་དག་པར་རབ་ཏུ་སྟེན་ན། གཞི་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་དོ། །"
 ],
 "8.6": [
  "彼何所因？此出，善實！如來、應、正遍知，無上正遍知；此生佛、世尊。",
  "何以故？須菩提，一切諸佛，及諸佛阿耨多羅三藐三菩提法，皆從此經出。",
  "何以故？一切如來、應、正等覺阿耨多羅三藐三菩提皆從此經出，諸佛世尊皆從此經生。",
  "何以故？妙生，由諸如來無上等覺從此經出，諸佛世尊從此經生。",
  " tat kasya hetoḥ | ato nirjātā hi subhūte tathāgatānām arhatāṃsamyaksaṃbuddhānām anuttarā samyaksaṃbodhir | ato nirjātāś ca buddhābhagavantaḥ |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་འདི་ལས་བྱུང་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་འདི་ལས་སྐྱེས་པའི་ཕྱིར་རོ། །"
 ],
 "8.7": [
  "彼何所因？佛法、佛法者，善實！非佛法，如是彼；彼故說名佛法者。",
  "須菩提，所謂佛法者，即非佛法！",
  "所以者何？善現，諸佛法諸佛法者，如來說為非諸佛法，是故如來說名諸佛法諸佛法。",
  "是故，妙生，佛法者，如來說非佛法，是名佛法。",
  " tat kasya hetoḥ | buddhadharmā buddhadharmā iti subhūte'buddhadharmāś caiva te tathāgatena bhāṣitāḥ | tenocyante buddhadharmāiti ||8||",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བ་ནི། སངས་རྒྱས་ཀྱི་ཆོས་དེ་དག་མེད་པར་དེ་བཞིན་གཤེགས་པའི་གསུངས་པའི་ཕྱིར་ཏེ། དེས་ན་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱའོ། །"
 ],
 "9.1": [
  "世尊言：彼何意念？善實！雖然，流入如是念：『我流入果得到。』？",
  "須菩提，於意云何，須陀洹能作是念『我得須陀洹果』不？",
  "佛告善現：於汝意云何，諸預流者頗作是念『我能證得預流果』不？",
  "妙生，於汝意云何，諸預流者頗作是念『我得預流果』不？",
  " tat kiṃ manyase subhūte api nu srotāpannasyaivaṃ bhavati mayāsrotāpatti-phalaṃ prāptam iti |",
  "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། རྒྱུན་དུ་ཞུགས་པ་འདི་སྙམ་དུ་བདག་གིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་སེམས་སྙམ་མམ།"
 ],
 "9.2": [
  "善實言：「不如此，世尊！彼何所因？不彼，世尊！一入，彼故說名流入。不色入，不聲、不香、不味、不觸、不法入，彼故說名流入者。",
  "須菩提言：不也，世尊！何以故？須陀洹，名為入流，而無所入；不入色、聲、香、味、觸、法，是名須陀洹。",
  "善現答言：不也，世尊！諸預流者不作是念『我能證得預流之果』！何以故？世尊，諸預流者無少所預，故名預流；不預色、聲、香、味、觸、法，故名預流。",
  "妙生言：不爾，世尊！何以故？諸預流者無法可預，故名預流；不預色、聲、香、味、觸、法，故名預流。",
  " subhūtir āha | no hīdaṃ bhagavan | na srotāpannasyaivaṃ bhavati mayāsrotāpatti-phalaṃ prāptam iti | tat kasya hetoḥ | na hi sa bhagavan kaṃciddharmam āpannaḥ | tenocyate srotāpanna iti | na rūpam āpanno na śabdānna gandhān na rasān na spraṣṭavyān dharmān āpannaḥ | tenocyatesrotāpanna iti |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། ། དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་ཅི་ལའང་ཞུགས་པ་མ་མཆིས་པའི་སླད་དུ་སྟེ། དེས་ན་རྒྱུན་དུ་ཞུགས་པ་ཞེས་བགྱིའོ། ། གཟུགས་ལའང་མ་ཞུགས། སྒྲ་ལ་ཡང་མ་ལགས། དྲི་ལ་ཡང་མ་ལགས། རོ་ལ་ཡང་མ་ལགས། རེག་བྱ་ལ་ཡང་མ་ལགས། ཆོས་རྣམས་ལ་ཡང་མ་ཞུགས་ཏེ། དེས་ན་རྒྱུན་དུ་ཞུགས་པ་ཞེས་བགྱིའོ། །"
 ],
 "9.3": [
  "彼若，世尊！流入如是念：『我流入果得到。』彼如是，彼所我取有，眾生取、壽取、人取有。",
  "（缺譯）",
  "世尊，若預流者作如是念『我能證得預流之果』，即為執我、有情、命者、士夫、補特伽羅等。",
  "世尊，若預流者作是念『我得預流果』者，則有我執、有情、壽者、更求趣執。 ",
  " saced bhagavan srotāpannasyaivaṃ bhaven mayā srotāpatti-phalaṃprāptam iti sa eva tasya ātmagrāho bhavet sattvagrāho jīvagrāhaḥpudgalagrāho bhaved iti |",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་གལ་ཏེ་རྒྱུན་དུ་ཞུགས་པ་འདི་སྙམ་དུ་བདག་གིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་སེམས་པར་གྱུར་ན། དེ་ཉིད་དེའི་བདག་ཏུ་འཛིན་པར་འགྱུར་ལགས་སོ། ། སེམས་ཅན་དུ་འཛིན་པ་དང༌། སྲོག་ཏུ་འཛིན་པ་དང༌། གང་ཟག་ཏུ་འཛིན་པར་འགྱུར་ལགས་སོ། །"
 ],
 "9.4": [
  "世尊言：彼何意念？善實！雖然，一來如是念：『我一來果得到』？",
  "須菩提，於意云何，斯陀含能作是念『我得斯陀含果』不？",
  "佛告善現：於汝意云何，諸一來者頗作是念『我能證得一來果』不？",
  "妙生，於汝意云何，諸一來者頗作是念『我得一來果』不？ ",
  " bhagavān āha | tatkiṃ manyase subhūte api nu sakṛdāgāmina evaṃ bhavatimayā sakṛdāgāmiphalaṃ prāptam iti |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། ལན་ཅིག་ཕྱིར་འོང་བ་འདི་སྙམ་དུ་བདག་གིས་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་སེམས་སྙམ་མམ།"
 ],
 "9.5": [
  "善實言：「不如此，世尊！彼何所因？不一來如是念：『我一來果得到。』彼何所因？彼有法若不入一來，彼故說名一來者。",
  "須菩提言：「不也，世尊！何以故？斯陀含，名一往來，而實無往來，是名斯陀含。」",
  "善現答言：「不也，世尊！諸一來者不作是念『我能證得一來之果』！何以故？世尊！以無少法證一來性，故名一來。」",
  "妙生言：「不爾，世尊！何以故？由彼無有少法證一來性，故名一來。」",
  " subhūtirāha | no hīdaṃ bhagavan na sakṛdāgāmina evaṃ bhavati mayāsakṛdāgāmiphalaṃ prāptam iti | tatkasya hetoḥ | na hi sa kaścid dharmo yaḥsakṛdāgāmitvam āpannaḥ | tenocyate sakṛdāgāmīti |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་ལན་ཅིག་ཕྱིར་འོང་བ་ཉིད་དུ་ཞུགས་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་པའི་སླད་དུ་སྟེ། དེས་ན་ལན་ཅིག་ཕྱིར་འོང་བ་ཞེས་བགྱིའོ། ། བཅོམ་ལྡན་འདས་གལ་ཏེ་ལན་ཅིག་ཕྱིར་འོང་བ་འདི་སྙམ་དུ་བདག་གིས་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་སེམས་པར་གྱུར་ན། དེ་ཉིད་དེའི་བདག་ཏུ་འཛིན་པར་འགྱུར་ལགས་སོ། ། སེམས་ཅན་དུ་འཛིན་པ་དང༌། སྲོག་ཏུ་འཛིན་པ་དང༌། གང་ཟག་ཏུ་འཛིན་པར་འགྱུར་ལགས་སོ། །"
 ],
 "9.6": [
  "世尊言：「彼何意念？善實！雖然，不來如是念：『我不來果得到。』？",
  "「須菩提，於意云何，阿那含能作是念『我得阿那含果』不？」",
  "佛告善現：「於汝意云何，諸不還者頗作是念『我能證得不還果』不？」",
  "「妙生，於汝意云何，諸不還者頗作是念『我得不還果』不？」",
  " bhagavān āha | tat kiṃ manyase subhūte api nv anāgāmina evaṃ bhavatimayā anāgāmiphalaṃ prāptam iti |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། ཕྱིར་མི་འོང་བ་འདི་སྙམ་དུ་བདག་གིས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་སེམས་སྙམ་མམ།"
 ],
 "9.7": [
  "善實言：「不如此，世尊！彼何所因？不彼有法若不來入，彼故說名不來者。」",
  "須菩提言：「不也，世尊！何以故？阿那含，名為不來，而實無來，是故名阿那含。」",
  "善現答言：「不也，世尊！諸不還者不作是念『我能證得不還之果』！何以故？世尊！以無少法證不還性，故名不還。」",
  "妙生言：「不爾，世尊！何以故？由彼無有少法證不還性，故名不還。」",
  " subhūtir āha | no hīdaṃ bhagavan na anāgāmina evaṃ bhavati mayāanāgāmi-phalaṃ prāptamiti | tatkasya hetoḥ | na hi sa bhagavan kaściddharmo yo 'nāgāmitvam āpannaḥ | tenocyate 'nāgāmīti |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། ། དེ་ཅིའི་སླད་དུ་ཞེ་ན། གང་ཕྱིར་མི་འོང་བ་ཉིད་དུ་ཞུགས་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་པའི་སླད་དུ་སྟེ། དེའི་ཕྱིར་ཕྱིར་མི་འོང་བ་ཞེས་བགྱིའོ། །"
 ],
 "9.8": [
  "世尊言：「彼何意念？善實！雖然，應如是念：『我應得到。』」？",
  "「須菩提，於意云何，阿羅漢能作是念『我得阿羅漢道』不？」",
  "佛告善現：「於汝意云何，諸阿羅漢頗作是念『我能證得阿羅漢』不？」",
  "「妙生，於汝意云何，諸阿羅漢頗作是念『我得阿羅漢果』不？」",
  " bhagavān āha | tat kiṃ manyase subhūte api nvarhata evaṃ bhavati mayāarhattvaṃ prāptam iti |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། དགྲ་བཅོམ་པ་འདི་སྙམ་དུ་བདག་གིས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་བོ་སྙམ་དུ་སེམས་སྙམ་མམ།"
 ],
 "9.9": [
  "善實言：‘不如此，世尊！彼何所因？不彼，世尊！有法若應名，彼故說名應者。彼若，世尊！應如是念：『我應得到。』如是彼所我取有，眾生取、壽取、人取有。",
  "須菩提言：「不也，世尊！何以故？實無有法名阿羅漢！世尊，若阿羅漢作是念『我得阿羅漢道』，即為著我、人、眾生、壽者。",
  "善現答言：「不也，世尊！諸阿羅漢不作是念『我能證得阿羅漢性』。何以故？世尊，以無少法名阿羅漢，由是因緣名阿羅漢。世尊，若阿羅漢作如是念『我能證得阿羅漢性』，即為執我、有情、命者、士夫、補特伽羅等。",
  "妙生言：「不爾，世尊！由彼無有少法名阿羅漢。世尊，若阿羅漢作是念『我得阿羅漢果』者，則有我執、有情、壽者、更求趣執。",
  " subhūtir āha | no hīdaṃ bhagavan na arhata evaṃ bhavati mayā arhattvaṃprāptam iti | tatkasya hetoḥ | na hi sa bhagavan kaścid dharmo yo 'rhannāma | tenocyate 'rhann iti | saced bhagavann arhata evaṃ bhaven mayāarhattvaṃ prāptam iti sa eva tasya ātmagrāho bhavet sattvagrāhojīvagrāhaḥ pudgalagrāho bhavet |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། ། དེ་ཅིའི་སླད་དུ་ཞེ་ན། གང་དག་དགྲ་བཅོམ་པ་ཞེས་བགྱི་བའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་པའི་སླད་དུའོ། ། བཅོམ་ལྡན་འདས་གལ་ཏེ་དགྲ་བཅོམ་པ་འདི་སྙམ་དུ་བདག་གིས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་པོ་སྙམ་དུ་སེམས་པར་གྱུར་ན། དེ་ཉིད་དེའི་བདག་ཏུ་འཛིན་པར་འགྱུར་ལགས་སོ། ། སེམས་ཅན་དུ་འཛིན་པ་དང༌། སྲོག་ཏུ་འཛིན་པ་དང༌། གང་ཟག་ཏུ་འཛིན་བར་འགྱུར་ལགས་སོ། །"
 ],
 "9.10": [
  "彼何所因？我是，世尊！如來、應、正遍知，無諍行最勝說，我此，世尊！應離欲。不我，世尊！如是念：『我此應者。』",
  "世尊！佛說我得無諍三昧，人中最為第一，是第一離欲阿羅漢。我不作是念：『我是離欲阿羅漢』。",
  "所以者何？世尊！如來、應、正等覺說我得無諍住，最為第一。世尊！我雖是阿羅漢永離貪欲，而我未曾作如是念：『我得阿羅漢永離貪欲』。",
  "世尊！如來說我得無諍住中最為第一。世尊！我是阿羅漢離於欲染，而實未曾作如是念：『我是阿羅漢』。",
  " tat kasya hetoḥ | aham asmi bhagavaṃs tathāgatena arhatāsamyaksaṃbuddhena araṇā-vihāriṇām agryo nirdiṣṭaḥ | aham asmibhagavann arhan vītarāgaḥ | na ca me bhagavann evaṃ bhavati arhannasmy ahaṃ vītarāga iti |",
  "བཅོམ་ལྡན་འདས་བདག་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཉོན་མོངས་པ་མེད་པར་གནས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏེ། བཅོམ་ལྡན་འདས་བདག་འདོད་ཆགས་དང་བྲལ་བ་དགྲ་བཅོམ་པ་ལགས་ཀྱང༌། བཅོམ་ལྡན་འདས་བདག་འདི་སྙམ་དུ་བདག་ནི་དགྲ་བཅོམ་པའོ་སྙམ་དུ་མི་སེམས་ལགས་སོ། །"
 ],
 "9.11": [
  "若我，世尊！如是念：『我應得到。』不我如來記說：『無諍行最勝』，善實善家子無所行，彼故說名無諍行、無諍行者。",
  "世尊，我若作是念『我得阿羅漢道』，世尊則不說『須菩提是樂阿蘭那行』者！以須菩提實無所行，而名須菩提是樂阿蘭那行！」",
  "世尊，我若作如是念『我得阿羅漢永離貪欲』者，如來不應記說我言，『善現善男子得無諍住，最為第一！』以都無所住，是故如來說名無諍住無諍住！」",
  "世尊，若作是念『我得阿羅漢』者，如來即不說我妙生『得無諍住最為第一』。以都無所住，是故說我得無諍住得無諍住！」",
  " sacen mama bhagavann evaṃ bhaven mayā arhattvaṃ prāptam iti na māṃtathāgato vyākariṣyad araṇā-vihāriṇām agryaḥ subhūtiḥ kulaputro nakvacid viharati tenocyate 'raṇā-vihāry araṇā-vihārīti ||9||",
  "བཅོམ་ལྡན་འདས་གལ་ཏེ་འདི་སྙམ་དུ་བདག་གིས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་བོ་སྙམ་དུ་སེམས་པར་གྱུར་ན། དེ་བཞིན་གཤེགས་པས་བདག་ལ་རིགས་ཀྱི་བུ་རབ་འབྱོར་ནི་ཉོན་མོངས་པ་མེད་པར་གནས་པ་རྣམས་ཀྱི་མཆོག་ཡིན་ཏེ། ཅི་ལ་ཡང་མི་གནས་པས་ན་ཉོན་མོངས་པ་མེད་པར་གནས་པ་ཞེས་ལུང་མི་སྟོན་ལགས་སོ། །"
 ],
 "10.1": [
  "世尊言：「彼何意念？善實！有一法若，如來燈作如來、應、正遍知受取？」。",
  "佛告須菩提：「於意云何，如來昔在然燈佛所，於法有所得不？」",
  "佛告善現：「於汝意云何，如來昔在然燈如來、應、正等覺所，頗於少法有所取不？」",
  "「妙生，於汝意云何，如來昔在然燈佛所，頗有少法是可取不？」",
  " bhagavān āha | tat kiṃ manyase subhūte asti sa kaścid dharmo yastathāgatena dīpaṃkarasya tathāgatasya arhataḥ samyaksaṃbuddhasyaantikād udgṛhītaḥ |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ལས་གང་བླངས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ།"
 ],
 "10.2": [
  "善實言：「不如此，世尊！無一法，若如來燈作如來、應、正遍知受取。」",
  "「世尊，如來在然燈佛所，於法實無所得。」",
  "善現答言：「不也，世尊！如來昔在然燈如來、應、正等覺所，都無少法而有所取。」",
  "妙生言：「不爾，世尊！如來於然燈佛所，實無可取。」",
  " subhūtir āha | no hīdaṃ bhagavan nāsti sa kaścid dharmo yas tathāgatenadīpaṃkarasya tathāgatasya arhataḥ samyaksaṃbuddhasya antikādudgṛhītaḥ |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། ། དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ལས་གང་བླངས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་ཡེ་མ་མཆིས་ལགས་སོ། ། "
 ],
 "10.3": [
  "世尊言：「若有，善實！菩薩摩訶薩如是語：『我國土莊嚴成就我者。』彼不如語",
  "「須菩提，於意云何，菩薩莊嚴佛土不？」",
  "佛告善現：「若有菩薩作如是言，『我當成辦佛土功德莊嚴。』如是菩薩非真實語！",
  "「妙生，若有菩薩作如是語『我當成就莊嚴國土』者，此為妄語！",
  " bhagavān āha | yaḥ kaścit subhūte bodhisattva evaṃ vaded ahaṃkṣetra-vyūhān niṣpādayiṣyāmi iti sa vitathaṃ vadet |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ་བདག་གིས་ཞིང་བཀོད་པ་རྣམས་བསྒྲུབ་པོ་ཞེས་ཟེར་ན་དེ་ནི་མི་བདེན་པར་སྨྲའོ། །"
 ],
 "10.4": [
  "彼何所因？國土莊嚴者，善實！不莊嚴彼如來說；彼故說名國土莊嚴者。",
  "不也，世尊！何以故？莊嚴佛土者，則非莊嚴，是名莊嚴。",
  "何以故？善現，佛土功德莊嚴佛土功德莊嚴者，如來說非莊嚴，是故如來說名佛土功德莊嚴佛土功德莊嚴。",
  "何以故？莊嚴佛土者，如來說非莊嚴，由此說為國土莊嚴。",
  " tatkasya hetoḥ | kṣetra-vyūhāḥ kṣetra-vyūhā iti subhūte 'vyūhās tetathāgatena bhāṣitāḥ | tenocyante kṣetra-vyūhā iti |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཞིང་བཀོད་པ་རྣམས་ཞིང་བཀོད་པ་རྣམས་ཞེས་བྱ་བ་ནི། བཀོད་པ་དེ་དག་མེད་པར་དེ་བཞིན་གཤེགས་པར་གསུངས་པའི་ཕྱིར་ཏེ། དེས་ན་ཞིང་བཀོད་པ་རྣམས་ཞེས་བྱའོ། །"
 ],
 "10.5": [
  "彼故此，善實！菩薩摩訶薩如是不住心發生應，不色住心發生應，不聲、香、味、觸、法住心發生應，無所住心發生應！",
  "是故，須菩提，諸菩薩摩訶薩應如是生清淨心，不應住色生心，不應住聲、香、味、觸、法生心，應無所住而生其心。",
  "是故，善現，菩薩如是都無所住應生其心，不住於色應生其心，不住非色應生其心，不住聲、香、味、觸、法應生其心，不住非聲、香、味、觸、法應生其心，都無所住應生其心。",
  "是故，妙生，菩薩不住於事、不住隨處、不住色、聲、香、味、觸、法應生其心；應生不住事心，應生不住隨處心，應生不住色、聲、香、味、觸、法心。",
  " tasmāt tarhi subhūte bodhisattvena mahāsattvenaivam apratiṣṭhitaṃcittam utpādayitavyaṃ yanna kvacit pratiṣṭhitaṃ cittam utpādayitavyaṃna rūpa-pratiṣṭhitaṃ cittam utpādayitavyaṃ naśabda-gandha-rasa-spraṣṭavya-dharma-pratiṣṭhitaṃ cittamutpādayitavyam |",
  "རབ་འབྱོར་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདི་ལྟར་མི་གནས་པར་སེམས་པ་བསྐྱེད་པར་བྱ་སྟེ། ཅི་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། ། གཟུགས་ལ་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། ། སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་ཆོས་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །"
 ],
 "10.6": [
  "譬如，善實！丈夫有，此如是色我身有，譬如善高山王。彼何意念？善實！雖然，彼大我身有？！",
  "「須菩提！譬如有人，身如須彌山王。於意云何，是身為大不？」",
  "佛告善現：「如有士夫，具身大身，其色自體，假使譬如妙高山王。善現！於汝意云何，彼之自體為廣大不？」",
  "「妙生！譬如有人，身如妙高山王。於意云何，是身為大不？」",
  " tad yathāpi nāma subhūte puruṣo bhaved upeta-kāyo mahā-kāyo yattasyaivaṃrūpa ātma-bhāvaḥ syāt tad yathāpi nāma sumeruḥparvata-rājaḥ tat kiṃ manyase subhūte api nu mahān sa ātmabhāvobhavet |",
  "རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་ཞིག་ལུས་འདི་ལྟ་བུར་གྱུར་ཏེ། འདི་ལྟ་སྟེ་རིའི་རྒྱལ་པོ་རི་རབ་ཙམ་དུ་གྱུར་ན། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། ལུས་དེ་ཆེ་བ་ཡིན་སྙམ་མམ།"
 ],
 "10.7": [
  "善實言：「大，世尊！大，善逝！彼我身有。彼何所因？我身、我身者，世尊！不有，彼，如來說；彼故，說名我身者。不彼，世尊！有；彼故，說名我身者。」",
  "須菩提言：「甚大，世尊！何以故？佛說非身，是名大身。」",
  "善現答言：「彼之自體廣大，世尊！廣大，善逝！ 何以故？世尊，彼之自體，如來說非彼體，故名自體；非以彼體，故名自體。 」",
  "妙生言：「甚大，世尊！何以故？彼之大身，如來說為非身，以彼非有，說名為身。」",
  " subhūtir āha | mahān sa bhagavan mahān sugata sa ātmabhāvo bhavet |tatkasya hetoḥ | ātmabhāva ātmabhāva iti bhagavann abhāvaḥ satathāgatena bhāṣitaḥ |tenocyata ātmabhāva iti | na hi bhagavan sa bhāvonābhāvaḥ | tenocyata ātmabhāva iti |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ལུས་དེ་ཆེ་བ་ལགས་སོ། ། བདེ་བར་གཤེགས་པ་ལུས་དེ་ཆེ་བ་ལགས་སོ། ། དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་དེ་དངོས་པོ་མ་མཆིས་པར་གསུངས་པའི་སླད་དུ་སྟེ།དེས་ན་ལུས་དེ་ཆེ་བ་ཞེས་བགྱིའོ། ། དེ་དངོས་པོ་མ་མཆིས་བས་དེས་ན་ལུས་ཞེས་བྱའོ། །"
 ],
 "11.1": [
  "世尊言：「彼何意念？善實！所有恒伽大河沙，彼所有，如是恒伽大河有，彼中若沙，雖然，彼多沙有？」",
  "「須菩提，如恒河中所有沙數，如是沙等恒河，於意云何，是諸恒河沙寧為多不？」 ",
  "佛告善現：「於汝意云何，乃至殑伽河中所有沙數，假使有如是沙等殑伽河，是諸殑伽河沙寧為多不？」",
  "「妙生，於汝意云何，如弶伽河中所有沙數，復有如是沙等弶伽河，此諸河沙寧為多不？」",
  " bhagavān āha | tat kiṃ manyase subhūte yāvatyo gaṅgāyāṃ mahānadyāṃvālukās tāvatya eva gaṅgā-nadyo bhaveyuḥ tāsu yā vālukā api nu tābahvyo bhaveyuḥ |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། གངྒཱའི་ཀླུང་གི་བྱེ་མ་ཇི་སྙེད་པ་གངྒཱའི་ཀླུང་ཡང་དེ་སྙེད་ཁོ་ནར་གྱུར་ལ། དེ་དག་གི་བྱེ་མ་གང་ཡིན་པ་དེ་དག་མང་བ་ཡིན་སྙམ་མམ།"
 ],
 "11.2": [
  "善實言：「彼如是所有，世尊！多，恒伽大河有，何況若彼中沙。」",
  "須菩提言：「甚多，世尊！但諸恒河尚多無數，何況其沙！」",
  "善現答言：「甚多，世尊！甚多，善逝！諸殑伽河尚多無數，何況其沙！」",
  "妙生言：「甚多，世尊！河尚無數，況復其沙！」",
  " subhūtir āha | tā eva tāvad bhagavan bahvyo gaṅgā-nadyo bhaveyuḥ prāgeva yās tāsu gaṅgā-nadīṣu vālukāḥ |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གངྒཱའི་ཀླུང་དེ་དག་ཉིད་ཀྱང་མང་ལགས་ན། དེ་དག་གི་བྱེ་མ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།"
 ],
 "11.3": [
  "世尊言：「欲我汝，善實！知我汝。所有彼中恒伽大河中沙有，彼所有世界有，如是婦女，若丈夫，若七寶滿作已，如來等、應等、正遍知等施與。彼何意念？善實！雖然，彼婦女，若丈夫，若彼緣，多福聚生？」",
  "「須菩提，我今實言告汝，若有善男子善女人，以七寶滿爾所恒河沙數三千大千世界，以用布施，得福多不？」",
  "佛言：「善現，吾今告汝、開覺於汝，假使若善男子或善女人，以妙七寶盛滿爾所殑伽河沙等世界，奉施如來、應、正等覺。善現，於汝意云何，是善男子或善女人，由此因緣所生福聚寧為多不？」",
  "「妙生，我今實言告汝，若復有人以寶滿此河沙數量世界，奉施如來，得福多不？」",
  " bhagavān āha | ārocayāmi te subhūte prativedayāmi yāvatyas tāsugaṅgā-nadīṣu vālukā bhaveyus tāvato lokadhātūn kaścid eva strī vā puruṣovā sapta-ratna-paripūrṇaṃ kṛtvā tathāgatebhyo 'rhadbhyaḥsamyaksaṃbuddhebhyo dānaṃ dadyāt tatkiṃ manyase subhūte api nu sāstrī vā puruṣo vā tato nidānaṃ bahu puṇya-skandhaṃ prasunuyāt |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཁྱོད་མོས་པར་བྱའོ། ། ཁྱོད་ཀྱི་ཁོང་དུ་ཆུད་བར་བྱའོ། །གངྒཱའི་ཀླུང་དེ་དག་གི་བྱ་མ་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ན་སྐྱེས་པའམ། བུད་མེད་ལ་ལ་ཞིག་གིས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་སྦྱིན་པ་བྱིན་ན། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། སྐྱེས་པའམ་བུད་མེད་དེ་གཞི་དེ་ལས་བསོད་ནམས་མང་དུ་བསྐྱེད་སྙམ་མམ།"
 ],
 "11.4": [
  "善實言：「多，世尊！多，善逝！彼婦女，若丈夫，若彼緣，多福聚生，無量、不可數。」",
  "須菩提言：「甚多，世尊！」",
  "善現答言：「甚多，世尊！甚多，善逝！是善男子或善女人，由此因緣所生福聚其量甚多！」",
  "妙生言：「甚多，世尊！」",
  " subhūtir āha | bahu bhagavan bahu sugata strī vā puruṣo vā tato nidānaṃpuṇya-skandhaṃ prasunuyād aprameyam asaṃkhyeyam |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ལགས་སོ། ། བདེ་བར་གཤེགས་པ་མང་ལགས་སོ། །སྐྱེས་པའམ་བུད་མེད་དེ་གཞི་དེ་ལས་བསོད་ནམས་མང་དུ་བསྐྱེད་པ་ལགས་སོ། །"
 ],
 "11.5": [
  "世尊言：「若復時，善實！善家子，若善家女，若彼所有世界七寶滿作已，如來等、應等、正遍知等施與。若此法本乃至四句等偈，受已，為他等分別廣說，此如是，彼緣，多過福聚生，無量、不可數！",
  "佛告須菩提∶「若善男子善女人，於此經中乃至受持四句偈等，為他人說，而此福德勝前福德。",
  "佛復告善現：「若以七寶盛滿爾所沙等世界，奉施如來、應、正等覺；若善男子或善女人，於此法門乃至四句伽他，受持、讀誦、究竟通利，及廣為他宣說開示、如理作意。由此因緣所生福聚，甚多於前無量無數。",
  "「妙生，若復有人，於此經中受持一頌，并為他說，而此福聚勝前福聚無量無邊。",
  " bhagavān āha |yaś ca khalu punaḥ subhūte strī vā puruṣo vā tāvatoloka-dhātūn sapta-ratna-paripūrṇaṃ kṛtvā tathāgatebhyo 'rhadbhyaḥsamyaksaṃbuddhebhyo dānaṃ dadyāt yaś ca kulaputro vā kuladuhitāveto dharm-aparyāyād antaśaś catuṣpādikām api gāthām udgṛhyaparebhyo deśayet saṃprakāśayed ayam eva tato nidānaṃ bahutaraṃpuṇya-skandhaṃ prasunuyād aprameyam asaṃkhyeyam ||11||",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གང་གིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་སྙེད་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་སྦྱིན་པ་བྱིན་པ་བས། གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་བཟུང་ནས། གཞན་དག་ལ་ཡང་དག་པར་རབ་ཏུ་བཤད་དེ་ཡང་དག་པར་རབ་ཏུ་བསྟན་ན། དེ་ཉིད་གཞི་དེ་ལས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་དོ། །"
 ],
 "12.1": [
  "雖然復次時，善實！此中地分，此法本乃至四句等偈，為他等說，若分別，若廣說，若彼地分支帝有天、人、阿脩羅世。",
  "復次，須菩提，隨說是經乃至四句偈等，當知此處，一切世間天、人、阿修羅皆應供養，如佛塔廟。",
  "復次，善現，若地方所，於此法門乃至為他宣說開示四句伽他，此地方所，尚為世間諸天、及人、阿素洛等之所供養，如佛靈廟。",
  "妙生！若國土中，有此法門，為他解說，乃至四句伽他，當知此地，即是制底，一切天、人、阿蘇羅等皆應右繞而為敬禮。",
  "api tu khalu punaḥ subhūte yasmin pṛthivī-pradeśa ito dharma-paryāyādantaśaś catuṣpādikām api gāthām udgṛhya bhāṣyeta vā saṃprakāśyeta vāsa pṛthivī-pradeśaś caitya-bhūto bhavet sadeva mānuṣa-asurasya lokasya",
  "ཡང་རབ་འབྱོར་ས་ཕྱོགས་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་འདོན་ཏམ་སྟོན་པའི་ས་ཕྱོགས་དེ་ནི་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་བའི་འཇིག་རྟེན་གྱི་མཆོད་རྟེན་དུ་གྱུར་པ་ཡིན་ན།"
 ],
 "12.2": [
  "何復言，善實！若此法本，持當、讀當、誦當，他等及分別廣說當。",
  "何況有人，盡能受持、讀誦！",
  "何況有能於此法門，具足究竟書寫、受持、讀誦、究竟通利，及廣為他宣說開示，如理作意！",
  "何況盡能受持、讀誦！",
  " kaḥ punar vādo ya imaṃ dharmaparyāyaṃ sakala-samāptaṃdhārayiṣyanti vācayiṣyanti paryavāpsyanti parebhyaś ca vistareṇasaṃprakāśayiṣyanti |",
  " སུ་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལེན་པ་དང༌། འབྲི་བ་དང༌། འཛིན་པ་དང་། འཆང་བ་དང༌། ཀློག་པ་དང༌།ཀུན་ཆུབ་པར་བྱེད་པ་དང༌། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་བ །"
 ],
 "12.3": [
  "最勝彼希有具足當有。此中，善實！地分教師遊行，別異尊重處相似，共梵行。」",
  "須菩提！當知是人成就最上第一希有之法！若是經典所在之處，則為有佛，若尊重弟子。」",
  "如是有情成就最勝希有功德！此地方所大師所住，或隨一一尊重處所若諸有智、同梵行者。」",
  "當知是人，則為最上第一希有！又此方所即為有佛，及尊重弟子。」",
  " parameṇa te subhūte āścaryeṇa samanvāgatā bhaviṣyanti | tasmiṃś casubhūte pṛthivī-pradeśe śāstā viharaty anyatara-anyataro vāvijñaguru-sthānīyaḥ ||12||",
  " དེ་ངོ་མཚར་རབ་དང་ལྡན་པར་གྱུར་པ་ལྟ་ཅི་སྨོས།ས་ཕྱོགས་དེ་ན་སྟོན་པའམ། བླ་མ་ལྟ་བུ་གང་ཡང་རུང་བར་གནས་སོ། །"
 ],
 "13.1": [
  "如是語已。命者善實，世尊邊如是言：「何名此，世尊！法本？云何及如此持我？」",
  "爾時，須菩提白佛言：「世尊，當何名此經，我等云何奉持？」",
  "說是語已，具壽善現復白佛言：「世尊，當何名此法門，我當云何奉持？」",
  "（缺譯）",
  " evam ukta āyuṣmān subhūtir bhagavantam etad avocat | ko nāma ayaṃbhagavan dharmaparyāyaḥ kathaṃ cainaṃ dhārayāmi |",
  "དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང༌། བཅོམ་ལྡན་འདས་ལ་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས། འདི་ཇི་ལྟར་བཟུང་བར་བགྱི།"
 ],
 "13.2": [
  "如是語已。世尊，命者善實邊如是言：「‘智慧彼岸到’名此，善實！法本，如是此持。彼何所因？若如是，善實！智慧彼岸到；如來說，彼如是非彼岸到；彼故，說名智慧彼岸到者",
  "佛告須菩提：「是經名為『金剛般若波羅』。以是名字，汝當奉持。所以者何？須菩提，佛說般若波羅蜜，則非般若波羅蜜。」",
  "作是語已，佛告善現言：「具壽，今此法門名為『能斷金剛般若波羅蜜多』。如是名字，汝當奉持。何以故？善現，如是般若波羅蜜多，如來說為非般若波羅蜜多，是故如來說名般若波羅蜜多。」",
  "（缺譯） ",
  " evam ukte bhagavān āyuṣmantaṃ subhūtim etad avocat | prajñāpāramitānāma ayaṃ subhūte dharmaparyāyaḥ | evaṃ cainaṃ dhāraya | tatkasyahetoḥ | yaiva subhūte prajñāpāramitā tathāgatena bhāṣitāsaiva-a-pāramitā tathāgatena bhāṣitā | tenocyate prajñāpāramiteti |",
  "དེ་སྐད་ཅེས་གསོལ་པ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། ། རབ་འབྱོར་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ་འདི་དེ་ལྟར་བཟུངས་ཤིག ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་གསུངས་པ་དེ་ཉིད་ཕ་རོལ་ཏུ་ཕྱིན་པ་མེད་པའི་ཕྱིར་ཏེ། དེས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ། །"
 ],
 "13.3": [
  "彼何意念？善實！雖然，有法若如來說？",
  "「須菩提，於意云何，如來有所說法不？」",
  "佛告善現：「於汝意云何，頗有少法如來可說不？」",
  "「妙生，於汝意云何，頗有少法是如來所說不？」",
  " tatkiṃ manyase subhūte api nvasti sa kaścid dharmo yastathāgatenabhāṣitaḥ|",
  " རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ།"
 ],
 "13.4": [
  "善實言：「不如此，世尊！不有，世尊！法，若如來說。」",
  "須菩提白佛言：「世尊！如來無所說。」",
  "善現答言：「不也，世尊！無有少法如來可說。」",
  "妙生言：「不爾，世尊！無有少法是如來所說。」",
  " subhūtir āha | no hīdaṃ bhagavan nāsti sa kaścid dharmo yas tathāgatenabhāṣitaḥ |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་གང་གསུངས་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་ལགས་སོ། །"
 ],
 "13.5": [
  "世尊言：「所有，善實！三千大千世界地塵有多有？」",
  "「須菩提，於意云何，三千大千世界所有微塵，是為多不？」",
  "佛告善現：「乃至三千大千世界大地微塵，寧為多不？」",
  "「妙生，三千大千世界所有地塵，是為多不？」",
  " bhagavān āha | tatkiṃ manyase subhūte yāvat trisāhasramahāsāhasrelokadhātau pṛthivīrajaḥ kaccit tad bahu bhavet |",
  " བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའ ི་འཇིག་རྟེན་གྱི་ཁམས་ན་སའི་རྡུལ་ཇི་སྙེད་ཡོད་པ་དེ་མང་བ་ཡིན་སྙམ་མམ།"
 ],
 "13.6": [
  "善實言：「多，世尊！多，善逝！彼地塵。」",
  "須菩提言：「甚多，世尊！」",
  "善現答言：「此地微塵甚多，世尊，甚多，善逝！」",
  "妙生言：「甚多，世尊！」",
  " subhūtir āha | bahu bhagavan bahu sugata pṛthivīrajo bhavet |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་སའི་རྡུལ་དེ་མང་ལགས་སོ། ། བདེ་བར་གཤེགས་པ་མང་ལགས་སོ། །"
 ],
 "13.7": [
  "彼何所因？若彼，世尊！地塵如來說；非塵彼如來說；彼故，說名地塵者。若彼世界如來說；非界如來說；彼故說名世界者。",
  "「須菩提，諸微塵如來說非微塵，是名微塵；如來說世界非世界，是名世界。」",
  "佛言：「善現，大地微塵如來說非微塵，是故如來說名大地微塵；諸世界如來說非世界，是故如來說名世界。」",
  "「何以故？諸地塵佛說非塵，故名地塵；此諸世界佛說非界，故名世界。」",
  " tatkasya hetoḥ | yat tad bhagavan pṛthivīrajas tathāgatena bhāṣitama-rajas tad bhagavaṃs tathāgatena bhāṣitam | tenocyate pṛthivīraja iti | yo'py asau lokadhātus tathāgatena bhāṣito 'dhātuḥ sa tathāgatena bhāṣitaḥ |tenocyate lokadhātur iti |",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་སའི་རྡུལ་གང་ལགས་པ་དེ་རྡུལ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་སའི་རྡུལ་ཞེས་བགྱིའོ། ། འཇིག་རྟེན་གྱི་ཁམས་གང་ལགས་པ་དེ་དག་ཁམས་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་བགྱིའོ། །"
 ],
 "13.8": [
  "世尊言：「彼何意念？善實！三十二大丈夫相，如來、應、正遍知見應？」",
  "「須菩提，於意云何，可以三十二相見如來不？」",
  "佛告善現：「於汝意云何，應以三十二大士夫相觀於如來應正等覺不？」",
  "「妙生，於汝意云何，可以三十二大丈夫相觀如來不？」",
  " bhagavān āha | tatkiṃ manyase subhūte dvātriṃśan mahāpuruṣa-lakṣaṇaistathāgato 'rhan samyaksaṃbuddho draṣṭavyaḥ |",
  " བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། སྐྱེས་བུ་ཆེན་པོའ ི་མཚན་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫགས་པའི་སངས་རྒྱས་སུ་བལྟ་བར་བྱ་སྙམ་མམ།"
 ],
 "13.9": [
  "善實言：「不如此，世尊！不三十二大丈夫相，如來、應、正遍知見應。彼何所因？所有，世尊！三十二大丈夫相，如來說；非相所有，如來說；彼故說名三十二大丈夫相者。」",
  "「不也，世尊，不可以三十二相得見如來！何以故？如來說三十二相即是非相，是名三十二相。」",
  "善現答言：「不也，世尊，不應以三十二大士夫相觀於如來應正等覺！何以故？世尊三十二大士夫相，如來說為非相，是故如來說名三十二大士夫相。」 ",
  "妙生言：「不爾，世尊，不應以三十二相觀於如來！何以故？三十二相，佛說非相，是故說為大丈夫相。」",
  " subhūtir āha | no hīdaṃ bhagavan na dvātriṃśan-mahāpuruṣa-lakṣaṇaistathāgato 'rhan samyaksaṃbuddho draṣṭavyaḥ | tatkasya hetoḥ | yāni hitāni bhagavan dvātriṃśan mahāpuruṣa-lakṣaṇāni tathāgatena bhāṣitānya-lakṣaṇāni tāni bhagavaṃs tathāgatena bhāṣitāni | tenocyantedvātriṃśan-mahāpuruṣa-lakṣaṇānīti |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། །བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། ། དེ་ཅིའི་སླད་དུ་ཞེ་ན། སྐྱེས་བུ་ཆེན་པོའ ི་མཚན་སུམ་ཅུ་རྩ་གཉིས་གང་དག་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་དེ་དག་མཚན་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་སྐྱེས་བུ་ཆེན་པོའ ི་མཚན་སུམ་ཅུ་རྩ་གཉིས་རྣམས་ཞེས་བགྱིའོ། །"
 ],
 "13.10": [
  "世尊言：「若復時，善實！婦女，若丈夫，若日日恒伽河沙等我身捨，如是捨恒伽河沙等劫所有我身捨，若此法本乃至四句等偈，受已，為他等分別，此如是，彼緣，多過福聚生，無量、不可數。」",
  "「須菩提，若有善男子善女人，以恒河沙等身命布施；若復有人，於此經中乃至受持四句偈等，為他人說，其福甚多。」",
  "佛復告善現言：「假使若有善男子或善女人，於日日分，捨施殑伽河沙等自體，如是經殑伽河沙等劫數捨施自體；復有善男子或善女人，於此法門乃至四句伽他受持、讀誦、究竟通利，及廣為他宣說開示、如理作意。由是因緣所生福聚，甚多於前，無量無數。」",
  "「妙生，若有男子女人，以弶伽河沙等身命布施；若復有人，於此經中受持一頌，并為他說。其福勝彼，無量無數。」",
  " bhagavān āha | yaś ca khalu punaḥ subhūte strī vā puruṣo vā dine dinegaṅgā-nadī-vālukā-samān ātma-bhāvān parityajet evaṃ parityajangaṅgā-nadī-vālukā-samān kalpāṃs tān ātma-bhāvān parityajet yaś cetodharmaparyāyād antaśaś catuṣpādikām api gāthām udgṛhya parebhyodeśayet saṃprakāśayed ayam eva tato nidānaṃ bahutaraṃpuṇya-skandhaṃ prasunuyād aprameyam asaṃkhyeyam |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་སྐྱེས་བའམ། བུད་མེད་གང་ལ་ལ་ཞིག་གིས་ལུས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཡོངས་སུ་བཏང་བ་བས། གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་བཟུང་སྟེ་གཞན་དག་ལ་ཡང་དག་པར་བསྟན་ན། དེ་ཉིད་གཞི་དེ་ལས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་དོ། །"
 ],
 "14.1": [
  "爾時，命者善實，法疾轉力淚出，彼淚拭已，世尊邊如是言。",
  "爾時，須菩提聞說是經，深解義趣，涕淚悲泣而白佛言：",
  "爾時，具壽善現聞法威力，悲泣墮淚，俛仰捫淚而白佛言：",
  "爾時，妙生聞說是經，深解義趣，涕淚悲泣而白佛言：",
  " atha khalv āyuṣmān subhūtir dharma-vegena-aśrūṇi prāmuñcat so 'śrūṇipramṛjya bhagavantam etad avocat |",
  "དེ་ནས་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་ཆོས་ཀྱི་ཤུགས་ཀྱིས་མཆི་མ་ཕྱུང་སྟེ། དེས་མཆི་མ་ཕྱིས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །"
 ],
 "14.2": [
  "希有，世尊！最勝希有，善逝！所有此法本如來說，此我，世尊！智生，不我曾生來，如是色類法本聞先。",
  "「希有，世尊！佛說如是甚深經典！我從昔來所得慧眼，未曾得聞如是之經！",
  "「甚奇希有，世尊！最極希有，善逝！如來今者所說法門，普為發趣最上乘者作諸義利，普為發趣最勝乘者作諸義利！世尊，我昔生智以來，未曾得聞如是法門！",
  "「希有，世尊！我從生智以來，未曾得聞如是深經！」「世尊，當何名此經，我等云何奉持？」佛告妙生：「是經名為『般若波羅蜜多』，如是應持。何以故？佛說般若波羅蜜多，則非般若波羅蜜多。」",
  "āścaryaṃ bhagavan parama-aścaryaṃ sugata yāvad ayaṃdharm-aparyāyas tathāgatena bhāṣito 'grayāna-saṃprasthitānāṃsattvānām arthāya śreṣṭha-yāna-saṃprasthitānāṃ sattvānām-arthāya yatome bhagavañ jñānam utpannam | na mayā bhagavañ jātv evaṃrūpodharmaparyāyaḥ śruta-pūrvaḥ |",
  "ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་པས་གསུངས་པ་ནི། བཅོམ་ལྡན་འདས་ངོ་མཚར་ལགས་སོ། །བདེ་བར་གཤེགས་པ་ངོ་མཚར་ལགས་སོ། །བཅོམ་ལྡན་འདས་བདག་གིས་ཡེ་ཤེས་སྐྱེས་ཚུན་ཆད་བདག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྔོན་ནམ་ཡང་མ་ཐོས་ལགས་སོ། །"
 ],
 "14.3": [
  "最勝，彼，世尊！希有具足眾生有當，若此經中說中，實想發生當。彼何所因？若此，世尊！實想；彼如是，非想；彼故，如來說實想、實想者。",
  "世尊，若復有人得聞是經，信心清淨，則生實相，當知是人成就第一希有功德！世尊！是實相者，則是非相，是故如來說名實相。",
  "世尊，若諸有情聞說如是甚深經典，生真實想，當知成就最勝希有！何以故？世尊，諸真實想真實想者，如來說為非想，是故如來說名真實想真實想。",
  "世尊，若復有人聞說是經，生實想者，當知是人最上希有！世尊，此實想者，即非實想，是故如來說名實想實想。",
  "parameṇa te bhagavann āścaryeṇa samanvāgatā bodhisattvā bhaviṣyanti yaiha sūtre bhāṣyamāṇe śrutvā bhūta-saṃjñām utpādayiṣyanti | tatkasyahetoḥ | yā caiṣā bhagavan bhūta-saṃjñā saiva-abhūta-saṃjñā |tasmāt tathāgato bhāṣate bhūta-saṃjñā bhūta-saṃjñeti |",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་མདོ་སྡེ་བཤད་པ་འདི་ལ་གང་དག་ཡང་དག་པར་འདུ་ཤེས་བསྐྱེད་བར་འགྱུར་པའི་སེམས་ཅན་དེ་དག་ནི་ངོ་མཚར་རབ་དང་ལྡན་པར་འགྱུར་ལགས་སོ། ། དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་ཡང་དག་པར་འདུ་ཤེས་པ་གང་ལགས་པ་དེ་ཉིད་འདུ་ཤེས་མ་མཆིས་པའི་སླད་དུ་སྟེ། དེས་ན་ཡང་དག་པར་འདུ་ཤེས་ཞེས་དེ་བཞིན་གཤེགས་པས་གསུངས་སོ། །"
 ],
 "14.4": [
  "不我，世尊！希有。若我此法本說中，信我、解我。若彼，世尊！眾生有當，未來世，此法本，受當、持當、讀當、誦當，他等及分別廣說當，彼最勝希有具足有當。",
  "世尊，我今得聞如是經典，信解受持，不足為難。若當來世，後五百歲，其有眾生得聞是經，信解受持，是人則為第一希有！",
  "世尊，我今聞說如是法門，領悟、信解，未為希有。若諸有情於當來世，後時、後分、後五百歲，正法將滅時分轉時，當於如是甚深法門，領悟、信解、受持、讀誦、究竟通利，及廣為他宣說開示、如理作意，當知成就最勝希有！",
  "世尊，我聞是經，心生信解，未為希有。若當來世，有聞是經，能受持者，是人則為第一希有！",
  "na mama bhagavann āścaryaṃ yad aham imaṃ dharmaparyāyaṃbhāṣyamāṇam avakalpayāmyadhimucye | ye 'pi te bhagavan sattvābhaviṣyanty anāgate 'dhvani paścime kāle paścime samaye paścimāyāṃpañca-śatyāṃ saddharma-vipralope vartamāne ya imaṃ bhagavan dharm-aparyāyam udgrahīṣyanti dhārayiṣyanti vācayiṣyantiparyavāpsyanti parebhyaś ca vistareṇa saṃprakāśayiṣyanti teparama-āścaryeṇa samanvāgatā bhaviṣyanti |",
  "བཅོམ་ལྡན་འདས་བདག་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ལ་རྟོག་ཅིང་མོས་པ་ནི། བདག་ལ་ངོ་མཚར་མ་ལགས་ཀྱིས། ། བཅོམ་ལྡན་འདས་སླད་མའི་ཚĲ་སླད་མའི་དུས་ལྔ་བརྒྱའི་ཐ་མ་ལ་སེམས་ཅན་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལེན་པ་དང༌། འབྲི་བ་དང༌། འཛིན་པ་དང༌། འཆང་བ་དང༌། ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་པ་དེ་དག་ན་ངོ་མཚར་རབ་དང་ལྡན་པར་འགྱུར་ལགས་སོ། །"
 ],
 "14.5": [
  "雖然復次時，世尊！不彼等菩薩摩訶薩我想轉當，不眾生想、不壽想、不人想轉當。",
  "何以故？此人無我相、人相、眾生相、壽者相。",
  "何以故？世尊，彼諸有情無我想轉、無有情想、無命者想、無士夫想、無補特伽羅想、無意生想、無摩納婆想、無作者想、無受者想轉。",
  "何以故？彼人無我想、眾生想、壽者想、更求趣想。",
  " api tu khalu punar bhagavan na teṣām ātmasaṃjñā pravartiṣyate nasattva-saṃjñā na jīva-saṃjñā na pudgala-saṃjñā pravartiṣyate nāpi teṣāṃkācit saṃjñā nāsaṃjñā pravartate |",
  "ཡང་བཅོམ་ལྡན་འདས་དེ་དག་ནི་བདག་ཏུ་འདུ་ཤེས་འཇུག་པར་མི་འགྱུར་ཞིང༌། སེམས་ཅན་དུ་འདུ་ཤེས་པ་དང༌། སྲོག་ཏུ་འདུ་ཤེས་པ་དང༌། གང་ཟག་ཏུ་འདུ་ཤེས་འཇུག་པར་མི་འགྱུར་ལགས་སོ། །"
 ],
 "14.6": [
  "彼何所因？若彼，世尊！我想，彼如是非想；若及如是眾生想、壽想、人想，彼如是非想。",
  "所以者何？我相即是非相，人相、眾生相、壽者相，即是非相。",
  "所以者何？世尊，諸我想即是非想，諸有情想、命者想、士夫想、補特伽羅想、意生想、摩納婆想、作者想、受者想，即是非想。",
  "所以者何？世尊，我想、眾生想、壽者想、更求趣想，即是非想。",
  " tatkasya hetoḥ | yā sā bhagavann ātma-saṃjñā saiva-a-saṃjñā | yāsattva-saṃjñā jīva-saṃjñā pudgala-saṃjñā saivāsaṃjñā |",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་བདག་ཏུ་འདུ་ཤེས་པ་དང༌། སེམས་ཅན་དུ་འདུ་ཤེས་པ་དང༌། སྲོག་ཏུ་འདུ་ཤེས་པ་དང༌། གང་ཟག་ཏུ་འདུ་ཤེས་པ་གང་ལགས་པ་དེ་ཉིད་འདུ་ཤེས་ཐམས་ཅད་དང་བྲལ་བའི་སླད་དུའོ། །"
 ],
 "14.7": [
  "彼何所因？一切想遠離，此佛、世尊。」如是語已。世尊，命者善實邊如是言：",
  "何以故？離一切諸相，則名諸佛。」佛告須菩提：",
  "何以故？諸佛世尊，離一切想。」作是語已，爾時，世尊告具壽善現言：",
  "所以者何？諸佛世尊，離諸想故。」",
  " tatkasya hetoḥ | sarva-saṃjñā-apagatā hi buddhā bhagavantaḥ | evam uktebhagavān āyuṣmantaṃ subhūtim etad avocat |",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་འདུ་ཤེས་ཐམས་ཅད་དང་བྲལ་བའི་སླད་དུའོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །"
 ],
 "14.8": [
  "如是，如是！善實！如是，如是！如言汝。最勝希有具足彼眾生有當，若此經中說中，不驚當，不怖當，不畏當。",
  "「如是、如是！若復有人得聞是經，不驚、不怖、不畏，當知是人甚為希有！",
  "「如是、如是！善現，若諸有情聞說如是甚深經典，不驚、不懼、無有怖畏，當知成就最勝希有！",
  "「妙生，如是、如是！若復有人得聞是經，不驚、不怖、不畏，當知是人第一希有！",
  " evam etat subhūte evam etat | parama-āścarya-samanvāgatās te sattvābhaviṣyanti ya iha subhūte sūtre bhāṣyamāṇe nottrasiṣyanti nasaṃtrasiṣyanti na saṃtrāsam āpatsyante |",
  " རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། སེམས་ཅན་གང་དག་མདོ་སྡེ་འདི་བཤད་པ་ལ་མི་སྐྲག་ཅིང་མི་དངང་ལ་ཀུན་ཏུ་དངང་པར་མི་འགྱུར་བ། དེ་དག་ནི་ངོ་མཚར་རབ་དང་ལྡན་པར་འགྱུར་རོ། །"
 ],
 "14.9": [
  "彼何所因？最勝彼岸到，此，善實！如來說；若及，善實！如來最勝彼岸到說，彼無量亦佛、世尊說；彼故，說名最勝彼岸到者。",
  "何以故？須菩提，如來說第一波羅蜜，非第一波羅蜜，是名第一波羅蜜。",
  "何以故？善現，如來說最勝波羅蜜多謂般若波羅蜜多。善現，如來所說最勝波羅蜜多，無量諸佛世尊所共宣說，故名最勝波羅蜜多。如來說最勝波羅蜜多，即非波羅蜜多，是故如來說名最勝波羅蜜多 。",
  "何以故？妙生，此最勝波羅蜜多是如來所說，諸波羅蜜多如來說者，即是無邊佛所宣說，是故名為最勝波羅蜜多。",
  " tatkasya hetoḥ | paramapāramiteyaṃ subhūte tathāgatena bhāṣitāyaduta-a-pāramitā | yāṃ ca subhūte tathāgataḥ parama-pāramitāṃbhāṣate tām aparimāṇā api buddhā bhagavanto bhāṣante | tenocyateparama-pāramiteti |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་གང་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་དེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་ཚད་མེད་པ་རྣམས་ཀྱིས་ཀྱང་གསུངས་པའི་ཕྱིར་ཏེ། དེས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་ཞེས་བྱའོ། །"
 ],
 "14.10": [
  "雖然復次時，善實！若如來忍彼岸到，彼如是非彼岸到。",
  "須菩提，忍辱波羅蜜，如來說非忍辱波羅蜜。",
  "復次，善現，如來說忍辱波羅蜜多，即非波羅蜜多，是故如來說名忍辱波羅蜜多 。",
  "妙生，如來說忍辱波羅蜜多，即非忍辱波羅蜜多。",
  "api tu khalu punaḥ subhūte yā tathāgatasya kṣānti-pāramitāsaivāpāramitā |",
  "ཡང་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ཉིད་ཕ་རོལ་ཏུ་ཕྱིན་པ་མེད་དོ། །"
 ],
 "14.11": [
  "彼何所因？此時我，善實！惡王分別分肉割斷，不時我彼中時我想，若眾生想，若壽想，若人想，若不我有想非想有。",
  "何以故？須菩提，如我昔為歌利王割截身體。我於爾時，無我相、無人相、無眾生相、無壽者相。",
  "何以故？善現，我昔過去世曾為羯利王斷支節肉。我於爾時都無我想、或有情想、或命者想、或士夫想、或補特伽羅想、或意生想、或摩納婆想、或作者想、或受者想。我於爾時都無有想，亦非無想。",
  "何以故？如我昔為羯陵伽王割截支體時，無我想、眾生想、壽者想、更求趣想。我無是想，亦非無想。",
  "tatkasya hetoḥ | yadā me subhūte kaliṅgarājā-aṅga-pratyaṅga-māṃsānyacchaitsīt nāsīn-me tasmin samaya ātma-saṃjñā vā sattva-saṃjñā vājīva-saṃjñā vā pudgala-saṃjñā vā nāpi me kācit saṃjñā vā asaṃjñā vābabhūva |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གང་གི་ཚĲ་ཀ་ལིངྐའི་རྒྱལ་པོས། ངའི་ཡན་ལག་དང་ཉིང་ལག་རྣམས་བཅད་པར་གྱུར་པ་དེའི་ཚĲ་ང་ལ་བདག་ཏུ་འདུ་ཤེས་སམ། སེམས་ཅན་དུ་འདུ་ཤེས་སམ། སྲོག་ཏུ་འདུ་ཤེས་སམ། གང་ཟག་ཏུ་འདུ་ཤེས་ཀྱང་མ་བྱུང་ཞིང༌། ང་ལ་འདུ་ཤེས་ཅི་ཡང་མེད་ལ་འདུ་ཤེས་མེད་པར་གྱུར་པ་ཡང་མ་ཡིན་པའི་ཕྱིར་རོ། །"
 ],
 "14.12": [
  "彼何所因？若我，善實！彼中時我想有，瞋恨想亦我彼中時有；眾生想、壽想、人想有，瞋恨想亦我彼中時有。",
  "何以故？我於往昔節節支解時，若有我相、人相、眾生相、壽者相，應生瞋恨。",
  "何以故？善現，我於爾時若有我想，即於爾時應有恚想；我於爾時若有有情想、命者想、士夫想、補特伽羅想、意生想、摩納婆想、作者想、受者想、 即於爾時應有恚想。",
  "所以者何？我有是想者，應生瞋恨。",
  "tatkasya hetoḥ | sacen me subhūte tasmin samayaātma-saṃjñā-abhaviṣyad vyāpāda-saṃjñā api me tasmin samaye'bhaviṣyat | sacet sattva-saṃjñā jīva-saṃjñā pudgala-saṃjñā-abhaviṣyadvyāpāda-saṃjñā api me tasmin samaye 'bhaviṣyat |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གལ་ཏེ་དེའི་ཚĲ་ང་ལ་བདག་ཏུ་འདུ་ཤེས་བྱུང་ན། དེའི་ཚĲ་གནོད་སེམས་ཀྱི་འདུ་ཤེས་ཀྱང་འབྱུང་ལ། སེམས་ཅན་དུ་འདུ་ཤེས་པ་དང༌། སྲོག་ཏུ་འདུ་ཤེས་པ་དང༌། གང་ཟག་ཏུ་འདུ་ཤེས་བྱུང་ན།དེའི་ཚĲ་གནོད་སེམས་ཀྱི་འདུ་ཤེས་ཀྱང་འབྱུང་བའི་ཕྱིར་རོ། །"
 ],
 "14.13": [
  "念知我，善實！過去世五百生，若我忍語仙人有，彼中亦我不想有，不眾生想、不壽想、不人想，不亦我有想非想有。",
  "須菩提！又念過去，於五百世作忍辱仙人。於爾所世，無我相、無人相、無眾生相、無壽者相。",
  "何以故？善現，我憶過去五百生中，曾為自號忍辱仙人。我於爾時，都無我想，無有情想、無命者想、無士夫想、無補特伽羅想、無意生想、無摩納婆想、無作者想、無受者想。我於爾時都無有想，亦非無想。",
  "妙生，又念過去，於五百世作忍辱仙人。我於爾時，無如是等想。",
  "tatkasya hetoḥ | abhijānāmy ahaṃ subhūte 'tīte 'dhvani pañca jāti-śatāniyad ahaṃ kṣāntivādī ṛṣir abhūvam | tatra api me nātma-saṃjñā babhūvana sattva-saṃjñā na jīva-saṃjñā na pudgala-saṃjñā babhūva |",
  "རབ་འབྱོར་ངས་མངོན་པར་ཤེས་ཏེ། འདས་པའི་དུས་ན་ང་ཚĲ་རབས་ལྔ་བརྒྱར་བཟོད་པ་སྨྲ་བ་ཞེས་བྱ་བའི་དྲང་སྲོང་དུ་གྱུར་པ་དེའི་ཚĲ་ན་ཡང༌། ང་ལ་བདག་ཏུ་འདུ་ཤེས་མ་བྱུང༌། སེམས་ཅན་དུ་འདུ་ཤེས་དང༌། སྲོག་ཏུ་འདུ་ཤེས་དང༌། གང་ཟག་ཏུ་འདུ་ཤེས་མ་བྱུང་ངོ། །"
 ],
 "14.14": [
  "彼故此，善實！菩薩摩訶薩一切想捨離，無上正遍知心發生應，不色住心發生應，不聲、香、味、觸住心發生應，不法住、非無法住心發生應，無所住心發生應。",
  "是故，須菩提，菩薩應離一切相發阿耨多羅三藐三菩提心，不應住色生心，不應住聲、香、味、觸、法生心，應生無所住心。",
  "是故，善現，菩薩摩訶薩遠離一切想應發阿耨多羅三藐三菩提心，不住於色應生其心，不住非色應生其心，不住聲、香、味、觸、法應生其心，不住非聲、香、味、觸、法應生其心，都無所住應生其心。",
  "是故，應離諸想發趣無上菩提之心，不應住色、聲、香、味、觸、法，都無所住而生其心；不應住法，不應住非法應生其心。",
  "tasmāt tarhi subhūte bodhisattvena mahāsattvena sarva-saṃjñāvivarjayitvā anuttarāyāṃ samyaksaṃbodhau cittam utpādayitavyam | narūpa-pratiṣṭhitaṃ cittam utpādayitavyaṃ naśabda-gandha-rasa-spraṣṭavya-dharma-pratiṣṭhitaṃ cittamutpādayitavyaṃ na dharma-pratiṣṭhitaṃ cittam utpādayitavyaṃ naadharma-pratiṣṭhitaṃ cittam utpādayitavyaṃ na kvacit pratiṣṭhitaṃcittam utpādayitavyam |",
  "རབ་འབྱོར་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདུ་ཤེས་ཐམས་ཅད་རྣམ་པར་སྤངས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བྱའོ། ། གཟུགས་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །སྒྲ་དང་དྲི་དང་རོ་དང༌རེག་བྱ་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །ཆོས་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། ། ཆོས་མེད་པ་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །ཅི་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །"
 ],
 "14.15": [
  "彼何所因？若無所住，彼如是住。彼故，如是如來說，不色住，菩薩摩訶薩施與應；不聲、香、味、觸、法住施與應。",
  "若心有住，則為非住！是故佛說：『菩薩心不應住色布施。』",
  "何以故？善現，諸有所住，則為非住！是故如來說：『諸菩薩應無所住而行布施，不應住色、聲、香、味、觸、法而行布施。』",
  "何以故？若有所住，即為非住！是故佛說：『菩薩應無所住而行布施。』 ",
  "tatkasya hetoḥ | yat pratiṣṭhitaṃ tad eva apratiṣṭhitam | tasmād evatathāgato bhāṣate apratiṣṭhitena bodhisattvena dānaṃ dātavyam | narūpa-śabda-gandha-rasa-spraṣṭavya-dharma-pratiṣṭhitena dānaṃdātavyam |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། གནས་པ་གང་ཡིན་པ་དེ་ཉིད་མི་གནས་པའི་ཕྱིར་ཏེ། དེ་བས་ན་དེ་བཞིན་གཤེགས་པས་འདི་སྐད་དུ། བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ཡང་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ་ཞེས་གསུངས་སོ། །"
 ],
 "14.16": [
  "雖然復次時，善實！菩薩摩訶薩如是捨施應，一切眾生為故。",
  "須菩提，菩薩為利益一切眾生，應如是布施。",
  "復次，善現，菩薩摩訶薩為諸有情作義利故，應當如是棄捨、布施 。",
  "妙生，菩薩為利益一切眾生，應如是布施。",
  "api tu khalu punaḥ subhūte bodhisattvenaivaṃrūpo dānaparityāgaḥkartavyaḥ sarva-sattvānām arthāya | ",
  "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཕྱིར་སྦྱིན་པ་ཡོངས་སུ་བཏང་བར་བྱའོ། །"
 ],
 "14.17": [
  "彼何所因？若如是，善實！眾生想，彼如是非想。若如是，彼一切眾生如來說，彼如是非眾生。",
  "如來說一切諸相即是非相；又說一切眾生則非眾生。",
  "何以故？善現，諸有情想即是非想；一切有情，如來即說為非有情。",
  "此眾生想即為非想；彼諸眾生即非眾生。何以故？諸佛如來離諸想故。",
  "tatkasya hetoḥ | yā caiṣā subhūte sattva-saṃjñā saivāsaṃjñā | ya evaṃ tesarva-sattvās tathāgatena bhāṣitās ta evāsattvāḥ |",
  "སེམས་ཅན་དུ་འདུ་ཤེས་པ་གང་ཡིན་པ་དེ་ཉིད་ཀྱང་འདུ་ཤེས་མེད་པ་སྟེ། དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ཐམས་ཅད་ཅེས་གང་དག་གསུངས་པའི་སེམས་ཅན་དེ་དག་ཉིད་ཀྱང་མེད་པའོ།།"
 ],
 "14.18": [
  "彼何所因？真語，善實！如來，實語如來，不異語如來，如語如來，非不如語如來。",
  "須菩提，如來是真語者、實語者、如語者、不誑語者、不異語者。",
  "善現，如來是實語者、諦語者、如語者、不異語者。",
  "妙生，如來是實語者、如語者、不誑語者、不異語者。",
  "tatkasya hetoḥ | bhūta-vādī subhūte tathāgataḥ satyavādī tathāvādyananyathāvādī tathāgataḥ | na vitatha-vādī tathāgataḥ |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ནི་ཡང་དག་པར་གསུངས་པ། བདེན་པར་གསུངས་པ། དེ་བཞིན་ཉིད་དུ་གསུངས་བ་སྟེ། དེ་བཞིན་གཤེགས་པ་ནི་ལོག་པར་གསུང་པ་མ་ཡིན་པའི་ཕྱིར་རོ། །"
 ],
 "14.19": [
  "雖然復次時，善實！若如來法證覺說，若思惟，若不彼中實不妄。",
  "須菩提，如來所得法，此法無實無虛。",
  "復次，善現，如來現前等所證法、或所說法、或所思法，即於其中非諦非妄。",
  "妙生，如來所證法及所說法，此即非實非妄。",
  "api tu khalu punaḥ subhūte yas tathāgatena dharmo 'bhisaṃbuddho deśitonidhyāto na tatra satyaṃ na mṛśā |",
  "ཡང་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་ཆོས་གང་ཡང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའམ། བསྟན་པ་དེ་ལ་བདེན་པ་ཡང་མེད། རྫུན་པ་ཡང་མེད་དོ། །"
 ],
 "14.20": [
  "譬如，善實！丈夫闇舍入，不一亦見。如是事墮，菩薩見應，若事墮施與。",
  "須菩提，若菩薩心住於法而行布施，如人入闇，則無所見；",
  "善現，譬如士夫入於闇室，都無所見。當知菩薩若墮於事，謂墮於事而行布施，亦復如是。",
  "妙生，若菩薩心住於事而行布施，如人入闇則無所見；",
  "tadyathāpi nāma subhūte puruṣo 'ndhakāra-praviṣṭo na kiṃcid api paśyetevaṃ vastupatito bodhisattvo draṣṭavyo yo vastupatito dānaṃ parityajati |",
  "རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན་མིག་དང་ལྡན་པའི་མི་ཞིག་མུན་པར་ཞུགས་ན་ཅི་ཡང་མི་མཐོང་བ་དེ་བཞིན་དུ་གང་དངོས་པོར་ལྷུང་བས་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་བལྟ་བར་བྱའོ། །"
 ],
 "14.21": [
  "譬如，善實！眼者丈夫，顯明夜日出，種種色見。如是菩薩摩訶薩見應，若事不墮施與。",
  "若菩薩心不住法而行布施，如人有目日光明，照見種種色。",
  "善現，譬如明眼士夫，過夜曉已，日光出時見種種色。當知菩薩不墮於事 ，謂不墮事而行布施，亦復如是。",
  "若不住事而行布施，如人有目，日光明照，見種種色。是故菩薩不住於事應行其施。 ",
  "tadyathāpi nāma subhūte cakṣuṣmān puruṣaḥ prabhātāyāṃ rātrau sūrye'bhyudgate nānāvidhāni rūpaṇi paśyet evam avastupatito bodhisattvodraṣṭavyo yo 'vastupatito dānaṃ parityajati |",
  "ཡང་རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། ནམ་ལངས་ཏེ་ཉི་མ་ཤར་ནས་མིག་དང་ལྡན་པའི་མིས་གཟུགས་རྣམ་པ་སྣ་ཚŀགས་དག་མཐོང་བ་དེ་བཞིན་དུ་གང་དངོས༌པོར་མ་ལྷུང་བས་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་བལྟ་བར་བྱའོ། །"
 ],
 "14.22": [
  "雖然復次時，善實！若善家子、善家女，若此法本，受當、持當、讀當、誦當，為他等及分別廣說當。知彼，善實！如來佛智，見彼，善實！如來佛眼。一切彼，善實！眾生，無量福聚生當取當。",
  "須菩提，當來之世，若有善男子、善女人能於此經受持、讀誦，則為如來以佛智慧，悉知是人、悉見是人，皆得成就無量無邊功德。",
  "復次，善現，若善男子或善女人於此法門受持、讀誦、究竟通利，及廣為他宣說開示、如理作意，則為如來以其佛智悉知是人，則為如來以其佛眼悉見是人，則為如來悉覺是人。如是有情，一切當生無量福聚。",
  "妙生，若有善男子、善女人能於此經受持、讀誦、為他演說，如是之人，佛以智眼悉知、悉見，當生當攝無量福聚。",
  "api tu khalu punaḥ subhūte ye kulaputrā vā kuladuhitaro vemaṃdharmaparyāyam udgrahīṣyanti dhārayiṣyanti vācayiṣyantiparyavāpsyanti parebhyaś ca vistareṇa saṃprakāśayiṣyanti jñātās tesubhūte tathāgatena buddha-jñānena dṛṣṭās te subhūte tathāgatenabuddha-cakṣuṣā buddhās te tathāgatena | sarve te subhūte sattvāaprameyam asaṃkhyeyaṃ puṇya-skandhaṃ prasaviṣyantipratigrahīṣyanti ||14||",
  "ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལེན་པ་དང༌། འཛིན་པ་དང༌། འཆང་བ་དང༌། ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་པ་དང༌། གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་མཁྱེན། དེ་བཞིན་གཤེགས་པས་གཟིགས་ཏེ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་བསྐྱེད་པར་འགྱུར་རོ། །"
 ],
 "15.1": [
  "若復時，善實！婦女，若丈夫，若前分時，恒伽河沙等我身捨，如是中分時，如是晚分時，恒伽河沙等我身捨。以此因緣，劫俱致那由多百千我身捨。",
  "須菩提，若有善男子、善女人，初日分以恒河沙等身布施，中日分復以恒河沙等身布施，後日分亦以恒河沙等身布施，如是無量百千萬億劫以身布施；",
  "復次，善現，假使善男子或善女人，日初時分以殑伽河沙等自體布施，日中時分復以殑伽河沙等自體布施，日後時分亦以殑伽河沙等自體布施，由此異門，經於俱胝那庾多百千劫以自體布施；",
  "妙生，若有善男子、善女人，初日分以弶伽河沙等身布施，中日分復以弶伽河沙等身布施，後日分亦以弶伽河沙等身布施，如是無量百千萬億劫以身布施；",
  "yaś ca khalu punaḥ subhūte strī vā puruṣo vā pūrv-āhṇa-kāla-samayegaṅgā-nadī-vālukā-samān ātmabhāvān parityajed | evaṃmadhyā-āhṇa-kāla-samaye gaṅgā-nadī-vālukā-samān ātmabhāvānparityajet | sāya-āhṇa-kāla-samaye gaṅgā-nadī-vālukā-samān ātmabhāvānparityajet anena paryāyeṇa bahūni kalpa-koṭi-niyuta-śatasahasrāṇyātmabhāvān parityajet |",
  "ཡང་རབ་འབྱོར་སྐྱེས་པའམ། བུད་མེད་གང་ཞིག་སྔ་དྲོའ ི་དུས་ཀྱི་ཚĲ་ལུས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཡོངས་སུ་གཏོང་ལ། ཕྱེད་ཀྱི་དུས་དང༌། ཕྱི་དྲོའ ི་དུས་ཀྱི་ཚĲ་ཡང་ལུས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཡོངས་སུ་གཏོང་སྟེ། རྣམ་གྲངས་འདི་ལྟ་བུར་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མར་ལུས་ཡོངས་སུ་གཏོང་བ་བས།"
 ],
 "15.2": [
  "若此法本，聞已不謗，此如是，彼緣，多過福聚生，無量、不可數。何復言若寫已受持讀誦，為他等及分別廣說。",
  "若復有人聞此經典，信心不逆，其福勝彼。何況書寫、受持、讀誦、為人解說！",
  "若有聞說如是法門，不生誹謗。由此因緣所生福聚，尚多於前無量無數。何況能於如是法門具足畢竟書寫、受持、讀誦、究竟通利及廣為他宣說開示、如理作意！",
  "若復有人聞此經典，不生毀謗。其福勝彼。何況書寫、受持、讀誦、為人解說！",
  " yaś cemaṃ dharmaparyāyaṃ śrutvā na pratikṣipet ayam eva tato nidānaṃbahutaraṃ puṇya-skandhaṃ prasunuyād aprameyam asaṃkhyeyam | kaḥpunar vādo yo likhitvodgṛhṇīyād dhārayed vācayet paryavāpnuyātparebhyaś ca vistareṇa saṃprakāśayet |",
  "གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་མི་སྤོང་ན། དེ་ཉིད་གཞི་དེ་ལས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་ན། གང་གིས་ཡི་གེར་བྲིས་ནས་ལེན་པ་དང༌། འཛིན་པ་དང༌། འཆང་བ་དང༌། ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་པ་དང༌། གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་ལྟ་ཅི་སྨོས།"
 ],
 "15.3": [
  "雖然復次時，善實！不可思、不可稱，此法本，彼不可思，如是果報觀察應。",
  "须菩提，以要言之，是经有不可思议、不可称量无边功德！",
  "复次，善现，如是法门不可思议、不可称量！应当希冀不可思议所感异熟 ！",
  "妙生，是经有不可思议、不可称量无边功德！",
  "api tu khalu punaḥ subhūte 'cintyo 'tulyo 'yaṃ dharmaparyāyaḥ |",
  "ཡང་རབ་འབྱོར། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་བསམ་གྱིས་མི་ཁྱབ་ཅིང༌། མཚུངས་པ་མེད་དེ། འདིའི་རྣམ་པར་སྨིན་པ་ཡང་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་དུ་རིག་པར་བྱའོ། །"
 ],
 "15.4": [
  "此，善實！法本如來說，勝乘發行眾生為故，最勝乘發行眾生為故。",
  "如來為發大乘者說、為發最上乘者說！",
  "善現，如來宣說如是法門，為欲饒益趣最上乘諸有情故、為欲饒益趣最勝乘諸有情故！",
  "如來為發大乘者說、為發最上乘者說！",
  "ayaṃ ca subhūte dharmaparyāyas tathāgatena bhāṣito'gra-yāna-saṃprasthitānāṃ sattvānām arthāyaśreṣṭha-yāna-saṃprasthitānāṃ sattvānām arthāya |",
  "ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ཐེག་པ་མཆོག་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་དང༌། ཐེག་པ་ཕུལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་གསུངས་སོ། །"
 ],
 "15.5": [
  "若此法本，受當、持當、讀當、誦當，為他等及分別廣說當。知彼，善實！如來佛智；見彼，善實！如來佛眼。",
  "若有人能受持、讀誦、廣為人說，如來悉知是人、悉見是人！",
  "善現，若有於此法門受持、讀誦、究竟通利，及廣為他宣說開示、如理作意，即為如來以其佛智悉知是人，即為如來以其佛眼悉見是人，則為如來悉覺是人！",
  "若有人能受持、讀誦、廣為他說，如來悉知、悉見是人！",
  "ya imaṃ dharm-aparyāyam udgrahīṣyanti dhārayiṣyanti vācayiṣyantiparyavāpsyanti parebhyaśca vistareṇa saṃprakāśayiṣyanti jñātās tesubhūte tathāgatena buddha-jñānena dṛṣṭās te subhūte tathāgatenabuddha-cakṣuṣā buddhās te tathāgatena |",
  "གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལེན་པ་དང༌། འཛིན་པ་དང༌། འཆང་བ་དང༌། ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་པ་དང༌། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་མཁྱེན།དེ་བཞིན་གཤེགས་པས་གཟིགས་ཏེ།"
 ],
 "15.6": [
  "一切彼，善實！眾生，無量福聚具足有當，不可思、不可稱亦不可量福聚具足有當。一切彼，善實！眾生，我肩菩提持當有。",
  "皆得成就不可量、不可稱、無有邊、不可思議功德！如是人等，則為荷擔如來阿耨多羅三藐三菩提！",
  "如是有情一切成就無量福聚！皆當成就不可思議、不可稱量無邊福聚！善現，如是一切有情，其肩荷擔如來無上正等菩提！",
  "皆得成就不可量、不可稱、不可思議福業之聚！當知是人，則為以肩荷負如來無上菩提！",
  "sarve te subhūte sattvā aprameyeṇa puṇya-skandhena samanvāgatābhaviṣyanti | acintyena atulyena amāpyena aparimāṇena puṇya-skandhenasamanvāgatā bhaviṣyanti | sarve te subhūte sattvāḥ samāṃśena bodhiṃdhārayiṣyanti |",
  "སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་དང་ལྡན་པར་འགྱུར་བསོད་ནམས་ཀྱི་ཕུང་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་དང༌། མཚུངས་པ་མེད་པ་དང༌། གཞལ་དུ་མེད་པ་དང༌། ཚད་མེད་པ་དང་ལྡན་པར་འགྱུར་ཏེ། སེམས་ཅན་དེ་དག་ཐམས་ཅད་ངའི་བྱང་ཆུབ་ཕྲག་པ་ལ་ཐོགས་པར་འགྱུར་རོ། །"
 ],
 "15.7": [
  "彼何所因？不能，善實！此法本，小信解者眾生聞，不我見者、不眾生見者、不壽見者、不人見者、不菩薩誓眾生能聞受，若持、若讀、若誦，若無是處有。",
  "何以故？須菩提，若樂小法者，著我見、人見、眾生見、壽者見，則於此經不能聽受、讀誦、為人解說！",
  "何以故？善現，如是法門，非諸下劣信解有情所能聽聞！非諸我見、非諸有情見、非諸命者見、非諸士夫見、非諸補特伽羅見、非諸意生見、非諸摩納婆見、非諸作者見、非諸受者見所能聽聞！此等若能受持、讀誦、究竟通利、及廣為他宣說開示、如理作意，無有是處！",
  "何以故？妙生，若樂小法者,則著我見、眾生見、壽者見、更求趣見，是人若能讀誦、受持此經，無有是處！",
  "tatkasya hetoḥ | na hi śakyaṃ subhūte 'yaṃ dharmaparyāyohīna-adhimuktikaiḥ sattvaiḥ śrotuṃ na ātma-dṛṣṭikair na sattvadṛṣṭikair najīva-dṛṣṭikair na pudgala-dṛṣṭikaiḥ | na abodhisattva-pratijñaiḥ sattvaiḥśakyam ayaṃ dharmaparyāyaḥ śrotuṃ vodgrahītuṃ vā dhārayituṃ vāvācayituṃ vā paryavāptuṃ vā | nedaṃ sthānaṃ vidyate | ",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དམན་པ་ལ་མོས་པ་རྣམས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མཉན་པར་མི་ནུས་ཏེ།བདག་ཏུ་ལྟ་བ་རྣམས་ཀྱིས་མ་ཡིན། སེམས་ཅན་དུ་ལྟ་བ་རྣམས་ཀྱིས་མ་ཡིན། སྲོག་ཏུ་ལྟ་བ་རྣམས་ཀྱིས་མ་ཡིན་ཞིང༌། གང་ཟག་ཏུ་ལྟ་བ་རྣམས་ཀྱིས་མཉན་པ་དང༌། བླང་བ་དང་བཟུང་བ་དང༌། ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་མི་ནུས་ཏེ། དེ་ནི་གནས་མེད་པའི་ཕྱིར་རོ།།"
 ],
 "15.8": [
  "雖然復次時，善實！此中地分，此經廣說，供養彼地分有當天、人、阿脩羅世，禮右繞作及彼地分有當，支帝彼地分有當。",
  "須菩提，在在處處若有此經，一切世間天、人、阿修羅所應供養！當知此處則為是塔。皆應恭敬，作禮圍繞，以諸華香而散其處！",
  "復次，善現，若地方所聞此經典，此地方所當為世間諸天及人、阿素洛等之所供養，禮敬右遶，如佛靈廟！",
  "妙生，所在之處若有此經，當知此處則是制底一切世間天、人、阿蘇羅所應恭敬，作禮圍繞，以諸香花供養其處！ ",
  "api tu khalu punaḥ subhūte yatra pṛthivīpradeśa idaṃ sūtraṃprakāśayiṣyate pūjanīyaḥ sa pṛthivīpradeśo bhaviṣyatisadeva-mānuṣa-asurasya lokasya vandanīyaḥ pradakṣiṇīyaś ca sapṛthivīpradeśo bhaviṣyati caityabhūtaḥ sa pṛthivīpradeśo bhaviṣyati ||15||",
  "ཡང་རབ་འབྱོར་ས་ཕྱོགས་གང་ན་མདོ་སྡེ་འདི་སྟོན་པའི་ས་ཕྱོགས་དེ་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་མཆོད་པ་བྱ་བར་འོས་པར་འགྱུར་རོ། །ས་ཕྱོགས་དེ་ཕྱག་བྱ་བར་འོས་པ་དང༌། སྐོར་བ་བྱ་བར་འོས་པར་འགྱུར་ཏེ། ས་ཕྱོགས་དེ་མཆོད་རྟེན་ལྟ་བུར་འགྱུར་རོ། །"
 ],
 "16.1": [
  "若彼，善實！善家子，若善家女，若此如是色類經，受當、持當、讀當、誦當，為他等及分別廣說當，彼輕賤有當極輕賤。",
  "復次，須菩提，善男子、善女人受持、讀誦此經，若為人輕賤，",
  "復次，善現，若善男子或善女人，於此經典受持、讀誦、究竟通利及廣為他宣說開示、如理作意，若遭輕毀、極遭輕毀。",
  "妙生，若有善男子善女人，於此經典受持、讀誦、演說之時，或為人輕辱。",
  "api tu ye te subhūte kulaputrā vā kuladuhitaro vemān evaṃrūpānsūtrāntān udgrahīṣyanti dhārayiṣyanti vācayiṣyanti paryavāpsyanti yoniśaśca manasikariṣyanti parebhyaś ca vistareṇa saṃprakāśayiṣyanti teparibhūtā bhaviṣyanti suparibhūtāś ca bhaviṣyanti |",
  "ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་འདི་ལྟ་བུའི་མདོ་སྡེའི་ཚིག་འདི་དག་ལེན་པ་དང༌།འཛིན་པ་དང༌། འཆང་བ་དང༌། ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་པ་དེ་དག་ནི་མནར་བར་འགྱུར་ཤིན་ཏུ་མནར་བར་འགྱུར་རོ། །"
 ],
 "16.2": [
  "彼何所因？所有彼眾生，前生不善業作已，惡趣轉墮；所有現如是法中，輕賤盡當，佛菩提得當。",
  "是人先世罪業，應墮惡道，以今世人輕賤故，先世罪業則為消滅，當得阿耨多羅三藐三菩提！",
  "所以者何？善現，是諸有情宿生所造諸不淨業，應感惡趣，以現法中遭輕毀故，宿生所造諸不淨業皆悉消盡，當得無上正等菩提！",
  "何以故？妙生，當知是人於前世中造諸惡業，應墮惡道，由於現在得遭輕辱，此為善事，能盡惡業，速至菩提故！",
  "tatkasya hetoḥ | yāni ca teṣāṃ subhūte sattvānāṃpaurva-janmikāny-aśubhāni karmāṇi kṛtāny apāya-saṃvartanīyāni dṛṣṭaeva dharme paribhūtatayā tāni paurvajanmikāny aśubhāni karmāṇikṣapayiṣyanti buddhabodhiṃ ca anuprāpsyanti | ",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སེམས་ཅན་དེ་དག་ནི་ཚĲ་རབས་སྔ་མའི་མི་དགེ་བའི་ལས་ངན་སོང་དུ་སྐྱེ་བར་འགྱུར་བ་གང་དག་བྱས་པ་དེ་དག་ཚĲ་འདི་ཉིད་ལ་མནར་བས། ཚĲ་རབས་སྔ་མའི་མི་དགེ་བའི་ལས་ངན་སོང་དུ་སྐྱེ་བར་འགྱུར་བ་གང་དག་བྱས་པ་དེ་དག་འབྱང་བར་འགྱུར་ཏེ། སངས་རྒྱས་ཀྱི་བྱན་ཆུབ་ཀྱང་ཐོབ་པར་འགྱུར་རོ། །"
 ],
 "16.3": [
  "彼何所因？念知我，善實！過去世不可數劫，不可數過，燈作如來、應、正遍知，他他過，四八十佛俱致那由多百千有，若我親承供養，親承供養已，不遠離。若我，善實！彼佛、世尊親承供養已，不遠離。",
  "須菩提，我念過去無量阿僧祇劫，於然燈佛前，得值八百四千萬億那由他諸佛，悉皆供養承事，無空過者！",
  "何以故？善現，我憶過去於無數劫、復過無數，於然燈如來、應、正等覺先、復過先，曾值八十四俱胝那庾多百千諸佛，我皆承事！既承事已，皆無違犯！善現，我於如是諸佛世尊皆得承事，既承事已，皆無違犯！",
  "妙生！我憶過去過無數劫，在然燈佛先，得值八十四億那庾多佛，悉皆供養承事，無違背者！",
  "tat kasya hetoḥ | abhijānāmy ahaṃ subhūte atīte 'dhvany asaṃkhyeyaiḥkalpair asaṃkhyeyatarair dīpaṃkarasya tathāgatasya arhataḥsamyaksaṃbuddhasya pareṇa paratareṇacatur-aśīti-buddha-koṭi-niyuta-śatasahasrāṇy abhūvan ye mayā ārāgitāārāgya na virāgitāḥ | yac ca mayā subhūte te buddhā bhagavanta ārāgitāārāgya na virāgitā",
  "རབ་འབྱོར་ངས་མངོན་པར་ཤེས་ཏེ། འདས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱི་སྔ་རོལ་གྱི་ཡང་ཆེས་སྔ་རོལ་ན། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དག་བྱུང་བ་ངེས་མཉེས་པར་བྱས་ཏེ། མ་མཉེས་པར་མ་བྱས་ནས་ཐུགས་འབྱུང་བར་མ་བྱས་ཏེ། རབ་འབྱོར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ངས་མཉེས་པར་བྱས་ནས་ཐུགས་འབྱུང་བར་མ་བྱས་པ་གང་ཡིན་པ་དང༌།"
 ],
 "16.4": [
  "若後時、後長時，後分五百，正法破壞時中，轉時中，此經受當、持當、讀當、誦當，為他等及分別廣說當。",
  "若復有人於後末世能受持、讀誦此經，",
  "若諸有情後時、後分、後五百歲，正法將滅時分轉時，於此經典受持、讀誦、究竟通利、及廣為他宣說開示、如理作意。",
  "若復有人於後五百歲，正法滅時，能於此經受持、讀誦、解其義趣、廣為他說，",
  " yac ca paścime kāle paścime samaye paścimāyāṃ pañcaśatyāṃsaddharma-vipralopa-kāle vartamāne imān evaṃrūpān sūtrāntānudgrahīṣyanti dhārayiṣyanti vācayiṣyanti paryavāpsyanti parebhyaś cavistareṇa saṃprakāśayiṣyanty",
  "ཕྱི་མའི་དུས་ལྔ་བརྒྱའི་ཐ་མར་གྱུར་པ་ན། མདོ་སྡེ་འདི་ལེན་པ་དང༌། འདྲི་བ་དང༌། འཛིན་པ་དང་འཆང་བ་དང༌།ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་པ་གང་ཡིན་པ་ལས།"
 ],
 "16.5": [
  "此復時，善實！福聚邊，此前福聚，百上亦數不及，千上亦，百千上亦，俱致百千上亦，俱致那由多百千上亦，僧企耶亦，迦羅亦，算亦，譬喻亦，憂波泥奢亦，乃至譬喻亦不及。",
  "所得功德於我所供養諸佛功德， 百分不及一，千萬億分、乃至算數譬喻所不能及！",
  "善現，我先福聚於此福聚，百分計之所不能及，如是千分、若百千分、若俱胝百千分、若俱胝那庾多百千分、若數分、若計分、若算分、若喻分、若鄔波尼殺曇分，亦不能及！ ",
  "所得功德，以前功德比此功德百分不及一，千萬億分、算分、勢分、比數分、因分、乃至譬喻，亦不能及！",
  " asya khalu punaḥ subhūte puṇyaskandhasya antikād asau paurvakaḥpuṇya-skandhaḥ śatatamīm api kalāṃ nopaiti sahasratamīm apiśatasahasratamīm api koṭitamīm api koṭi-śatatamīm apikoṭi-śatasahasratamīm api koṭi-niyuta-śatasahasratamīm api saṃkhyāmapi kalāmapi gaṇanām apyupamām apy upaniṣadam api yāvad aupamyamapi na kṣamate |",
  "རབ་འབྱོར་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདི་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ།སྟོང་གི་ཆ་དང༌། འབུམ་གྱི་ཆ་དང༌། གྲངས་དང་ཚད་དང་བགྲང་བ་དང༌། དཔེ་དང་ཟླ་དང་རྒྱུར་ཡང་མི་བཟོད་དོ། །"
 ],
 "16.6": [
  "若復，善實！彼等善家子、善家女，我福聚說，此所有彼善家子、善家女，若彼中時中福聚取當，猛眾生順到，心亂到。",
  "須菩提，若善男子、善女人，於後末世，有受持、讀誦此經所得功德，我若具說者，或有人聞，心則狂亂、狐疑不信！",
  "善現，我若具說當於爾時是善男子或善女人所生福聚，乃至是善男子是善女人所攝福聚，有諸有情則便迷悶、心惑狂亂！",
  "妙生，我若具說受持讀誦此經功德，或有人聞，心則狂亂，疑惑不信！",
  "sacet punaḥ subhūte teṣāṃ kulaputrāṇāṃ kuladuhitfṇāṃ vā ahaṃpuṇyaskandhaṃ bhāṣeyaṃ yāvat te kulaputrā vā kuladuhitaro vā tasminsamaye puṇyaskandhaṃ prasaviṣyanti pratigrahīṣyanty unmādaṃ sattvāanuprāpnuyuś citta-vikṣepaṃ vā gaccheyuḥ |",
  "རབ་འབྱོར་གལ་ཏེ་དེའི་ཚĲ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་སྙེད་རབ་ཏུ་འཛིན་པར་འགྱུར་བའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ངས་བརྗོད་ན།སེམས་ཅན་རྣམས་མྱོས་མྱོས་པོར་འགྱུར་ཞིང་སེམས་འཁྲུགས་པར་འགྱུར་རོ། །"
 ],
 "16.7": [
  "雖然復次時，善實！不可思、不可稱，法本如來說，彼不可思，如是果報觀察應。。",
  "須菩提，當知是經義不可思議，果報亦不可思議！」",
  "是故，善現，如來宣說如是法門不可思議、不可稱量！應當希冀不可思議所感異熟！」 ",
  "妙生，當知是經不可思議！其受持者應當希望不可思議所生福聚！」",
  "api tu khalu punaḥ subhūte 'cintyo 'tulyo 'yaṃ dharma-paryāyastathāgatena bhāṣitaḥ | asya acintya eva vipākaḥ pratikāṅkṣitavyaḥ ||16||",
  "ཡང་རབ་འབྱོར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསམ་གྱིས་མི་ཁྱབ་སྟེ། འདིའི་རྣམ་པར་སྨིན་པ་ཡང་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་དུ་རིག་པར་བྱའོ། །"
 ],
 "17.1": [
  "爾時，命者善實，世尊邊如是言：「云何，世尊！菩薩乘發行住應？云何修行應？云何心降伏？」",
  "爾時，須菩提白佛言：「世尊，善男子、善女人發阿耨多羅三藐三菩提心，云何應住、云何降伏其心？」",
  "爾時，具壽善現復白佛言：「世尊，諸有發趣菩薩乘者，應云何住、云何修行、云何攝伏其心？」",
  "復次，妙生白佛言：「世尊，若有發趣菩薩乘者，應云何住、云何修行、云何攝伏其心？」",
  "atha khalvāyuṣmān subhūtir bhagavantam etad avocat | kathaṃ bhagavanbodhisattva-yāna-saṃprasthitena sthātavyaṃ kathaṃ pratipattavyaṃkathaṃ cittaṃ pragrahītavyam | ",
  "དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས་ཇི་ལྟར་གནས་པར་བགྱི། ཇི་ལྟར་བསྒྲུབ་པར་བགྱི། ཇི་ལྟར་སེམས་རབ་ཏུ་བཟུང་བར་བགྱི།"
 ],
 "17.2": [
  "世尊言：「此，善實！菩薩乘發行，如是心發生應：『一切眾生，無我受餘涅槃界滅度應，如是一切眾生滅度，無有一眾生滅度有。』",
  "佛告須菩提：「善男子、善女人，發阿耨多羅三藐三菩提者，當生如是心：『我應滅度一切眾生。滅度一切眾生已，而無有一眾生實滅度者。』",
  " 佛告善現：「諸有發趣菩薩乘者，應當發起如是之心，『我當皆令一切有情於無餘依妙涅槃界而般涅槃。雖度如是一切有情令滅度已，而無有情得滅度者。』",
  " 佛告妙生：「若有發趣菩薩乘者，當生如是心，『我當度脫一切眾生 悉皆令入無餘涅槃 雖有如是無量眾生證於圓寂 而無有一眾生證圓寂者。』",
  "bhagavān āha | iha subhūte bodhisattva-yāna-saṃprasthitena evaṃ cittamutpādayitavyaṃ sarve sattvā mayā anupadhiśeṣe nirvāṇadhātauparinirvāpayitavyāḥ | evaṃ ca sattvān parinirvāpya na kaścit sattvaḥparinirvāpito bhavati |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པས་འདི་སྙམ་དུ། བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་མྱ་ངན་ལས་བཟླའོ། ། དེ་ལྟར་སེམས་ཅན་ཚད་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང༌། སེམས་ཅན་གང་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་པ་མེད་དོ། ། སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ། །"
 ],
 "17.3": [
  "彼何所因？若，善實！菩薩眾生想轉，彼不菩薩摩訶薩名說應；乃至人想轉，不彼菩薩摩訶薩名說應。",
  "何以故？須菩提，若菩薩有我相、人相、眾生相、壽者相，則非菩薩！",
  "何以故？善現，若諸菩薩摩訶薩有情想轉，不應說名菩薩摩訶薩！所以者何？若諸菩薩摩訶薩不應說言有情想轉，如是命者想、士夫想、補特伽羅想 意生想、摩納婆想、作者想、受者想轉，當知亦爾！",
  "何以故？妙生，若菩薩有眾生想者，則不名菩薩！",
  "tatkasya hetoḥ | sacet subhūte bodhisattvasya sattva-saṃjñā pravarteta nasa bodhisattva iti vaktavyaḥ | jīvasaṃjñā vā yāvat pudgalasaṃjñā vāpravarteta na sa bodhisattva iti vaktavyaḥ |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་དུ་འདུ་ཤེས་འཇུག་ན་དེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱ་ལ། གང་ཟག་གི་བར་དུ་འདུ་ཤེས་འཇུག་ན་ཡང༌དེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱ་བའི་ཕྱིར་རོ། །"
 ],
 "17.4": [
  "彼何所由？無有，善實！一法，菩薩乘發行名。",
  "所以者何？須菩提，實無有法，發阿耨多羅三藐三菩提者！」",
  "何以故？善現，無有少法，名為發趣菩薩乘者！」",
  "所以者何？妙生，實無有法，可名發趣菩薩乘者！」",
  "tat kasya hetoḥ | nāsti subhūte sa kaścid dharmo yobodhisattva-yāna-saṃprasthito nāma |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་ཞེས་བྱ་བའི་ཆོས་དེ་གང་ཡང་མེད་པའི་ཕྱིར་རོ། །"
 ],
 "17.5": [
  "彼何意念？善實！有一法，若如來燈作如來、應、正遍知邊，無上正遍知證覺？",
  "「須菩提，於意云何，如來於然燈佛所，有法得阿耨多羅三藐三菩提不？」",
  "佛告善現：「於汝意云何，如來昔於然燈如來、應、正等覺所，頗有少法能證阿耨多羅三藐三菩提不？」",
  "「妙生，於汝意云何，如來於然燈佛所，頗有少法是所證不？」",
  "tat kiṃ manyase subhūte asti sa kaścid dharmo yas tathāgatenadīpaṃkarasya tathāgatasya antikād anuttarāṃ samyaksaṃbodhimabhisaṃbuddhaḥ |",
  "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་གང་ཡང་ཡོད་སྙམ་མམ།"
 ],
 "17.6": [
  "如是語已。命者善實，世尊邊如是言：「無有彼，世尊！一法，若如來燈作如來、應、正遍知邊，無上正遍知證覺。。",
  "「不也，世尊，如我解佛所說義，佛於然燈佛所，無有法得阿耨多羅三藐三菩提！」",
  "作是語已，具壽善現白佛言：「世尊，如我解佛所說義者，如來昔於然燈如來、應、正等覺所，無有少法能證阿耨多羅三藐三菩提！」",
  "妙生言：「如來於然燈佛所，無法可證而得菩提！」",
  "evam ukte āyuṣmān subhūtir bhagavantam etad avocat |yathā ahaṃ bhagavan bhagavato bhāṣitasya artham ājānāmi nāsti sabhagavan kaścid dharmo yas tathāgatena dīpaṃkarasya tathāgatasyaarhataḥ samyaksaṃbuddhasya antikād anuttarāṃ samyaksaṃbodhimabhisaṃbuddhaḥ |",
  "དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང༌། བཅོམ་ལྡན་འདས་ལ་ཚĲ་དང༌ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་སོ། །"
 ],
 "17.7": [
  "如是語已。世尊，命者善實如是言：「如是，如是！善實！如是，如是！無有彼一法，若如來，燈作如來、應、正遍知邊，無上正遍知證覺。",
  "佛言：「如是、如是！須菩提，實無有法，如來得阿耨多羅三藐三菩提！",
  "說是語已，佛告具壽善現言：「如是、如是！善現，如來昔於然燈如來、應、正等覺所，無有少法能證阿耨多羅三藐三菩提！ ",
  "佛言：「如是、如是！妙生，實無有法，如來於然燈佛所，有所證悟得大菩提！",
  "evam ukte bhagavān āyuṣmantaṃ subhūtim etad avocat | evam etat subhūteevam etan nāsti subhūte sa kaścid dharmo yas tathāgatena dīpaṃkarasyatathāgatasya arhataḥ samyaksaṃbuddhasya antikād anuttarāṃsamyaksaṃbodhim abhisaṃbuddhaḥ |",
  " དེ་སྐད་ཅེས་གསོལ་པ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་མེད་དོ། །"
 ],
 "17.8": [
  "若復，善實！一法，如來證覺有，不我燈作如來應正遍知記說：『有當汝行者，未來世，釋迦牟尼名，如來、應、正遍知。』者。",
  "須菩提，若有法如來得阿耨多羅三藐三菩提者，然燈佛則不與我受記：『汝於來世，當得作佛，號釋迦牟尼。』",
  "何以故？善現！如來昔於然燈如來、應、正等覺所，若有少法能證阿耨多羅三藐三菩提者，然燈如來、應、正等覺不應授我記言：『汝摩納婆，於當來世，名釋迦牟尼如來、應、正等覺。』",
  "若證法者，然燈佛則不與我授記：『摩納婆！汝於來世，當得作佛，號釋迦牟尼。』",
  "sacet punaḥ subhūte kaścid dharmas tathāgatena abhisaṃbuddho'bhaviṣyanna māṃ dīpaṃkaras tathāgato vyākariṣyad bhaviṣyasi tvaṃmāṇava-anāgate 'dhvani śākyamunir nāma tathāgato 'rhansamyaksaṃbuddha iti |",
  " རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་གང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་འགའ་ཞིག་ཡོད་པར་གྱུར་ན། །དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ང་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་ན།དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ། ། ཞེས་ལུང་མི་སྟོན་པ་ཞིག་ན།"
 ],
 "17.9": [
  "是故，此，善實！如來、應、正遍知，無有一法，若無上正遍知證覺，彼故，燈作如來、應、正遍知記說有當：『汝行者，未來世，釋迦牟尼名，如來、應、正遍知。』。",
  "以實無有法，得阿耨多羅三藐三菩提！是故，然燈佛與我受記，作是言：『汝於來世，當得作佛，號釋迦牟尼。』",
  "善現，以如來無有少法，能證阿耨多羅三藐三菩提！是故，然燈如來、應、正等覺授我記言：『汝摩納婆，於當來世，名釋迦牟尼如來、應、正等覺。』",
  "以無所得故，然燈佛與我授記：『當得作佛，號釋迦牟尼。』",
  "yasmāt tarhi subhūte tathāgatena arhatā samyaksaṃbuddhena nāsti sakaścid dharmo yo 'nuttarāṃ samyaksaṃbodhim abhisaṃbuddhas tasmādahaṃ dīpaṃkareṇa tathāgatena vyākṛto bhaviṣyasi tvaṃ māṇava-anāgate'dhvani śākyamunir nāma tathāgato 'rhan samyaksaṃbuddhaḥ |",
  "རབ་འབྱོར་འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་མེད་པས་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ང་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ། །"
 ],
 "17.10": [
  "彼何所因？如來者，善實！真如故此即是；如來者，善實！不生法故此即是；世尊者，善實！道斷此即是；如來者，善實！畢竟不生故此即是。彼何所因？如是，彼實不生，若最勝義。",
  "何以故？如來者，即諸法如義！",
  "所以者何？善現，言如來者，即是真實真如增語；言如來者，即是無生法性增語！言如來者，即是永斷道路增語！言如來者，即是畢竟不生增語！何以故？善現，若實無生，即最勝義！",
  "何以故？妙生，言如來者，即是實性真如之異名也！",
  "tatkasya hetoḥ | tathāgata iti subhūte | bhūta-tathatāyā etad adhivacanam |tathāgata iti subhūte | anutpāda dharmatāyā etad adhivacanam | tathāgataiti subhūte | dharmo cchedasya etad adhivacanam | tathāgata iti subhūte |atyanta anutpannasya etad adhivacanam | tat kasya hetoḥ | eṣa subhūte'nutpādo yaḥ paramārthaḥ |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་ནི། ཡང་དག་པའི་དེ་བཞིན་ཉིད་ཀྱི་ཚིག་བླ་དྭགས་ཡིན་པའི་ཕྱིར་རོ། །"
 ],
 "17.11": [
  "若有，善實！如是語：『如來、應、正遍知，無上正遍知證覺。』彼不如語，誹謗我。彼，善實！不實取。彼何所因？無有彼，善實！一法，若如來、應、正遍知，無上正遍知證覺。",
  "若有人言『如來得阿耨多羅三藐三菩提』。須菩提，實無有法，佛得阿耨多羅三藐三菩提！",
  "善現，若如是說『如來應正等覺能證阿耨多羅三藐三菩提』者，當知此言為不真實！所以者何？善現，由彼謗我，起不實執！何以故？善現，無有少法，如來、應、正等覺能證阿耨多羅三藐三菩提！",
  "妙生，若言『如來證得無上正等覺』者，是為妄語！何以故？實無有法，如來證得無上正覺！",
  " yaḥ kaścit subhūte evaṃ vadet tathāgatena arhatā samyak-saṃbuddhenaanuttarā samyaksaṃbodhir abhisaṃbuddheti sa vitathaṃ vadedabhyācakṣīta māṃ sa subhūte asatodgṛhītena |tat kasya hetoḥ |nāsti subhūte sa kaścid dharmo yas tathāgatena anuttarāṃsamyaksaṃbodhim abhisaṃbuddhaḥ |",
  "ཡང་རབ་འབྱོར་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་ཟེར་ན། དེ་ལོག་པར་སྨྲ་བ་ཡིན་ནོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་མེད་པའི་ཕྱིར་རོ། །"
 ],
 "17.12": [
  "若，善實！如來法證覺說，若不彼中實不妄，彼故如來說：『一切法，佛法者。』",
  "須菩提，如來所得阿耨多羅三藐三菩提，於是中，無實無虛。是故如來說一切法皆是佛法！",
  "善現，如來現前等所證法、或所說法、或所思法，即於其中，非諦非妄。是故如來說一切法皆是佛法！",
  "妙生，如來所得正覺之法，此即非實非虛。是故佛說一切法者，即是佛法！",
  "yaś ca subhūte tathāgatena dharmo 'bhisaṃbuddho deśito vā tatra nasatyaṃ na mṛṣā | tasmāttathāgato bhāṣate sarvadharmā buddhadharmā iti|",
  "རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་ཆོས་གང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའམ། བསྟན་པ་དེ་ལ་བདེན་པའང་མེད། རྫུན་པ་ཡང་མེད་དོ། ། དེ་བས་ན་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་ཞེས་གསུངས་སོ། །"
 ],
 "17.13": [
  "彼何所因？一切法、一切法者，善實！一切彼非法，如來說；彼故，說名一切法者。",
  "須菩提，所言一切法者，即非一切法，是故名一切法！」",
  "善現，一切法一切法者，如來說非一切法，是故如來說名一切法一切法！」",
  "妙生，一切法一切法者，如來說為非法，是故如來說一切法者，即是佛法！」",
  "tat kasya hetoḥ | sarva-dharmā iti subhūte a-dharmās tathāgatenabhāṣitāḥ | tasmād ucyante sarvadharmā buddha-dharmā iti |",
  "རབ་འབྱོར་ཆོས་ཐམས་ཅད་ཅེས་བྱ་བ་ནི། དེ་དག་ཐམས་ཅད་ཆོས་མེད་པ་ཡིན་ཏེ། དེས་ན་ཆོས་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་ཞེས་བྱའོ། །"
 ],
 "17.14": [
  "譬如，善實！丈夫有具足身、大身。",
  "「須菩提，譬如人身長大。」",
  "佛告善現：「譬如士夫，具身大身。」",
  "「妙生，譬如丈夫，其身長大。」",
  "tadyathāpi nāma subhūte puruṣo bhaved upetakāyo mahākāyaḥ |",
  "རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་ཞིག་མིའི་ལུས་དང་ལྡན་ཞིང་ལུས་ཆེན་པོར་གྱུར་པ་བཞིན་ནོ། །"
 ],
 "17.15": [
  "命者善實言：「若彼，世尊！如來，丈夫說具足身、大身；非身，彼，世尊！如來說；彼故，說名足身、大身者。」",
  "須菩提言：「世尊，如來說人身長大，則為非大身，是名大身。」",
  "具壽善現即白佛言：「世尊，如來所說士夫具身大身，如來說為非身，是故說名具身大身。」",
  "妙生言：「世尊，如來說為大身者，即說為非身，是名大身。」",
  "āyuṣmān subhūtir āha | yo 'sau bhagavaṃs tathāgatena puruṣo bhāṣitaupetakāyo mahākāya ity akāyaḥ sa bhagavaṃs tathāgatena bhāṣitaḥ |tenocyata upetakāyo mahākāya iti |",
  "ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་གསོལ་པ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་སྐྱེས་བུ་མིའི་ལུས་དང་ལྡན་ཞིང་ལུས་ཆེན་པོ་ཞེས་གང་གསུངས་པ་དེ་དེ་བཞིན་གཤེགས་པས་ལུས་མ་མཆིས་པར་གསུངས་ཏེ། དེས་ན་ལུས་དང་ལྡན་ཞིང་ལུས་ཆེན་པོ་ཞེས་བགྱིའོ། །"
 ],
 "17.16": [
  "世尊言：「如是，如是！善實！如是，如是！若菩薩如是語：『有眾生般涅槃滅度我。』不彼菩薩名說應。",
  "「須菩提，菩薩亦如是！若作是言『我當滅度無量眾生』，則不名菩薩！",
  "佛言：「善現，如是、如是！若諸菩薩作如是言『我當滅度無量有情』，是則不應說名菩薩！",
  "佛告妙生：「如是、如是！若菩薩作是語『我當度眾生令寂滅』者，則不名菩薩！",
  "bhagavān āha | evam etat subhūte | yo bodhisattva evaṃ vaded ahaṃsattvān parinirvāpayiṣyāmīti na sa bodhisattva iti vaktavyaḥ |",
  " བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། ། དེ་བཞིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་གང་འདི་སྐད་དུ་བདག་གིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ་ཞེས་ཟེར་ན། དེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱའོ། །"
 ],
 "17.17": [
  "彼何所因？有，善實！有一法若菩薩名？",
  "何以故？須菩提，實無有法，名為菩薩！」",
  "何以故？善現，頗有少法，名菩薩不？」",
  "妙生，頗有少法，名菩薩不？」",
  "tatkasya hetoḥ | asti subhūte sa kaścid dharmo yo bodhisattvo nāma |",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ།"
 ],
 "17.18": [
  "善實言：「不如此，世尊！」。",
  "（缺譯）",
  "善現答言：「不也，世尊！無有少法，名為菩薩！」",
  "答言：「不爾，世尊！」",
  "subhūtir āha | no hīdaṃ bhagavan nāsti sa kaścid dharmo yo bodhisattvonāma |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །"
 ],
 "17.19": [
  "世尊言：「眾生、眾生者，善實！非眾生，彼，如來說；彼故，說名眾生者。",
  "（缺譯）",
  "佛告善現：「有情有情者，如來說非有情，故名有情。",
  "（缺譯）",
  "bhagavān āha | sattvāḥ sattvā iti subhūte asattvās te tathāgatena bhāṣitāstenocyate sattvā iti |",
  " （缺譯）"
 ],
 "17.20": [
  "彼故，如來說：『無我一切法，無眾生、無壽者、無長養者，無人一切法者。』",
  "是故佛說，『一切法無我、無人、無眾生、無壽者』。",
  "是故如來說，『一切法無有有情、無有命者、無有士夫、無有補特伽羅等』。",
  "妙生，是故如來說，『一切法無我、無眾生、無壽者、無更求趣』。",
  "tasmāt tathāgato bhāṣate nirātmānaḥ sarvadharmā nirjīvāniṣpoṣāniṣpudgalāḥ sarvadharmā iti |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བས་ན། དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་ནི་སེམས་ཅན་མེད་པ། སྲོག་མེད་པ་གང་ཟག་མེད་པའོ་ཞེས་གསུངས་སོ། །"
 ],
 "17.21": [
  "若，善實！菩薩如是語：『我佛土莊嚴成就。』彼亦如是不名說應。",
  "須菩提，若菩薩作是言：『我當莊嚴佛土』，則不名菩薩！",
  "善現，若諸菩薩作如是言：『我當成辦佛土功德莊嚴』，亦如是說。",
  "妙生，若有菩薩言：『我當成就佛土嚴勝佛土嚴勝』者，",
  "yaḥ subhūte bodhisattva evaṃ vaded ahaṃ kṣetra-vyūhān",
  "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་འདི་སྐད་དུ། བདག་གིས་ཞིང་བཀོད་པ་རྣམས་བསྒྲུབ་བོ་ཞེས་ཟེར་ན། དེ་ཡང་དེ་བཞིན་དུ་བརྗོད་པར་བྱའོ། །"
 ],
 "17.22": [
  "彼何所因？國土莊嚴、國土莊嚴者，善實！非莊嚴，彼，如來說；彼故，說名國土莊嚴者。",
  "何以故？如來說莊嚴佛土者，即非莊嚴，是名莊嚴。",
  "何以故？善現，佛土功德莊嚴佛土功德莊嚴者，如來說非莊嚴，是故如來說名佛土功德莊嚴佛土功德莊嚴。",
  "如來說為非是嚴勝，是故如來說為嚴勝。",
  "tatkasya hetoḥ | kṣetra-vyūhāḥ kṣetra-vyūhā iti subhūte 'vyūhās tetathāgatena bhāṣitāḥ | tenocyante kṣetra-vyūhā iti |",
  " དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཞིང་བཀོད་པ་རྣམས་ཞིང་བཀོད་པ་རྣམས་ཞེས་བྱ་བ་ནི། དེ་དག་བཀོད་པ་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཕྱིར་ཏེ། དེས་ན་ཞིང་བཀོད་པ་རྣམས་ཞེས་བྱའོ། །"
 ],
 "17.23": [
  "若，善實！菩薩摩訶薩無我法、無我法者信解，彼，如來、應、正遍知，菩薩摩訶薩名說。",
  "須菩提，若菩薩通達無我法者，如來說名真是菩薩！」",
  "善現，若諸菩薩於無我法、無我法深信解者，如來、應、正等覺說為菩薩、菩薩 ！」",
  "妙生，若有信解一切法無性、一切法無性者，如來說名真是菩薩、菩薩！」",
  "yaḥ subhūte bodhisattvo nirātmāno dharmā nirātmāno dharmā ityadhimucyate sa tathāgatena arhatā samyaksaṃbuddhena bodhisattvomahāsattva ity ākhyātaḥ ||17||",
  " རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་འདི་སྐད་དུ། ཆོས་རྣམས་ནི་བདག་མེད་པ་ཆོས་རྣམས་ནི་བདག་མེད་པའོ་ཞེས་མོས་པ་དེ་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས།བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བརྗོད་དོ། །"
 ],
 "18.1": [
  "「彼何意念？善實！有如來肉眼？」",
  "「須菩提，於意云何，如來有肉眼不？」",
  "佛告善現：「於汝意云何，如來等現有肉眼不？」",
  "「妙生，於汝意云何，如來有肉眼不？」",
  "bhagavān āha | tatkiṃ manyase subhūte saṃvidyate tathāgatasyamāṃsa-cakṣuḥ |",
  "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པ་ལ་ཤའི་སྤྱན་མངའ་སྙམ་མམ།"
 ],
 "18.2": [
  "善實言：「如是，如是！世尊！有如來肉眼。」",
  "「如是，世尊，如來有肉眼！」",
  "善現答言：「如是，世尊！如來等現有肉眼！」",
  "妙生言：「如是，世尊！如來有肉眼！」",
  "subhūtir āha | evam etad bhagavan saṃvidyate tathāgatasya māṃsa-cakṣuḥ|",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཤའི་སྤྱན་མངའོ། །"
 ],
 "18.3": [
  "世尊言：「彼何意念？善實！有如來天眼？」",
  "「須菩提，於意云何，如來有天眼不？」",
  "佛言：「善現，於汝意云何，如來等現有天眼不？」",
  "「如來有天眼不？」",
  "bhagavān āha | tatkiṃ manyase subhūte saṃvidyate tathāgatasya divyaṃcakṣuḥ |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པ་ལ་ལྷའི་སྤྱན་མངའ་སྙམ་མམ།"
 ],
 "18.4": [
  "善實言：「如是，如是！世尊！有如來天眼。」",
  "「如是，世尊！如來有天眼！」",
  "善現答言：「如是，世尊！如來等現有天眼！」",
  "「如是，世尊！如來有天眼！」",
  "subhūtir āha | evam etad bhagavan saṃvidyate tathāgatasya divyaṃ cakṣuḥ|",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ལྷའི་སྤྱན་མངའོ། །"
 ],
 "18.5": [
  "世尊言：「彼何意念？善實！有如來慧眼？」",
  "「須菩提，於意云何，如來有慧眼不？」",
  "佛言：「善現，於汝意云何，如來等現有慧眼不？」",
  "「如來有慧眼不？」",
  "bhagavān āha | tatkiṃ manyase subhūte saṃvidyate tathāgatasyaprajñā-cakṣuḥ |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། ། དེ་བཞིན་གཤེགས་པ་ལ་ཤེས་རབ་ཀྱི་སྤྱན་མངའ་སྙམ་མམ།"
 ],
 "18.6": [
  "善實言：「如是，如是！世尊！有如來慧眼。」",
  "「如是，世尊！如來有慧眼！」",
  "善現答言：「如是，世尊！如來等現有慧眼！」",
  "「如是，世尊！如來有慧眼！」",
  "subhūtir āha | evam etad bhagavan saṃvidyate tathāgatasya prajñā-cakṣuḥ|",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཤེས་རབ་ཀྱི་སྤྱན་མངའ་འོ།།"
 ],
 "18.7": [
  "世尊言：「彼何意念？善實！有如來法眼？」",
  "「須菩提，於意云何，如來有法眼不？」",
  "佛言：「善現，於汝意云何，如來等現有法眼不？」",
  "「如來有法眼不？」",
  "bhagavān āha | tatkiṃ manyase subhūte saṃvidyate tathāgatasyadharma-cakṣuḥ |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པ་ལ་ཆོས་ཀྱི་སྤྱན་མངའ་སྙམ་མམ།"
 ],
 "18.8": [
  "善實言：「如是，如是！世尊！有如來法眼。」",
  "「如是，世尊！如來有法眼！」",
  "善現答言：「如是，世尊！如來等現有法眼！」",
  "「如是，世尊！如來有法眼！」",
  "subhūtir āha | evam etad bhagavan saṃvidyate tathāgatasyadharma-cakṣuḥ |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཆོས་ཀྱི་སྤྱན་མངའོ། །"
 ],
 "18.9": [
  "世尊言：「彼何意念？善實！有如來佛眼？」",
  "「須菩提，於意云何，如來有佛眼不？」",
  "佛言：「善現，於汝意云何，如來等現有佛眼不？」",
  "「如來有佛眼不？」",
  "bhagavānāha | tatkiṃ manyase subhūte saṃvidyate tathāgatasyabuddha-cakṣuḥ | ",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པ་ལ་སངས་རྒྱས་ཀྱི་སྤྱན་མངའ་སྙམ་མམ།"
 ],
 "18.10": [
  "善實言：「如是，如是！世尊！有如來佛眼。」",
  "「如是，世尊！如來有佛眼！」",
  "善現答言：「如是，世尊！如來等現有佛眼！」",
  "「如是，世尊！如來有佛眼！」",
  "subhūtir āha | evam etad bhagavan saṃvidyate tathāgatasyabuddha-cakṣuḥ |",
  " རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་སངས་རྒྱས་ཀྱི་སྤྱན་མངའ་འོ། །"
 ],
 "18.11": [
  "世尊言：「善，善！善實！彼何意念？善實！所有恒伽大河沙，雖然彼沙，彼，如來說？」",
  "「須菩提，於意云何，恒河中所有沙，佛說是沙不？」",
  "佛告善現：「於汝意云何，乃至殑伽河中所有諸沙，如來說是沙不？」",
  "（缺譯）",
  "bhagavān āha | tatkiṃ manyase subhūte yāvatyo gaṅgāyāṃ mahā-nadyāṃvālukā api nu tā vālukās tathāgatena bhāṣitāḥ |",
  " （缺譯）"
 ],
 "18.12": [
  "善實言：「如是，如是！世尊！如是，如是！善逝！說彼如來彼沙。」",
  "「如是，世尊！如來說是沙！」",
  "善現答言：「如是，世尊！如是，善逝！如來說是沙！」",
  "（缺譯）",
  "subhūtir āha | evam etad bhagavan evam etat sugata bhāṣitās tathāgatenavālukāḥ |",
  " （缺譯）"
 ],
 "18.13": [
  "世尊言：「彼何意念？善實！所有恒伽大河沙，彼所有恒伽大河有，所有彼中沙，彼所有及世界有，多彼世界有？」",
  "「須菩提，於意云何，如一恒河中所有沙，有如是等恒河，是諸恒河所有沙數佛世界，如是寧為多不？」",
  "佛言：「善現，於汝意云何，乃至殑伽河中所有沙數，假使有如是等殑伽河，乃至是諸殑伽河中所有沙數，假使有如是等世界，是諸世界寧為多不？」",
  "「妙生，於汝意云何，如弶伽河中所有沙數，復有如是沙等弶伽河，隨諸河沙有爾所世界，是為多不？」",
  "bhagavān āha | tatkiṃ manyase subhūte yāvatyo gaṅgāyāṃ mahānadyāṃvālukās tāvatya eva gaṅgānadyo bhaveyuḥ tāsu yā vālukās tāvantaś calokadhātavo bhaveyuḥ kaccid bahavas te lokadhātavo bhaveyuḥ |",
  "བཅོམ་ལྡན་འདས་ཀྱི་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། གངྒཱའི་ཀླུང་གི་བྱེ་མ་ཇི་སྙེད་པ་གངྒཱའི་ཀླུང་ཡང་དེ་སྙེད་ཁོ་ནར་གྱུར་ལ། དེ་དག་གི་བྱེ་མ་དེ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གྱུར་ན། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་མང་བ་ཡིན་སྙམ་མམ།"
 ],
 "18.14": [
  "善實言：「多，世尊！多，善逝！彼世界有。」",
  "「甚多，世尊！」",
  "善現答言：「如是，世尊！如是，善逝！是諸世界，其數甚多！」",
  "妙生言：「甚多，世尊！」 ",
  "subhūtir āha | evam etad bhagavann evam etat sugata bahavas telokadhātavo bhaveyuḥ |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་མང་ལགས་སོ། །"
 ],
 "18.15": [
  "世尊言：「所有，善實！彼中世界中眾生，彼等我種種有心流注知。",
  "佛告須菩提：「爾所國土中所有眾生若干種心，如來悉知。",
  "佛言：「善現，乃至爾所諸世界中所有有情，彼諸有情各有種種，其心流注，我悉能知。",
  "「妙生，此世界中所有眾生種種性行，其心流轉，我悉了知。",
  "bhagavān āha | yāvantaḥ subhūte teṣu lokadhāteṣu sattvās teṣām ahaṃnānābhāvāṃ cittadhārāṃ prajānāmi |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་དེ་དག་གི་བསམ་བ་ཐ་དད་པའི་སེམས་ཀྱི་རྒྱུན་ངས་རབ་ཏུ་ཤེས་སོ། །"
 ],
 "18.16": [
  "彼何所因？心流注、心流注者，善實！非流注，此，如來說；彼故，說名心流注者。",
  "何以故？如來說諸心皆為非心，是名為心！",
  "何以故？善現，心流注心流注者，如來說非流注，是故如來說名心流注心流注！",
  "何以故？妙生，心陀羅尼者，如來說為無持，由無持故，心遂流轉！",
  "tatkasya hetoḥ | citta-dhārā citta-dhāreti subhūte adhāraiṣā tathāgatenabhāṣitā | tenocyate citta-dhāreti |",
  " དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སེམས་ཀྱི་རྒྱུན་སེམས་ཀྱི་རྒྱུན་ཞེས་བྱ་བ་ནི། དེ་རྒྱུན་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཕྱིར་ཏེ། དེས་ན་སེམས་ཀྱི་རྒྱུན་ཞེས་བྱའོ། །"
 ],
 "18.17": [
  "彼何所因？過去，善實！心不可得，未來心不可得，現在心不可得。",
  "所以者何？須菩提，過去心不可得、現在心不可得、未來心不可得！」",
  "所以者何？善現，過去心不可得、未來心不可得、現在心不可得！」",
  "何以故？妙生，過去心不可得、未來心不可得、現在心不可得！」",
  "tatkasya hetoḥ | atītaṃ subhūte cittaṃ nopalabhyate | anāgataṃ cittaṃnopalabhyate | pratyutpannaṃ cittaṃ nopalabhyate ||18||",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འདས་པའི་སེམས་ཀྱང་དམིགས་སུ་མེད། མ་འོངས་པའི་སེམས་ཀྱང་དམིགས་སུ་མེད། ད་ལྟར་བྱུང་བའི་སེམས་ཀྱང་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །"
 ],
 "19.1": [
  "「彼何意念？善實！若有善家子，若善家女，若三千大千世界七寶滿作已施與，雖然，彼善家子，若善家女，若彼緣，多福聚生？」",
  "「須菩提，於意云何，若有人滿三千大千世界七寶以用布施，是人以是因緣得福多不？」",
  "佛告善現：「於汝意云何，若善男子或善女人，以此三千大千世界盛滿七寶，奉施如來、應、正等覺，是善男子或善女人，由是因緣所生福聚寧為多不？」",
  "「妙生，於汝意云何，若人以滿三千大千世界七寶布施，是人得福多不？」",
  "tatkiṃ manyase subhūte yaḥ kaścit kulaputro vā kuladuhitā vevaṃtrisāhasramahāsāhasraṃ lokadhātuṃ sapta-ratna-paripūrṇaṃ kṛtvātathāgatebhyo 'rhadbhyaḥ samyaksaṃbuddhebhyo dānaṃ dadyād api nusa kulaputro vā kuladuhitā vā tato nidānaṃ bahu puṇya-skandhaṃprasunuyāt |",
  "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའ ི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ་སྦྱིན་པ་བྱིན་ན། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་གཞི་དེ་ལས་བསོད་ནམས་མང་དུ་བསྐྱེད་དམ།"
 ],
 "19.2": [
  "善實言：「多，世尊！多，善逝！」",
  "「如是，世尊！此人以是因緣得福甚多！」",
  "善現答言：「甚多，世尊！甚多，善逝！」",
  "妙生言：「甚多，世尊！」",
  "subhūtir āha | bahu bhagavan bahu sugata |",
  " རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས། མང་ལགས་སོ།། བདེ་བར་གཤེསག་པ། མང་ལགས་སོ།།"
 ],
 "19.3": [
  "世尊言：「如是，如是，善實！如是，如是！多。彼善家子，若善家女，若彼緣，多福聚生，無量、不可數。",
  "（缺譯）",
  "佛言：「善現，如是、如是！彼善男子或善女人，由此因緣所生福聚，其量甚多！",
  "（缺譯）",
  " bhagavān āha | evam etat subhūte evam etad bahu sa kulaputro vākuladuhitā vā tato nidānaṃ bahu puṇya-skandhaṃ prasunuyād |",
  " བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། ། དེ་དེ་བཞིན་ཏེ། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་གཞི་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་དུ་བསྐྱེད་དོ། །"
 ],
 "19.4": [
  "福聚、福聚者，善實！非聚，彼，如來說；彼故，說名福聚者。若復，善實！福聚有，不如來說福聚、福聚者。",
  "「須菩提，若福德有實，如來不說得福德多，以福德無故，如來說得福德多！」",
  "何以故？善現，若有福聚，如來不說福聚福聚！」",
  "妙生，若此福聚是福聚者，如來則不說為福聚福聚！」",
  "tatkasya hetoḥ | puṇya-skandhaḥ puṇya-skandha iti subhūte a-skandhaḥ satathāgatena bhāṣitaḥ | tenocyate puṇya-skandha iti | sacet punaḥ subhūtepuṇya-skandho 'bhaviṣyan na tathāgato 'bhāṣiṣyat puṇya-skandhaḥpuṇya-skandha iti ||19||",
  " ཡང་རབ་འབྱོར་གལ་ཏེ་བསོད་ནམས་ཀྱི་ཕུང་པོ་བསོད་ནམས་ཀྱི་ཕུང་པོར་གྱུར་པ་ན། བསོད་ནམས་ཀྱི་ཕུང་པོ་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཞེས་དེ་བཞིན་གཤེགས་པས་མི་གསུང་ངོ། །"
 ],
 "20.1": [
  "「彼何意念？善實！色身成就如來見應？」",
  "「須菩提，於意云何，佛可以具足色身見不？」",
  "佛告善現：「於汝意云何，可以色身圓實觀如來不？」",
  "「妙生，於汝意云何，可以色身圓滿觀如來不？」",
  "tat kiṃ manyase subhūte rūpa-kāya-pariniṣpattyā tathāgato draṣṭavyaḥ |",
  "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་བྱ་སྙམ་མམ།"
 ],
 "20.2": [
  "善實言：「不如此，世尊！非色身成就如來見應。",
  "「不也，世尊！如來不應以具足色身見！",
  "善現答言「不也，世尊！不可以色身圓實觀於如來！",
  "「不爾，世尊！不應以色身圓滿觀於如來！",
  "subhūtir āha | no hīdaṃ bhagavan na rūpa-kāya-pariniṣpattyā tathāgatodraṣṭavyaḥ |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། ། གཟུགས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བགྱི་ལགས་སོ། །"
 ],
 "20.3": [
  "彼何所因？色身成就、色身成就者，世尊！非成就，此，如來說；彼故，說名色身成就者。」",
  "何以故？如來說具足色身，即非具足色身，是名具足色身！」",
  "何以故？世尊色身圓實色身圓實者，如來說非圓實，是故如來說名色身圓實色身圓實！」",
  "何以故？色身圓滿色身圓滿者，如來說非圓滿，是故名為色身圓滿！」",
  "tatkasya hetoḥ | rūpa-kāya-pariniṣpattī rūpakāya-pariniṣpattir iti bhagavanapariniṣpattir eṣā tathāgatena bhāṣitā | tenocyate rūpakāya-pariniṣpattir iti|",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་གཟུགས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པ་ཞེས་བགྱི་བ་ནི། དེ་ཡོངས་སུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་གཟུགས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པ་ཞེས་བགྱིའོ། །"
 ],
 "20.4": [
  "世尊言：「彼何意念？善實！相具足如來見應？」",
  "「須菩提，於意云何，如來可以具足諸相見不？」",
  "佛告善現：「於汝意云何，可以諸相具足觀如來不？」",
  "「妙生，可以具相觀如來不？」",
  "bhagavān āha | tatkiṃ manyase subhūte lakṣaṇa-saṃpadā tathāgatodraṣṭavyaḥ |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། མཚན་ཕུན་སུམ་ཚŀགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་བྱ་སྙམ་མམ།"
 ],
 "20.5": [
  "善實言：「不如此，世尊！非相具足如來見應。",
  "「不也，世尊！如來不應以具足諸相見！",
  "善現答言：「不也，世尊！不可以諸相具足觀於如來！",
  "「不爾，世尊！不應以具相觀於如來！",
  "subhūtir āha | no hīdaṃ bhagavan na lakṣaṇa-saṃpadā tathāgatodraṣṭavyaḥ |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། ། མཚན་ཕུན་སུམ་ཚŀགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བགྱི་ལགས་སོ། །"
 ],
 "20.6": [
  "彼何所因？此，世尊！相具足，如來說；非相具足，如來說；彼故，說名相具足者。」",
  "何以故？如來說諸相具足，即非具足，是名諸相具足！」",
  "何以故？世尊諸相具足諸相具足者，如來說為非相具足，是故如來說名諸相具足諸相具足！」",
  "何以故？諸具相者，如來說非具相，是故如來說名具相！」",
  "tatkasya hetoḥ | yaiṣā bhagavaṃl lakṣaṇa-saṃpat tathāgatena bhāṣitāalakṣana-saṃpad eṣā tathāgatena bhāṣitā | tenocyate lakṣaṇa-saṃpad iti||20||",
  " དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་མཚན་ཕུན་སུམ་ཚŀགས་པ་གང་གསུངས་པ་དེ། མཚན་ཕུན་སུམ་ཚŀགས་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླང་དུ་སྟེ། དེས་ན་མཚན་ཕུན་སུམ་ཚŀགས་པ་ཞེས་བགྱིའོ། །"
 ],
 "21.1": [
  "世尊言：「彼何意念？善實！雖然，如來如是念：『我法說』？」",
  "（缺譯）",
  "佛告善現：「於汝意云何，如來頗作是念：『我當有所說法』耶？」",
  "「妙生，於汝意云何，如來作是念：『我說法』耶？」",
  "bhagavān āha | tatkiṃ manyase subhūte api nu tathāgatasyaivaṃ bhavatimayā dharmo deśita iti |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པས་འདི་སྙམ་དུ་ངས་ཆོས་བསྟན་ཏོ་ཞེས་དགོངས་སོ་སྙམ་ན།"
 ],
 "21.2": [
  "善實言：「不如此，世尊！不如來如是念：『我法說。』」",
  "（缺譯）",
  "（缺譯）",
  "（缺譯）",
  "subhūtir āha | no hīdaṃ bhagavan tathāgatasyaivaṃ bhavati mayā dharmodeśita iti |",
  " （缺譯）"
 ],
 "21.3": [
  "世尊言：「若我，善實！如是語：『如來法說。』誹謗我。彼，善實！不實取。",
  "「須菩提，汝勿謂如來作是念『我當有所說法』！莫作是念！何以故？若人言如來有所說法，即為謗佛！不能解我所說故！",
  "「善現，汝今勿當作如是觀！何以故？善現，若言如來有所說法，即為謗我，為非善取！",
  "「汝勿作是見！若言如來有所說法者，則為謗我！",
  "bhagavān āha | yaḥ subhūte evaṃ vadet tathāgatena dharmo deśita iti savitathaṃ vaded abhyācakṣīta māṃ sa subhūte 'satodgṛhītena |",
  "རབ་འབྱོར་དེ་དེ་ལྟར་མི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པས་གང་བསྟན་པའི་ཆོས་དེ་གང་ཡང་མེད་པའི་ཕྱིར་རོ། །རབ་འབྱོར་སུ་ཞིག་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པས་ཆོས་བསྟན་ཏོ་ཞེས་ཟེར་ན། རབ་འབྱོར་དེ་ནི་མེད་པ་དང་ལོག་པར་ཟིན་པས་ང་ལ་སྐུར་བར་འགྱུར་རོ། །"
 ],
 "21.4": [
  "彼何所因？法說、法說者，善實！無有法，若法說名可得。」",
  "須菩提，說法者，無法可說，是名說法！」",
  "何以故？善現，說法說法者，無法可得，故名說法！ 」",
  "何以故？言說法說法者，無法可說，是名說法！」",
  "tatkasya hetoḥ | dharma-deśanā dharma-deśaneti subhūte nāsti sa kaściddharmo yo dharma-deśanā nāmopalabhyate |",
  " དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཆོས་བསྟན་པ་ཞེས་བྱ་བ་ནི། གང་ཆོས་བསྟན་པ་ཆོས་བསྟན་པ་ཞེས་བྱ་བར་དམིགས་པར་འགྱུར་པའི་ཆོས་དེ་གང་ཡང་མེད་པའི་ཕྱིར་རོ། །"
 ],
 "21.5": [
  "爾時，命者善實，世尊邊如是言：「雖然，世尊！當有未來，頗有眾生，後時、後長時、後分五百，正法破壞時中，轉時中，若此如是色類法說，聞已信當有？」",
  "爾時，慧命須菩提白佛言：「世尊，頗有眾生，於未來世，聞說是法，生信心不？」",
  "爾時，具壽善現白佛言：「世尊，於當來世，後時、後分、後五百歲，正法將滅時分轉時，頗有有情聞說如是色類法已，能深信不？」",
  "妙生白佛言：「世尊，於當來世，頗有眾生，聞說是經，生信心不？」",
  "evam ukta āyuṣmān subhūtir bhagavantam etad avocat | asti bhagavankecit sattvā bhaviṣyanty anāgate 'dhvani paścime kāle paścime samayepaścimāyāṃ pañcaśatyāṃ saddharma-vipralope vartamāne ya imānevaṃrūpān dharmāñ śrutvā abhiśraddhāsyanti |",
  " དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་མ་འོངས་པའི་དུས་ན། སེམས་ཅན་གང་དག་འདི་ལྟ་བུའི་ཆོས་བཤད་པ་འདི་ཐོས་ནས། མངོན་པར་ཡིད་ཆེས་པར་འགྱུར་བ་འབྱུང་བ་ལྟ་མཆིས་ལགས་སམ།"
 ],
 "21.6": [
  "世尊言：「不彼，善實！眾生，非不眾生。",
  "佛言：「須菩提，彼非眾生，非不眾生！",
  "佛言：「善現，彼非有情，非不有情！",
  "佛告妙生：「有生信者，彼非眾生，非非眾生！",
  "bhagavān āha | na te subhūte sattvā nāsattvāḥ |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དག་ནི་སེམས་ཅན་ཡང་མ་ཡིན། སེམས་ཅན་མེད་པ་ཡང་མ་ཡིན་ནོ། །"
 ],
 "21.7": [
  "彼何所因？眾生、眾生者，善實！一切彼非眾生，彼，如來說；彼故，說名眾生者。",
  "何以故？須菩提，眾生眾生者，如來說非眾生，是名眾生！」",
  "何以故？善現，一切有情者，如來說非有情，故名一切有情！」",
  "何以故？眾生眾生者，如來說非眾生，是名眾生！」",
  "tatkasya hetoḥ | sattvāḥ sattvā iti subhūte sarve te subhūte asattvāstathāgatena bhāṣitāḥ | tenocyante sattvā iti ||21||",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སེམས་ཅན་རྣམས་ཞེས་བྱ་བ་ནི། དེ་བཞིན་གཤེགས་པས་དེ་དག་སེམས་ཅན་མེད་པར་གསུངས་པའི་ཕྱིར་ཏེ། དེ་བས་ན་སེམས་ཅན་རྣམས་ཞེས་བྱའོ། །"
 ],
 "22.1": [
  "彼何意念？善實！雖然，有法若如來無上正遍知證覺？",
  "(缺譯)",
  "佛告善現∶「於汝意云何，頗有少法，如來、應、正等覺現證無上正等菩提耶？」",
  "「妙生！於汝意云何，佛得無上正等覺時，頗有少法所證不？」 ",
  "tatkiṃ manyase subhūte api nv asti sa kaścid dharmo yas tathāgatenaanuttarāṃ samyaksaṃbodhim abhisaṃbuddhaḥ |",
  "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ།"
 ],
 "22.2": [
  "命者善實言：「無有彼，世尊！有法若如來無上正遍知。」",
  "須菩提白佛言：「世尊，佛得阿耨多羅三藐三菩提，為無所得耶？」",
  "具壽善現白佛言：「世尊，如我解佛所說義者，無有少法，如來、應、正等覺現證無上正等菩提！」",
  "妙生言：「實無有法，是佛所證！」",
  " āyuṣmān subhūtir āha | no hīdaṃ bhagavan nāsti sa bhagavan kaściddharmo yas tathāgatena anuttarāṃ samyaksaṃbodhim abhisaṃbuddhaḥ |",
  "ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་ལགས་སོ། །"
 ],
 "22.3": [
  "世尊言：「如是，如是！善實！如是，如是！微小彼中法無有、不可得，彼故說名無上正遍知者。",
  "「如是、如是！須菩提，我於阿耨多羅三藐三菩提，乃至無有少法可得，是名阿耨多羅三藐三菩提！",
  "佛言：「善現，如是、如是！於中少法無有、無得，故名無上正等菩提！",
  "佛告妙生：「如是、如是！此中無有少法可得，故名無上正等菩提！",
  "bhagavān āha | evam etat subhūte evam etad aṇur api tatra dharmo nasaṃvidyate nopalabhyate | tenocyate 'nuttarā samyaksaṃbodhir iti ||22||",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། ། དེ་དེ་བཞིན་ཏེ། དེ་ལ་ཆོས་ཅུང་ཟད་ཀྱང་མི་དམིགས་ཤིད་མེད་དེ། དེས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཅེས་བྱའོ།།"
 ],
 "23.1": [
  "雖然復次時，善實！平等正法，彼不中有不平等，彼故說名無上正遍知者。",
  "復次，須菩提，是法平等，無有高下，是名阿耨多羅三藐三菩提！",
  "復次，善現，是法平等，於其中間，無不平等，故名無上正等菩提！",
  "妙生，是法平等，無有高下，故名無上正等菩提！",
  "api tu khalu punaḥ subhūte samaḥ sa dharmo na tatra kaścid viṣamaḥ |tenocyate 'nuttarā samyaksaṃbodhir iti |",
  "ཡང་རབ་འབྱོར་ཆོས་དེ་ནི་མཉམ་པ་སྟེ། དེ་ལ་མི་མཉམ་པ་དང་མཉམ་པ་གང་ཡང་མེད་པས། དེས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཅེས་བྱའོ། །"
 ],
 "23.2": [
  "無我故、無壽故、無眾生故、無人故，平等。無上正遍知，一切善法證覺。",
  "以無我、無人、無眾生、無壽者，修一切善法，則得阿耨多羅三藐三菩提！",
  "以無我性、無有情性、無命者性、無士夫性、無補特伽羅等性平等故，名無上正等菩提！一切善法無不現證、一切善法無不妙覺 ！",
  "以無我、無眾生、無壽者、無更求趣性，其性平等，故名無上正等菩提！一切善法皆正覺了，故名無上正等正覺！",
  "nirātmatvena niḥsattvatvena nirjīvatvena niṣpudgalatvena samā sānuttarāsamyaksaṃbodhiḥ sarvaiḥ kuśalair dharmair abhisaṃbudhyate |",
  "བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དེ་ནི་བདག་མེད་པ་དང༌། སེམས་ཅན་མེད་པ་དང༌། སྲོག་མེད་པ་དང༌། གང་ཟག་མེད་པར་མཉམ་པ་སྟེ། དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱིས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །"
 ],
 "23.3": [
  "善法、善法者，善實！非法，如是彼，如來說；彼故，說名善法者。",
  "須菩提，所言善法者，如來說非善法，是名善法！",
  "善現，善法善法者，如來一切說為非法，是故如來說名善法善法！",
  "妙生，善法者，如來說為非法，故名善法！",
  "tat kasya hetoḥ | kuśalā dharmāḥ kuśalā dharmā iti subhūte adharmāścaiva te tathāgatena bhāṣitāḥ | tenocyante kuśalā dharmā iti ||23||",
  "རབ་འབྱོར་དགེ་བའི་ཆོས་རྣམས་ཞེས་བྱ་བ་ནི། དེ་དག་ཆོས་མེད་པ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ།དེས་ན་དགེ་བའི་ཆོས་རྣམས་ཞེས་བྱའོ། །"
 ],
 "24.1": [
  "若復，善實！所有三千大千世界須彌山王，彼所有聚七寶普散，如來、應、等正遍知施與。",
  "須菩提，若三千大千世界中所有諸須彌山王，如是等七寶聚，有人持用布施；",
  "復次，善現，若善男子或善女人集七寶聚，量等三千大千世界其中所有妙高山王，持用布施；",
  "妙生，若三千大千世界中所有諸妙高山王，如是等七寶聚，有人持用布施；",
  "yaśca khalu punaḥ subhūte strī vā puruṣo vā yāvantastrisāhasramahāsāhasre lokadhātau sumeravaḥ parvata-rājānas tāvato rāśīnsaptānāṃ ratnānām abhisaṃhṛtya tathāgatebhyo 'rhadbhyaḥsamyaksaṃbuddhebhyo dānaṃ dadyāt|",
  " ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའ ི་འཇིག་རྟེན་གྱི་ཁམས་ན་རིའི་རྒྱལ་པོ་རི་རབ་དག་ཇི་སྙད་ཡོད་པ་དེ་ཙམ་གྱི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཕུང་པོ་མངོན་པར་བསྡུས་ཏེ། སྦྱིན་པ་བྱིན་པ་བས།"
 ],
 "24.2": [
  "若此智慧彼岸到，乃至四句等偈，受已，為他等分別，此，善實！福聚，彼前者福聚，百上亦數不及，千上亦，百千上亦，俱致百千上亦，俱致那由他百千上亦，僧企耶亦，迦羅亦，算亦，譬喻亦，憂波泥奢亦，乃至譬喻亦不及。",
  "若人以此般若波羅蜜經乃至四句偈等，受持、讀誦、為他人說，於前福德，百分不及一、百千萬億分、乃至算數譬喻所不能及！」",
  "若善男子或善女人，於此般若波羅蜜多經中乃至四句伽他，受持、讀誦、究竟通利，及廣為他宣說開示、如理作意。善現！前說福聚於此福聚，百分計之所不能及，如是千分、若百千分、若俱胝百千分、若俱胝那庾多百千分、若數分、若計分、若算分、若喻分、若烏波尼殺曇分亦不能及！」",
  "若復有人於此經中乃至一四句頌，若自受持及為他說。以前福聚比此福聚，假令分此以為百分，彼亦不能及一分，或千分億分、算分、勢分、數分、因分，乃至譬喻亦不能及一！」",
  "yaś ca kulaputro vā kuladuhitā vetaḥ prajñāpāramitāyā dharma-paryāyādantaśaś catuṣpādikām api gāthām udgṛhya parebhyo deśayed asya subhūtepuṇyaskandhasya asau paurvakaḥ puṇya-skandhaḥ śatatamīm api kalāṃnopaiti yāvad upaniṣadam api na kṣamate ||24||",
  " གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལས་ཐ་ན་ཚིག་བཞི་བའི་ཚིགས་སུ་བཅད་པ་གཅིག་ཙམ་བཟུང་ནས་གཞན་དག་ལ་ཡང་རག་པར་བསྟན་ན། རབ་འབྱོར་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདི་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མ་དེས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་ཕོད་བ་ནས་རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ། །"
 ],
 "25.1": [
  "彼何意念？善實！雖然，如來如是念：『我眾生度脫』？不，復彼，善實！如是見應。",
  "「須菩提，於意云何？汝等勿謂如來作是念『我當度眾生』！須菩提，莫作是念！",
  "佛告善現：「於汝意云何，如來頗作是念『我當度脫諸有情』耶？善現，汝今勿當作如是觀！",
  "「妙生，於汝意云何，如來度眾生不？汝莫作是見『如來度眾生』！",
  "tatkiṃ manyase subhūte api nu tathāgatasyaivaṃ bhavati mayā sattvāḥparimocitā iti | na khalu punaḥ subhūta evaṃ draṣṭavyam |",
  "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པས་འདི་སྙམ་དུ་ངས་སེམས་ཅན་རྣམས་བཀྲོལ་ལོ་ཞེས་དགོངས་སོ་སྙམ་ན། རབ་འབྱོར་དེ་ལྟར་མི་བལྟའོ། །"
 ],
 "25.2": [
  "彼何所因？有無，善實！無有一眾生若如來度脫。若復，善實！有，如是眾生有，若彼如來度脫。彼如是，如來我取有，眾生取、壽取、人取有。",
  "何以故？實無有眾生如來度者，若有眾生如來度者，如來則有我、人、眾生、壽者！",
  "何以故？善現，無少有情如來度者！善現，若有有情如來度者，如來即應有其我執、有有情執、有命者執、有士夫執、有補特伽羅等執！",
  "何以故？曾無有一眾生是如來度者！若有眾生是如來度者，如來則有我見、眾生見、壽者見、更求趣見！",
  "tatkasya hetoḥ | nāsti subhūte kaścit sattvo yas tathāgatena parimocitaḥ |yadi punaḥ subhūte kaścit sattvo 'bhaviṣyad yas tathāgatena parimocitaḥsyāt sa eva tathāgatasya ātmagrāho 'bhaviṣyat sattva-grāho jīva-grāhaḥpudgala-grāho 'bhaviṣyat |",
  " དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་གང་བཀྲོལ་བའི་སེམས་ཅན་དེ་དེག་གང་ཡང་མེད་པའི་ཕྱིར་རོ། ། རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་གང་ལ་ལ་ཞིག་བཀྲོལ་བར་གྱུར་ན། དེ་ཉིད་དེ་བཞིན་གཤེགས་པས་བདག་ཏུ་འཛིན་པར་འགྱུར། སེམས་ཅན་དུ་འཛིན་པ་དང༌། སྲོག་ཏུ་འཛིན་པ་དང༌།གང་བྲག་ཏུ་འཛིན་པར་འགྱུར་རོ། །"
 ],
 "25.3": [
  "我取、我取者，善實！非取，此，如來說；彼小兒凡夫生取。",
  "須菩提，如來說有我者，則非有我，而凡夫之人，以為有我！",
  "善現，我等執者，如來說為非執，故名我等執，而諸愚夫異生，強有此執！",
  "妙生，我等執者，如來說為非執，而諸愚夫，妄為此執！",
  "ātma-grāha iti subhūte agrāha eṣa tathāgatena bhāṣitaḥ | sa cabālapṛthagjanair udgṛhītaḥ |",
  "རབ་འབྱོར་བདག་ཏུ་འཛིན་ཅེས་བྱ་བ་ནི། འཛིན་པར་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ན། དེ་ཡང་བྱིས་པ་སོ་སོའ ི་སྐྱེ་བོ་རྣམས་ཀྱིས་གཟུང་ངོ། །"
 ],
 "25.4": [
  "小兒凡夫生、小兒凡夫生者，善實！非生，彼，如來說；彼故，說名小兒凡夫生者。",
  "須菩提，凡夫者，如來說則非凡夫！」",
  "善現，愚夫異生者，如來說為非生，故名愚夫異生！」",
  "妙生，愚夫眾生，如來說為非生，故名愚夫眾生！」",
  "bālapṛthag-janā iti subhūte a-janā eva te tathāgatena bhāṣitāḥ |tenocyante bālapṛthagjanā iti ||25||",
  "རབ་འབྱོར་བྱིས་པ་སོ་སོའ ི་སྐྱེ་བོ་རྣམས་ཞེས་བྱ་བ་ནི། དེ་དག་སྐྱེ་བོ་མེད་པ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། དེས་ན་བྱིས་པ་སོ་སོའ ི་སྐྱེ་བོ་རྣམས་ཞེས་བྱའོ།"
 ],
 "26.1": [
  "彼何意念？善實！相具足如來見應？。",
  "「須菩提，於意云何，可以三十二相觀如來不？」",
  "佛告善現：「於汝意云何，可以諸相具足觀如來不？」",
  "「妙生，於汝意云何，應以具相觀如來不？」",
  "tatkiṃ manyase subhūte lakṣaṇa-saṃpadā tathāgato draṣṭavyaḥ |",
  "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། མཚན་ཕུན་གསུམ་ཚŀགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་བྱ་སྙམ་མམ།"
 ],
 "26.2": [
  "善實言：「不如此，世尊！如我，世尊說義解我，不相具足如來見應。」",
  "須菩提言：「如是、如是，以三十二相觀如來。」",
  "善現答言：「如我解佛所說義者，不應以諸相具足觀於如來！」",
  "「不爾，世尊！不應以具相觀於如來！」",
  "subhūtir āha | no hīdaṃ bhagavan | yathā ahaṃ bhagavato bhāṣitasyaartham ājānāmi na lakṣaṇa-saṃpadā tathāgato draṣṭavyaḥ |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། ། མཚན་ཕུན་སུམ་ཚŀགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བགྱི་ལགས་སོ།"
 ],
 "26.3": [
  "世尊言：「善，善！善實！如是，如是！善實！如如語汝，不相具足如來見應。彼何所因？彼復，善實！相具足如來見應；有彼王轉輪，如來有；彼故，不相具足如來見應。此相非相故，如來見應。」",
  "佛言：「須菩提，若以三十二相觀如來者，轉輪聖王則是如來。」",
  "佛言：「善現，善哉、善哉，如是、如是！如汝所說，『不應以諸相具足觀於如來。』善現，若以諸相具足觀如來者，轉輪聖王應是如來。是故，不應以諸相具足觀於如來，如是應以諸相非相觀於如來！」",
  "「妙生，若以具相觀如來者，轉輪聖王應是如來。是故，不應以具相觀於如來，應以諸相非相觀於如來！」",
  "bhagavān āha | sādhu sādhu subhūte evam etat subhūte evam etad yathāvadasi | na lakṣaṇa-saṃpadā tathāgato draṣṭavyaḥ | tatkasya hetoḥ | sacetpunaḥ subhūte lakṣaṇa-saṃpadā tathāgato draṣṭavyo 'bhaviṣyad rājā-apicakravartī tathāgato 'bhaviṣyat | tasmānna lakṣaṇasaṃpadā tathāgatodraṣṭavyaḥ |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དེ་བཞིན་ནོ།། དེ་དེ་བཞིན་ཏེ། མཚན་ཕུན་སུམ་ཚŀགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བྱ་སྟེ། རབ་འབྱོར་གལ་ཏེ་མཚན་ཕུན་སུམ་ཚŀགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་འགྱུར་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡང་དེ་བཞིན་གཤེགས་པར་འགྱུར་ཏེ། དེ་བས་ན་མཚན་ཕུན་སུམ་ཚŀགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བྱའོ། །"
 ],
 "26.4": [
  "爾時，命者善實世尊邊如是言：「如我，世尊！世尊說義解我，不相具足如來見應。」",
  "須菩提白佛言：「世尊，如我解佛所說義，不應以三十二相觀如來。」",
  "（缺譯）",
  "（缺譯）",
  "āyuṣmān subhūtir bhagavantametadavocat | yathāhaṃ bhagavatobhāṣitasya artham ājānāmi na lakṣaṇa-saṃpadā tathāgato draṣṭavyaḥ |",
  "དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་བདག་གིས་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་བ་ལྟར་ན། མཚན་ཕུན་སུམ་ཚŀགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བགྱི་ལགས་སོ། །"
 ],
 "26.5": [
  "爾時，世尊彼時此伽陀說：",
  "爾時，世尊而說偈言：",
  "爾時，世尊而說頌曰：",
  "爾時，世尊而說頌曰：",
  "atha khalu bhagavāṃs tasyāṃ velāyām ime gāthe abhāṣata |",
  "དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚĲ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །"
 ],
 "26.6": [
  "若我色見，若我聲求，邪解脫行，不我見彼。",
  "(缺譯)",
  "「諸以色觀我、以音聲尋我，彼生履邪斷，不能當見我。",
  "「若以色見我、以音聲求我，是人起邪觀，不能當見我。",
  " ye māṃ rūpeṇa cādrākṣur ye māṃ ghoṣeṇa cānvaguḥ |mithyā-prahāṇa-prasṛtā na māṃ drakṣyanti te janāḥ ||1||",
  "གང་དག་ང་ལ་གཟུགས་སུ་མཐོང༌། ། གང་དག་ང་ལ་སྒྲར་ཤེས་པ། ། ལོག་པའི་ལམ་དུ་ཞུགས་པ་སྟེ། ། སྐྱེ་བོ་དེ་དག་ང་མི་མཐོང༌།།"
 ],
 "26.7": [
  "法體佛見應，法身彼如來，法體及不識，故彼不能知。",
  "應觀佛法性，即導師法身，法性非所識，故彼不能了。」",
  "應觀佛法性，即導師法身，法性非所識，故彼不能了。」",
  "dharmato buddho draṣṭavyo dharmakāyā hi nāyakāḥ |dharmatā ca na vijñeyā na sā śakyā vijānitum ||2||",
  "སངས་རྒྱས་རྣམས་ནི་ཆོས་ཉིད་ལྟ། ། འདྲེན་པ་རྣམས་ནི་ཆོས་ཀྱི་སྐུ། ། ཆོས་ཉིད་ཤེས་པར་བྱ་མིན་པས། ། དེ་ནི་རྣམ་པར་ཤེས་མི་ནུས། །"
 ],
 "27.1": [
  "彼何意念？善實！相具足，如來無上正遍知證覺？",
  "「須菩提，汝若作是念『如來不以具足相故，得阿耨多羅三藐三菩提』。",
  "佛告善現：「於汝意云何，如來、應、正等覺以諸相具足現證無上正等覺耶？",
  "「妙生，諸有發趣菩薩乘者，其所有法是斷滅不？",
  "tatkiṃ manyase subhūte lakṣaṇa-saṃpadā tathāgatena anuttarāsamyaksaṃbodhir abhisaṃbuddhā |",
  "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། མཚན་ཕུན་སུམ་ཚŀགས་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་སྙམ་དུ་འཛིན་ན།"
 ],
 "27.2": [
  "不，善實！相具足，如來無上正不，復彼，善實！如是見應。彼何所因？遍知證覺。",
  "須菩提，莫作是念！如來不以具足相故，得阿耨多羅三藐三菩提！",
  "善現，汝今勿當作如是觀！何以故？善現，如來、應、正等覺不以諸相具足現證無上正等菩提！",
  "汝莫作是見！何以故？",
  "na khalu punas te subhūte evaṃ draṣṭavyam | tatkasya hetoḥ | na hi subhūtelakṣaṇa-saṃpadā tathāgatena anuttarā samyaksaṃbodhir abhisaṃbuddhāsyāt |",
  "རབ་འབྱོར་ཁྱོད་ཀྱིས་དེ་ལྟར་བལྟ་བར་མི་བྱ་སྟེ། རབ་འབྱོར་མཚན་ཕུན་སུམ་ཚŀགས་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་མེད་དོ། །"
 ],
 "27.3": [
  "復時，彼，善實！有如是語：『菩薩乘發行，有法破滅，施設斷。』不，復，善實！如是見應。",
  "須菩提，若作是念『發阿耨多羅三藐三菩提者，說諸法斷滅相』，莫作是念！",
  "復次，善現，如是發趣菩薩乘者，頗施設少法若壞、若斷耶？善現，汝今勿當作如是觀！",
  "（缺譯）",
  " na khalu punas te subhūte kaścid evaṃ vadetbodhisattva-yāna-saṁprasthitaiḥ kasyacid dharmasya vināśaḥ prajñaptaucchedo veti na khalu punas te subhūte evaṃ draṣṭavyam |",
  "རབ་འབྱོར་ཁྱོད་འདི་སྙམ་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས། ཆོས་གང་ལ་ལ་ཞིག་རྣམ་པར་ཤིག་པའམ། ཆད་པར་བཏགས་པའོ་སྙམ་དུ་འཛིན་ན། རབ་འབྱོར་དེ་དེ་ལྟར་བལྟ་བར་མི་བྱ་སྟེ།"
 ],
 "27.4": [
  "彼何所因？不菩薩乘發行有法破滅，施設不斷。",
  "何以故？發阿耨多羅三藐三菩提心者，於法不說斷滅相！",
  "諸有發趣菩薩乘者，終不施設少法若壞、若斷！",
  "趣菩薩乘者，其法不失！",
  " tatkasya hetoḥ |na bodhisattva-yāna-saṃprasthitaiḥ kasyacid dharmasyavināśaḥ prajñapto nocchedaḥ | ",
  "བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས། ཆོས་གང་ཡང་རྣམ་པར་བཤིག་པའམ།ཆད་པར་བཏགས་པ་མེད་དོ། །"
 ],
 "28.1": [
  "若復，善實！善家子，若善家女，若恒伽河沙等世界七寶滿作已施與。",
  "須菩提，若菩薩以滿恒河沙等世界七寶布施；",
  "復次，善現，若善男子或善女人以殑伽河沙等世界盛滿七寶，奉施如來、應、正等覺；",
  "妙生，若有男子女人，以滿弶伽河沙世界七寶布施；",
  " yaś ca khalu punaḥ subhūte kulaputro vā kuladuhitā vāgavgānadī-vālukā-samāṃl lokadhātūn sapta-ratna-paripūrṇāṃ kṛtvātathāgatebhyo 'rhadbhyaḥ samyaksaṃbuddhebhyo dānaṃ dadyād",
  " ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ་སྦྱིན་པ་བྱིན་པ་བས།"
 ],
 "28.2": [
  "若菩薩摩訶薩無我、無生中，法中忍得。此如是，彼緣，多過福聚生。",
  "若復有人知一切法無我，得成於忍，此菩薩勝前菩薩所得功德！",
  "若有菩薩於諸無我、無生法中，獲得堪忍，由是因緣所生福聚， 甚多於彼！",
  "若復有人，於無我理、不生法中，得忍解者，所生福聚極多於彼，無量無數！",
  " yaś ca bodhisattvo nirātmakeṣv anutpattikeṣu dharmeṣu kṣāntiṃpratilabhate ayam eva tato nidānaṃ bahutaraṃ puṇyaskandhaṃ prasavedaprameyam asaṃkhyeyam |",
  "བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བདག་མེད་ཅིང་སྐྱེ་བ་མེད་པ་ལ་བཟོད་པ་ཐོབ་ན།དེ་ཉིད་གཞི་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་དོ། །"
 ],
 "28.3": [
  "不，復，善實！菩薩福聚取應。",
  "須菩提，以諸菩薩不受福德故。」",
  "復次，善現，菩薩不應攝受福聚！」",
  "妙生，菩薩不應取其福聚！」",
  "na khalu punaḥ subhūte bodhisattvena mahāsattvena puṇyaskandhaḥparigrahītavyaḥ |",
  "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་གཟུང་བར་མི་བྱའོ། །"
 ],
 "28.4": [
  "命者善實言：「不，世尊！菩薩福聚取應？」",
  "須菩提白佛言：「世尊，云何菩薩不受福德？」",
  "具壽善現即白佛言：「世尊，云何菩薩不應攝受福聚？」",
  "妙生言：「菩薩豈不取福聚耶？」",
  "āyuṣmān subhūtir āha | nanu bhagavan bodhisattvena puṇyaskandhaḥparigrahītavyaḥ |",
  "ཚĲ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་གཟུང་བར་མི་བགྱི་ལགས་སམ།"
 ],
 "28.5": [
  "世尊言：「取應，善實！不取應，彼故說名取應。",
  "「須菩提，菩薩所作福德不應貪著，是故說不受福德。",
  "佛言：「善現，所應攝受，不應攝受，是故說名所應攝受。",
  "佛告妙生∶「是應正取，不應越取，是故說取。 ",
  " bhagavān āha | parigrahītavyaḥ subhūte nodgrahītavyaḥ | tenocyateparigrahītavya iti ||28||",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཡོངས་སུ་གཟུང་མོད་ཀྱིས། ལོག་པར་མི་བཟུང་སྟེ་དེས་ན་ཡོངས་སུ་གཟུང་བ་ཞེས་བྱའོ། །"
 ],
 "29.1": [
  "雖然復次時，善實！若有如是語：『如來去、若不去、若住、若坐、若臥、若如法。』不我，善實！說義解。",
  "須菩提，若有人言『如來若來、若去、若坐、若臥』，是人不解我所說義！",
  "復次，善現，若有說言『如來若去、若來、若住、若坐、若臥』，是人不解我所說義！",
  "妙生，如有說言『如來若來、若去、若坐、若臥』者，是人不解我所說義！",
  "api tu khalu punaḥ subhūte yaḥ kaścid evaṃ vadet tathāgato gacchati vāāgacchati vā tiṣṭhati vā niṣīdati vā śayyāṃ vā kalpayati na me subhūte sabhāṣitasya artham ājānāti |",
  "ཡང་རབ་འབྱོར་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ། དེ་བཞིན་གཤེགས་པ་བཞུད་དམ། བྱོན་ཏམ། བཞེངས་སམ།བཞུགས་སམ། མནལ་བར་མཛད་དོ་ཞེས་ཟེར་ན། དེས་ངས་བཤད་པའི་དོན་མི་ཤེས་སོ། །"
 ],
 "29.2": [
  "彼何所因？如來者，善實！說名無所去、無所來，彼故說名如來、應、正遍知者。",
  "何以故？如來者，無所從來，亦無所去，故名如來！",
  "何以故？善現，言如來者，即是真實、真如增語，都無所去，無所從來，故名如來、應、正等覺！",
  "何以故？妙生，都無去來，故名如來！",
  "tatkasya hetoḥ | tathāgata iti subhūta ucyate na kvacidgato na kutaścidāgataḥ | tenocyate tathāgato 'rhan samyaksaṃbuddha iti ||29||",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་ནི། གར་ཡང་མ་བཞུད། གང་ནས་ཀྱང་མ་བྱོན་པའི་ཕྱིར་ཏེ། དེས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱའོ། །"
 ],
 "30.1": [
  "若復，善實！善家子，若善家女，若所有三千大千世界地塵，彼如是色類墨作已，乃至如是不可數，譬如最小聚。彼何意念？善實！雖然，彼多最小聚有？",
  "須菩提，若善男子、善女人，以三千大千世界碎為微塵。於意云何，是微塵眾寧為多不？」",
  "復次，善現，若善男子或善女人，乃至三千大千世界大地極微塵量等世界，即以如是無數世界色像為墨如極微聚。善現，於汝意云何，是極微聚寧為多不？」",
  "妙生，若有男子女人以三千大千世界土地碎為墨塵。妙生，於汝意云何，是極微聚寧為多不？」 ",
  "yaś ca khalu punaḥ subhūte kulaputro vā kuladuhitā vā yāvantastrisāhasra-mahāsāhasre lokadhātau pṛthivī-rajāṃsi tāvatāṃ lokadhātūnāmevaṃrūpaṃ maṣiṃ kuryāt yāvad evam asaṃkhyeyena vīryeṇa tadyathāpināma paramāṇu-saṃcayaḥ tat kiṃ manyase subhūte api nu bahuḥ saparamāṇu-saṃcayo bhavet |",
  "ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའ ི་འཇིག་རྟེན་གྱི་ཁམས་ན་སའི་རྡུལ་ཇི་སྙེད་ཡོད་པ་དེ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་རྡུལ་ཕྲ་རབ་ཀྱི་ཚŀགས་བཞིན་དུ་ཕྱེ་མར་བྱས་ན། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། རྡུལ་ཕྲ་རབ་ཀྱི་ཚŀགས་དེ་མང་བ་ཡིན་སྙམ་མམ།"
 ],
 "30.2": [
  "善實言：如是，如是！世尊！",
  "「甚多，世尊！",
  "善現答言：「是極微聚甚多，世尊，甚多，善逝！",
  "妙生言：「甚多，世尊！",
  "subhūtir āha | evam etad bhagavann evam etat sugata | bahuḥ saparamāṇu-saṃcayo bhavet |",
  " རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། རྡུལ་ཕྲ་རབ་ཀྱི་ཚŀགས་དེ་མང་བ་ལགས་སོ། །"
 ],
 "30.3": [
  "若彼最小聚有。彼何所因？彼，世尊！聚有，不世尊說最小聚者。",
  "何以故？若是微塵眾實有者，佛則不說是微塵眾！",
  "何以故？世尊，若極微聚是實有者，佛不應說為極微聚！",
  "何以故？若聚性是實者，如來不說為極微聚極微聚！",
  "tatkasya hetoḥ | saced bhagavan bahuḥ paramāṇu-saṃcayo 'bhaviṣyat nabhagavān avakṣyat paramāṇu-saṃcaya iti |",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་གལ་ཏེ་རྡུལ་ཕྲ་རབ་ཀྱི་ཚŀགས་ཤིག་མཆིས་པར་གྱུར་ན། བཅོམ་ལྡན་འདས་ཀྱིས་རྡུལ་ཕྲ་རབ་ཀྱི་ཚŀགས་ཞེས་བཀའ་མི་སྩོལ་བའི་སླད་དུའོ། །"
 ],
 "30.4": [
  "彼何所因？若彼，世尊！最小聚說；非聚，彼，如來說；彼故，說名最小聚者。",
  "所以者何？佛說微塵眾，則非微塵眾，是名微塵眾！",
  "所以者何？如來說極微聚，即為非聚，故名極微聚！",
  "何以故？極微聚者，世尊說為非極微聚，故名極微聚！",
  "tatkasya hetoḥ | yo 'sau bhagavan paramāṇu-saṃcayas tathāgatena bhāṣito'samcayaḥ sa tathāgatena bhāṣitaḥ | tenocyate paramāṇu-saṃcaya iti |",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་ཚŀགས་ཞེས་གང་གསུངས་པ་དེ་ཚŀགས་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་རྡུལ་ཕྲ་རབ་ཀྱི་ཚŀགས་ཞེས་བགྱིའོ།།"
 ],
 "30.5": [
  "若及如來說三千大千世界者；非界，如來說；彼故，說名三千大千世界者。",
  "世尊，如來所說三千大千世界，則非世界，是名世界！",
  "如來說三千大千世界，即非世界，故名三千大千世界！",
  "世尊，如來所說三千大千世界，說為非世界，故名三千大千世界！",
  "yaś ca tathāgatena bhāṣitas trisāhasra-mahāsāhasro lokadhātur ity adhātuḥsa tathāgatena bhāṣitaḥ | tenocyate trisāhasra-mahāsāhasro lokadhātur iti |",
  "དེ་བཞིན་གཤེགས་པས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའ ི་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་གང་གསུངས་པ་དེ་ཁམས་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། དེས་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའ ི་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་བགྱིའོ། །"
 ],
 "30.6": [
  "彼何所因？彼，世尊！界有，彼如是摶取有。若如是，如來摶取說；非取，彼，如來說；彼故，說名摶取者。",
  "何以故？若世界實有者，則是一合相！如來說一合相，則非一合相，是名一合相！」",
  "何以故？世尊，若世界是實有者，即為一合執！如來說一合執，即為非執，故名一合執！」",
  "何以故？若世界實有，如來則有聚執！佛說聚執者，說為非聚執，是故說為聚執！」",
  "tatkasya hetoḥ | saced bhagavan lokadhātur abhaviṣyat sa eva piṇḍagrāho'bhaviṣyat yaś caiva piṇḍagrāhas tathāgatena bhāṣito 'grāhaḥ satathāgatena bhāṣitaḥ | tenocyate piṇḍagrāha iti |",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་གལ་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་ཤིག་མཆིས་པར་གྱུར་ན། དེ་ཉིད་རིལ་པོར་འཛིན་པར་འགྱུར་བའི་སླད་དུའོ།། དེ་བཞིན་གཤེགས་པས་རིལ་པོར་འཛིན་པར་གསུངས་པ་དེ་འཛིན་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་རིལ་པོར་འཛིན་པ་ཞེས་བགྱིའོ། །"
 ],
 "30.7": [
  "世尊言：摶取，如是，善實！不世俗語，不可說，非法，非非法，彼小兒凡夫生取。",
  "「須菩提，一合相者，則是不可說，但凡夫之人，貪著其事！",
  "佛言：「善現，此一合執，不可言說、不可戲論 ，然彼一切愚夫異生，強執是法！",
  "「妙生，此聚執者，是世言論，然其體性，實無可說，但是愚夫異生之所妄執！",
  "bhagavān āha | piṇḍagrāhaś caiva subhūte 'vyavahāro 'nabhilapyaḥ | na sadharmo na adharmaḥ | sa ca bālapṛthagjanair udgṛhītaḥ |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་རིལ་པོར་འཛིན་པ་ཉིད་ནི་ཐ་སྙད་དེ། ཆོས་དེ་ནི་བརྗོད་དུ་མེད་པ་ཡིན་ནོ། ། དེ་ཡང་བྱིས་པ་སོ་སོའ ི་སྐྱེ་བོ་རྣམས་ཀྱིས་གཟུང་ངོ་། །"
 ],
 "31.1": [
  "彼何所因？若此有，善實！如是說：『我見，如來說，眾生見、壽見、人見，如來說。』雖然，彼，善實！正說語？",
  "須菩提，若人言，『佛說我見、人見、眾生見、壽者見。』須菩提，於意云何，是人解我所說義不？」",
  "何以故？善現！若作是言，『如來宣說我見、有情見、命者見、士夫見、補特伽羅見、意生見、摩納婆見、作者見、受者見。』於汝意云何，如是所說為正語不？」",
  "妙生，如有說云，『佛說我見、眾生見、壽者見、更求趣見』者，是為正說為不正耶？」",
  "tatkasya hetoḥ | yo hi kaścit subhūta evaṃ vaded ātmadṛṣṭis tathāgatenabhāṣitā sattvadṛṣṭir jīvadṛṣṭiḥ pudgaladṛṣṭis tathāgatena bhāṣitā api nu sasubhūte samyagvadamāno vadet |",
  "རབ་འབྱོར་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ། དེ་བཞིན་གཤེགས་པས་བདག་ཏུ་ལྟ་བར་གསུངས། དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དུ་ལྟ་བ་དང༌། སྲོག་ཏུ་ལྟ་བ་དང༌། གང་ཟག་ཏུ་ལྟ་བར་གསུངས་སོ་ཞེས་ཟེར་ན་དེ་ཡང་དག་པས་སྨྲ་པས་སྨྲ་བ་ཡིན་ནམ།"
 ],
 "31.2": [
  "善實言：不如此，世尊！不如此，善逝！。",
  "「世尊，是人不解如來所說義！",
  "善現答言：「不也，世尊！不也，善逝！如是所說非為正語！",
  "妙生言：「不爾，世尊！",
  "subhūtir āha | no hīdaṃ bhagavan no hīdaṃ sugata na samyagvadamānovadet |",
  "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། ། བདེ་བར་གཤེགས་པ་དེ་ནི་མ་ལགས་སོ།།"
 ],
 "31.3": [
  "彼何所因？若彼，世尊！我見，如來說；非見，彼，如來說；彼故，說名我見者。",
  "何以故？世尊說我見、人見、眾生見、壽者見，即非我見、人見、眾生見、壽者見，是名我見、人見、眾生見、壽者見！」",
  "所以者何？如來所說我見、有情見、命者見、士夫見、補特伽羅見、意生見、摩納婆見、作者見、受者見，即為非見，故名我見乃至受者見！」",
  "何以故？若有我見如來說者，即是非見，故名我見！」",
  "tatkasya hetoḥ | yā sā bhagavann ātmadṛṣṭis tathāgatena bhāṣitā adṛṣṭiḥ sātathāgatena bhāṣitā | tenocyata ātmadṛṣṭir iti |",
  "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་བདག་ཏུ་ལྟ་བར་གང་གསུངས་པ་དེ་ནི་ལྟ་བ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་བདག་ཏུ་ལྟ་བ་ཞེས་བགྱིའོ། །"
 ],
 "31.4": [
  "世尊言：如是，此，善實！菩薩乘發行，一切法知應，見應，信解應。如信解，如無法想亦住。",
  "「須菩提，發阿耨多羅三藐三菩提心者，於一切法，應如是知、如是見、如是信解，不生法相！",
  "佛告善現：「諸有發趣菩薩乘者，於一切法，應如是知、應如是見、應如是信解，如是不住法想！",
  "「妙生，諸有發趣菩薩乘者，於一切法應如是知、如是見、如是解！如是解者乃至法想，亦無所住！",
  "bhagavān āha | evaṃ hi subhūte bodhisattva-yāna-saṃprasthitenasarva-dharmā jñātavyā draṣṭavyā adhimoktavyāḥ | tathā ca jñātavyā",
  "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པས། འདི་ལྟར་ཆོས་ཐམས་ཅད་ཤེས་པར་བྱ། ལྟ་བར་བྱ། མོས་པར་བྱ་སྟེ། ཅི་ནས་ཆོས་སུ་འདུ་ཤེས་པ་ལ་མི་གནས་པར་ཤེས་པར་བྱའོ། །"
 ],
 "31.5": [
  "彼何所因？法想、法想者，善實！非想，此，如來說；彼故，說名法想者。",
  "須菩提，所言法相者，如來說即非法相，是名法相！",
  "何以故？善現，法想法想者，如來說為非想，是故如來說名法想法想！ ",
  "何以故？妙生，法想法想者，如來說為非想，故名法想法想！",
  "tatkasya hetoḥ | dharma-saṃjñā dharmasaṃjñeti subhūte asaṃjñaiṣātathāgatena bhāṣitā | tenocyate dharmasaṃjñeti ||31||",
  "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཆོས་སུ་འདུ་ཤེས་ཆོས་སུ་འདུ་ཤེས་ཞེས་བྱ་བ་ནི། དེ་འདུ་ཤེས་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཕྱིར་ཏེ། དེས་ན་ཆོས་སུ་འདུ་ཤེས་ཆོས་སུ་འདུ་ཤེས་ཞེས་བྱའོ། །"
 ],
 "32.1": [
  "若復時，善實！菩薩摩訶薩無量無數世界七寶滿中作已，如來等、應等、正遍知等施與。",
  "須菩提，若有人以滿無量阿僧祇世界七寶持用布施；",
  "復次，善現，若菩薩摩訶薩以無量無數世界盛滿七寶，奉施如來、應、正等覺；",
  "妙生，若有人以滿無量無數世界七寶持用布施；",
  "yaśca khalu punaḥ subhūte bodhisattvo mahāsattvo 'prameyānasaṃkhyeyāṃllokadhātūn saptaratna-paripūrṇaṃ kṛtvā tathāgatebhyo'rhadbhyaḥ samyaksaṃbuddhebhyo dānaṃ dadyād",
  "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གིས་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་པ་དག་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ་སྦྱིན་པ་བྱིན་པ་བས།"
 ],
 "32.2": [
  "若善家子，若善家女，若如是智慧彼岸到，乃至四句等偈，受持、分別、讀誦，為他等及分別廣說。此如是，彼緣，多過福聚生，無量、不可數。",
  "若有善男子善女人發菩薩心者，持於此經乃至四句偈等，受持、讀誦、為人演說，其福勝彼！",
  "若善男子或善女人，於此般若波羅蜜多經中乃至四句伽他，受持、讀誦、究竟通利、如理作意，及廣為他宣說開示，由此因緣所生福聚甚多於前，無量無數！",
  "若復有人能於此經乃至受持、讀誦四句伽他，令其通利，廣為他人正說其義，以是因緣所生福聚極多於彼，無量無數！",
  "yaś ca kulaputro vā kuladuhitā vetaḥ prajñāpāramitāyā dharmaparyāyād antaśaś catuṣpādikām api gāthām udgṛhya dhārayed deśayed vācayet paryavāpnuyāt parebhyaś ca vistareṇa saṃprakāśayed ayam eva tatonidānaṃ bahutaraṃ puṇyaskandhaṃ prasunuyād aprameyamasaṃkhyeyam |",
  "རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་བྲིས་ནས་འཛིན་ཏམ། འཆང་ངམ། ཀློག་གམ། ཀུན་ཆུབ་པར་བྱེད་དམ། གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ན་དེ་ཉིད་གཞི་དེ་ལས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་དོ། །"
 ],
 "32.3": [
  "云何及廣說？如不廣說，彼故說名廣說。",
  "云何為人演說？不取於相，如如不動！",
  "云何為他宣說開示？如不為他宣說開示，故名為他宣說開示！」",
  "云何正說？無法可說，是名正說！」",
  "kathaṃ ca saṃprakāśayet | yathā na prakāśayet |tenocyate saṃprakāśayediti |",
  "ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཅེ་ན། ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་མི་སྟོན་པ་དེ་བཞིན་དུ་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་སྟེ། དེས་ན་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་ཞེས་བྱའོ། །"
 ],
 "32.4": [
  "星、翳、燈、幻，露、泡、夢、電，雲見如是，此有為者。",
  "何以故？一切有為法，如夢幻泡影，如露亦如電，應作如是觀！」",
  "爾時世尊而說頌曰：「諸和合所為，如星翳燈幻，露泡夢電雲，應作如是觀！」",
  "爾時世尊說伽他曰：「一切有為法，如星翳燈幻，露泡夢電雲，應作如是觀！」 ",
  "tārakā timiraṃ dīpo māyā-avaśyāya budbudaṃ |svapnaṃ ca vidyud abhraṃ ca evaṃ draṣṭavyaṃ saṃskṛtaṃ ||",
  "སྐར་མ་རབ་རིབ་མར་མེ་དང༌། ། སྒྱུ་མ་ཟིལ་པ་ཆུ་བུར་དང༌། ། རྨི་ལམ་གློག་དང་སྤྲིན་ལྟ་བུ། ། འདུ་བྱས་ཐམས་ཅད་དེ་ལྟར་ལྟ། །"
 ],
 "32.5": [
  "此語，世尊歡喜，上座善實，彼及比丘、比丘尼、優婆塞、優婆夷，彼天、人、阿脩羅、乾闥婆等，聞世尊說，大歡喜。",
  "佛說是經已，長老須菩提及諸比丘、比丘尼、優婆塞、優婆夷，一切世間天、人、阿修羅，聞佛所說，皆大歡喜，信受奉行。",
  "時薄伽梵說是經已，尊者善現及諸苾芻、苾芻尼、鄔波索迦、鄔波斯迦，并諸世間天、人、阿素洛、健達縛等，聞薄伽梵所說經已，皆大歡喜，信受奉行。",
  "爾時，薄伽梵說是經已，具壽妙生及諸菩薩摩訶薩、苾芻、苾芻尼、鄔波索迦、鄔波斯迦，一切世間天、人、阿蘇羅等，皆大歡喜，信受奉行。",
  "idam avocad bhagavān āttamanāḥ | sthavira subhūtis te cabhikṣu-bhikṣuṇy-upāsakopāsikās te ca bodhisattvāḥsadeva-mānuṣa-asura-gandharvaś ca loko bhagavato bhāṣitamabhyanandann iti |",
  "བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། གནས་བརྟན་རབ་འབྱོར་དང༌། དགེ་སློང་དེ་དག་དང༌།བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང༌། འཁོར་བཞི་པོ་དགེ་སློང་དང༌། དགེ་སློང་མ་དང༌། དགེ་བསྙེན་དང༌། དགེ་བསྙེན་མ་དང༌། ལྷ་དང༌། མི་དང་། ལྷ་མ་ཡིན་དང༌། དྲི་ཟར་བཅས་བའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །། "
 ],
 "6.5": [
  "於此章句能生信心，以此為實。",
  "（缺譯）",
  "（缺譯）",
  "ya imeṣv evaṃrūpeṣu sūtrānta-padeṣu bhāṣyamāṇeṣu bhūtasaṃjñāmutpādayiṣyanti |",
  " （缺譯）"
 ],
 "32.6": [
  "ārya-vajracchedikā bhagavatī prajñāpāramitā samāptā ||",
  "འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྡོ་རྗེ་གཅོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའ ི་མདོ་རྫོགས་སོ།། །།"
 ]
}